{"data": [{"id": "13_1", "context": "Oxygen is a chemical element with symbol O and atomic number 8. It is a member of the chalcogen group on the periodic table and is a highly reactive nonmetal and oxidizing agent that readily forms compounds (notably oxides) with most elements. By mass, oxygen is the third-most abundant element in the universe, after hydrogen and helium. At standard temperature and pressure, two atoms of the element bind to form dioxygen, a colorless and odorless diatomic gas with the formula O\n2. Diatomic oxygen gas constitutes 20.8% of the Earth's atmosphere. However, monitoring of atmospheric oxygen levels show a global downward trend, because of fossil-fuel burning. Oxygen is the most abundant element by mass in the Earth's crust as part of oxide compounds such as silicon dioxide, making up almost half of the crust's mass.", "questions": ["The atomic number of the periodic table for oxygen?", "What is the second most abundant element?", "How many atoms combine to form dioxygen?", "Roughly, how much oxygen makes up the Earth crust?", "Which gas makes up 20.8% of the Earth's atmosphere?", "How much of the earth's atmosphere is diatomic oxygen?", "What element makes up almost half of the earth's crust by mass?", "What is the atomic number for oxygen?", "Are atmospheric oxygen levels going up, down, or staying the same?", "What are the three most abundent elements of the universe by mass?", "What is the atomic number of the element oxygen?", "Of what group in the periodic table is oxygen a member?", "What type of compounds does oxygen most commonly form?", "Compared to other elements, how abundant does oxygen rank?", "Under normal conditions, what do two atoms of oxygen form?"]}, {"id": "13_2", "context": "Many major classes of organic molecules in living organisms, such as proteins, nucleic acids, carbohydrates, and fats, contain oxygen, as do the major inorganic compounds that are constituents of animal shells, teeth, and bone. Most of the mass of living organisms is oxygen as it is a part of water, the major constituent of lifeforms. Oxygen is used in cellular respiration and released by photosynthesis, which uses the energy of sunlight to produce oxygen from water. It is too chemically reactive to remain a free element in air without being continuously replenished by the photosynthetic action of living organisms. Another form (allotrope) of oxygen, ozone (O\n3), strongly absorbs UVB radiation and consequently the high-altitude ozone layer helps protect the biosphere from ultraviolet radiation, but is a pollutant near the surface where it is a by-product of smog. At even higher low earth orbit altitudes, sufficient atomic oxygen is present to cause erosion for spacecraft.", "questions": ["Oxygen is released in cellular respiration by?", "Photosynthesis uses which energy to for oxygen from water?", "_____ Helps the biospher from UV.", "What element is found in most organic organisms?", "In what major portion of living things is oxygen found?", "What life process produces oxygen in the presence of light?", "From what does photosynthesis get oxygen?", "What form of oxygen is composed of three oxygen atoms?"]}, {"id": "13_3", "context": "In the late 17th century, Robert Boyle proved that air is necessary for combustion. English chemist John Mayow (1641–1679) refined this work by showing that fire requires only a part of air that he called spiritus nitroaereus or just nitroaereus. In one experiment he found that placing either a mouse or a lit candle in a closed container over water caused the water to rise and replace one-fourteenth of the air's volume before extinguishing the subjects. From this he surmised that nitroaereus is consumed in both respiration and combustion.", "questions": ["Who proved that air is necessary for combustion?", "What English chemist showed that fire only needed nitoaereus?", "What is consumed in both combustion and respiration?", "John Mayow died in what year?", "What researcher showed that air is a necessity for combustion?", "What did John Mayow  name the part of air that caused combustion?", "In what century did Mayow and Boyle perform their experiments?", "Besides combustion, for what other action did Mayow show nitroaereus responsible?", "What chemist showed that fire needed only a part of air?"]}, {"id": "13_4", "context": "In the meantime, on August 1, 1774, an experiment conducted by the British clergyman Joseph Priestley focused sunlight on mercuric oxide (HgO) inside a glass tube, which liberated a gas he named \"dephlogisticated air\". He noted that candles burned brighter in the gas and that a mouse was more active and lived longer while breathing it. After breathing the gas himself, he wrote: \"The feeling of it to my lungs was not sensibly different from that of common air, but I fancied that my breast felt peculiarly light and easy for some time afterwards.\" Priestley published his findings in 1775 in a paper titled \"An Account of Further Discoveries in Air\" which was included in the second volume of his book titled Experiments and Observations on Different Kinds of Air. Because he published his findings first, Priestley is usually given priority in the discovery.", "questions": ["\"An Account of Further Discoveries in Air\" was published by who in 1775?", "What was the occupation of Joseph Priestley?", "The symbol for mercuric oxide is?", "By sunlight, what compound did  Priestley concentrate on to make the gas he called \"dephlogisticated air\"?", "What chemical did Priestley use in his experiments on oxygen?", "What did Priestley name the gas his experiment produced?", "In what year did Priestley publish the findings of his experiments?", "Why is Priestley usually given credit for being first to discover oxygen?", "What effect did breathing Priestley's discovered gas have on the experiment's mouse?"]}, {"id": "13_5", "context": "One of the first known experiments on the relationship between combustion and air was conducted by the 2nd century BCE Greek writer on mechanics, Philo of Byzantium. In his work Pneumatica, Philo observed that inverting a vessel over a burning candle and surrounding the vessel's neck with water resulted in some water rising into the neck. Philo incorrectly surmised that parts of the air in the vessel were converted into the classical element fire and thus were able to escape through pores in the glass. Many centuries later Leonardo da Vinci built on Philo's work by observing that a portion of air is consumed during combustion and respiration.", "questions": ["What inventor built on to the findings of Philo of  Byzantium?", "Pneumatica was written by what Greek writer?", "In what year was the first known experiments on combustion and air conducted?", "Philo of Byzantium ____ surmised that air converted to fire", "What early Greek wrote about experiments on air and combustion?", "What did Philo incorrectly assume that the air became?", "What was the title of Philo's work?", "What famous artist later further investigated Philo's experiments?", "Of what did da Vinci think a part  was consumed during combustion?"]}, {"id": "13_6", "context": "Highly concentrated sources of oxygen promote rapid combustion. Fire and explosion hazards exist when concentrated oxidants and fuels are brought into close proximity; an ignition event, such as heat or a spark, is needed to trigger combustion. Oxygen is the oxidant, not the fuel, but nevertheless the source of most of the chemical energy released in combustion. Combustion hazards also apply to compounds of oxygen with a high oxidative potential, such as peroxides, chlorates, nitrates, perchlorates, and dichromates because they can donate oxygen to a fire.", "questions": ["What is needed to make combustion happen?", "Combustion is caused by an oxidant and a fuel. What role does oxygen play in combustion?", "Peroxides, nitrates and dichromates are examples of what type of compounds?", "Although not a fuel  ___ is the chemical compound the generates the most occurrence of explosions.", "What is a spark or heat to the progress of a fire?", "Rather than the fuel, what is oxygen to a fire?", "What can concentrated oxygen produce?", "What does oxygen the basis for in combustion?", "What other sources of high oxidative potential can add to a fire?"]}, {"id": "13_7", "context": "Concentrated O\n2 will allow combustion to proceed rapidly and energetically. Steel pipes and storage vessels used to store and transmit both gaseous and liquid oxygen will act as a fuel; and therefore the design and manufacture of O\n2 systems requires special training to ensure that ignition sources are minimized. The fire that killed the Apollo 1 crew in a launch pad test spread so rapidly because the capsule was pressurized with pure O\n2 but at slightly more than atmospheric pressure, instead of the 1⁄3 normal pressure that would be used in a mission.[k]", "questions": ["What chemical element was the cause of the Apollo 1 disastrous outcome?", "______ In both liquid and gas form can fastly result in an exlposion.", "To ensure safety of future space missions Oxygen was used at _____ of the normal pressure.", "To reduce the chances of combustion ___ is required for safely handeling pure O.", "What will concentrated oxygen greatly speed up?", "Because of the danger inherent in concentrated oxygen, what is a concern about keeping it?", "What does the transport and storage demand for safety in dealing with oxygen?", "Who did a pressurized oxygen cabin fire kill?"]}, {"id": "13_8", "context": "Oxygen is present in the atmosphere in trace quantities in the form of carbon dioxide (CO\n2). The Earth's crustal rock is composed in large part of oxides of silicon (silica SiO\n2, as found in granite and quartz), aluminium (aluminium oxide Al\n2O\n3, in bauxite and corundum), iron (iron(III) oxide Fe\n2O\n3, in hematite and rust), and calcium carbonate (in limestone). The rest of the Earth's crust is also made of oxygen compounds, in particular various complex silicates (in silicate minerals). The Earth's mantle, of much larger mass than the crust, is largely composed of silicates of magnesium and iron.", "questions": ["Granite is made up largely of what chemical compound?", "Oxygen exists in the atmosphere by way of what?", "Silicates of magnesium and iron make up of the Earth's ___", "In what compound is oxygen found in small amounts in the atmosphere?", "What geologic feature is composed of oxygen oxides?", "What part of the Earth is composed of mostly of silicates of iron and magnesium?", "What part of the Earth's geological structure is larger than the crust?", "Aside from oxides, what other compounds comprise a large portion of the Earth's crust?"]}, {"id": "13_9", "context": "John Dalton's original atomic hypothesis assumed that all elements were monatomic and that the atoms in compounds would normally have the simplest atomic ratios with respect to one another. For example, Dalton assumed that water's formula was HO, giving the atomic mass of oxygen as 8 times that of hydrogen, instead of the modern value of about 16. In 1805, Joseph Louis Gay-Lussac and Alexander von Humboldt showed that water is formed of two volumes of hydrogen and one volume of oxygen; and by 1811 Amedeo Avogadro had arrived at the correct interpretation of water's composition, based on what is now called Avogadro's law and the assumption of diatomic elemental molecules.[a]", "questions": ["What did John Dalton think that all elements were in number present in compounds?", "What did Dalton think the atomic ratios were between atoms in compounds?", "What was Dalton's erroneous formula for water?", "What element did Gay-Lussac and von Humboldt discover was present in twice the amount of oxygen in water?", "What theory was arrived at in 1811 that presented the assumption of diatomic molecules?"]}, {"id": "13_10", "context": "Highly combustible materials that leave little residue, such as wood or coal, were thought to be made mostly of phlogiston; whereas non-combustible substances that corrode, such as iron, contained very little. Air did not play a role in phlogiston theory, nor were any initial quantitative experiments conducted to test the idea; instead, it was based on observations of what happens when something burns, that most common objects appear to become lighter and seem to lose something in the process. The fact that a substance like wood gains overall weight in burning was hidden by the buoyancy of the gaseous combustion products. Indeed, one of the first clues that the phlogiston theory was incorrect was that metals, too, gain weight in rusting (when they were supposedly losing phlogiston).", "questions": ["Of what were materials that left little residue thought to contain?", "What type of combustible materials were considered to have little philogiston?", "What distinct quality of combustion was  absent from philogiston theory? ", "What material's weight gain during rusting was an early clue that philogiston theory was wrong?", "What characteristic due most items display after burning?"]}, {"id": "13_11", "context": "In this dioxygen, the two oxygen atoms are chemically bonded to each other. The bond can be variously described based on level of theory, but is reasonably and simply described as a covalent double bond that results from the filling of molecular orbitals formed from the atomic orbitals of the individual oxygen atoms, the filling of which results in a bond order of two. More specifically, the double bond is the result of sequential, low-to-high energy, or Aufbau, filling of orbitals, and the resulting cancellation of contributions from the 2s electrons, after sequential filling of the low σ and σ* orbitals; σ overlap of the two atomic 2p orbitals that lie along the O-O molecular axis and π overlap of two pairs of atomic 2p orbitals perpendicular to the O-O molecular axis, and then cancellation of contributions from the remaining two of the six 2p electrons after their partial filling of the lowest π and π* orbitals.", "questions": ["How is dioxygen most simply described?", "What is the bond order of dioxygen molecules?", "What is a descriptive term for a low-to-high energy bond?", "In dioxygen how are the two oxygen atoms bonded together?", "Of what does the covalent double bond result from ?"]}, {"id": "13_12", "context": "Oxygen was discovered independently by Carl Wilhelm Scheele, in Uppsala, in 1773 or earlier, and Joseph Priestley in Wiltshire, in 1774, but Priestley is often given priority because his work was published first. The name oxygen was coined in 1777 by Antoine Lavoisier, whose experiments with oxygen helped to discredit the then-popular phlogiston theory of combustion and corrosion. Its name derives from the Greek roots ὀξύς oxys, \"acid\", literally \"sharp\", referring to the sour taste of acids and -γενής -genes, \"producer\", literally \"begetter\", because at the time of naming, it was mistakenly thought that all acids required oxygen in their composition. Common uses of oxygen includes the production cycle of steel, plastics and textiles, brazing, welding and cutting of steels and other metals, rocket propellant, in oxygen therapy and life support systems in aircraft, submarines, spaceflight and diving.", "questions": ["When did Carl Wilhelm Scheele discover oxygen?", "In what year did Joseph Priestley recognize oxygen?", "What gave Priestley the claim to being the first discovered of oxygen?", "What researcher first used the word oxygen ?", "What previous work did Lavoisier experiments discredit?"]}, {"id": "13_13", "context": "This combination of cancellations and σ and π overlaps results in dioxygen's double bond character and reactivity, and a triplet electronic ground state. An electron configuration with two unpaired electrons as found in dioxygen (see the filled π* orbitals in the diagram), orbitals that are of equal energy—i.e., degenerate—is a configuration termed a spin triplet state. Hence, the ground state of the O\n2 molecule is referred to as triplet oxygen.[b] The highest energy, partially filled orbitals are antibonding, and so their filling weakens the bond order from three to two. Because of its unpaired electrons, triplet oxygen reacts only slowly with most organic molecules, which have paired electron spins; this prevents spontaneous combustion.", "questions": ["What is the term for the arrangement of two unpaired electrons in dioxygen?", "How is the O2 molecule referred to in its ground state? ", "What causes triplet oxygen to react slowly?", "What type of combustion does the slow reaction of triplet oxygen prevent?", "What are the weakly filled higher orbitals of oxygen?"]}, {"id": "13_14", "context": "In one experiment, Lavoisier observed that there was no overall increase in weight when tin and air were heated in a closed container. He noted that air rushed in when he opened the container, which indicated that part of the trapped air had been consumed. He also noted that the tin had increased in weight and that increase was the same as the weight of the air that rushed back in. This and other experiments on combustion were documented in his book Sur la combustion en général, which was published in 1777. In that work, he proved that air is a mixture of two gases; 'vital air', which is essential to combustion and respiration, and azote (Gk. ἄζωτον \"lifeless\"), which did not support either. Azote later became nitrogen in English, although it has kept the name in French and several other European languages.", "questions": ["What did Lavoisier conclude was consumed by combustion in his experiments?", "In what way did Lavoisier see that the tin he used in his experiment had increased?", "What did Lavoisier perceive the air had lost as much as the tin had gained", "In what year did Lavoisier publish his work on combustion?", "What second part of air was deemed lifeless by Lavoisier?"]}, {"id": "13_15", "context": "Trioxygen (O\n3) is usually known as ozone and is a very reactive allotrope of oxygen that is damaging to lung tissue. Ozone is produced in the upper atmosphere when O\n2 combines with atomic oxygen made by the splitting of O\n2 by ultraviolet (UV) radiation. Since ozone absorbs strongly in the UV region of the spectrum, the ozone layer of the upper atmosphere functions as a protective radiation shield for the planet. Near the Earth's surface, it is a pollutant formed as a by-product of automobile exhaust. The metastable molecule tetraoxygen (O\n4) was discovered in 2001, and was assumed to exist in one of the six phases of solid oxygen. It was proven in 2006 that this phase, created by pressurizing O\n2 to 20 GPa, is in fact a rhombohedral O\n8 cluster. This cluster has the potential to be a much more powerful oxidizer than either O\n2 or O\n3 and may therefore be used in rocket fuel. A metallic phase was discovered in 1990 when solid oxygen is subjected to a pressure of above 96 GPa and it was shown in 1998 that at very low temperatures, this phase becomes superconducting.", "questions": ["What is the name for O3 most often used?", "Of what is ozone a reactive part of oxygen?", "What  does ozone's characteristic to cause damage effect?", "What function does ozone perform for the planet?", "What light radiation does ozone absorb?"]}, {"id": "13_16", "context": "The common allotrope of elemental oxygen on Earth is called dioxygen, O\n2. It is the form that is a major part of the Earth's atmosphere (see Occurrence). O2 has a bond length of 121 pm and a bond energy of 498 kJ·mol−1, which is smaller than the energy of other double bonds or pairs of single bonds in the biosphere and responsible for the exothermic reaction of O2 with any organic molecule. Due to its energy content, O2 is used by complex forms of life, such as animals, in cellular respiration (see Biological role). Other aspects of O\n2 are covered in the remainder of this article.", "questions": ["What is the most common form of oxygen on the planet?", "What is the scientific designation of oxygen? ", "What part the composition of the Earth's atmosphere is comprised of oxygen?", "What characteristic of oxygen makes it necessary to life?", "For what purpose is oxygen used by animal life?"]}, {"id": "13_17", "context": "In 1891 Scottish chemist James Dewar was able to produce enough liquid oxygen to study. The first commercially viable process for producing liquid oxygen was independently developed in 1895 by German engineer Carl von Linde and British engineer William Hampson. Both men lowered the temperature of air until it liquefied and then distilled the component gases by boiling them off one at a time and capturing them. Later, in 1901, oxyacetylene welding was demonstrated for the first time by burning a mixture of acetylene and compressed O\n2. This method of welding and cutting metal later became common.", "questions": ["What chemist managed to make enough liquid oxygen to use for study?", "In what year did Dewar experiment on liquid oxygen?", "When was liquid oxygen developed for commercial use?", "What welding process was demonstrated in 1901?"]}, {"id": "13_18", "context": "Oxygen is more soluble in water than nitrogen is. Water in equilibrium with air contains approximately 1 molecule of dissolved O\n2 for every 2 molecules of N\n2, compared to an atmospheric ratio of approximately 1:4. The solubility of oxygen in water is temperature-dependent, and about twice as much (14.6 mg·L−1) dissolves at 0 °C than at 20 °C (7.6 mg·L−1). At 25 °C and 1 standard atmosphere (101.3 kPa) of air, freshwater contains about 6.04 milliliters (mL) of oxygen per liter, whereas seawater contains about 4.95 mL per liter. At 5 °C the solubility increases to 9.0 mL (50% more than at 25 °C) per liter for water and 7.2 mL (45% more) per liter for sea water.", "questions": ["What component of water is more soluble than nitrogen?", "Upon what chemical characteristic is oxygen's solubility dependent?", "How much oxygen is found is a liter of fresh water under normal conditions?", "In what type of water does oxygen dissolve more slowly?", "How much more oxygen dissolves at 0 degrees C than at 20 degrees C?"]}, {"id": "13_19", "context": "Oxygen is the most abundant chemical element by mass in the Earth's biosphere, air, sea and land. Oxygen is the third most abundant chemical element in the universe, after hydrogen and helium. About 0.9% of the Sun's mass is oxygen. Oxygen constitutes 49.2% of the Earth's crust by mass and is the major component of the world's oceans (88.8% by mass). Oxygen gas is the second most common component of the Earth's atmosphere, taking up 20.8% of its volume and 23.1% of its mass (some 1015 tonnes).[d] Earth is unusual among the planets of the Solar System in having such a high concentration of oxygen gas in its atmosphere: Mars (with 0.1% O\n2 by volume) and Venus have far lower concentrations. The O\n2 surrounding these other planets is produced solely by ultraviolet radiation impacting oxygen-containing molecules such as carbon dioxide.", "questions": ["Where does oxygen rank by mass in the planet's biosphere?", "How is oxygen ranked as abundant in the universe?", "How much of the sun is made up of oxygen?", "Where  by mass is oxygen a major part?", "How is oxygen produced from carbon dioxide on the other planets of the solar system?"]}, {"id": "13_20", "context": "By the late 19th century scientists realized that air could be liquefied, and its components isolated, by compressing and cooling it. Using a cascade method, Swiss chemist and physicist Raoul Pierre Pictet evaporated liquid sulfur dioxide in order to liquefy carbon dioxide, which in turn was evaporated to cool oxygen gas enough to liquefy it. He sent a telegram on December 22, 1877 to the French Academy of Sciences in Paris announcing his discovery of liquid oxygen. Just two days later, French physicist Louis Paul Cailletet announced his own method of liquefying molecular oxygen. Only a few drops of the liquid were produced in either case so no meaningful analysis could be conducted. Oxygen was liquified in stable state for the first time on March 29, 1883 by Polish scientists from Jagiellonian University, Zygmunt Wróblewski and Karol Olszewski.", "questions": ["By what century did researchers see that they could liquefy air?", "By what means were scientists able to liquefy air?", "What scientist told the French Academy of Sciences that he had found how to liquefy oxygen?", "What minor amount of liquid oxygen was produced by early French experimenters?", "On what date was oxygen liquefied in a stable form?"]}, {"id": "13_21", "context": "Planetary geologists have measured different abundances of oxygen isotopes in samples from the Earth, the Moon, Mars, and meteorites, but were long unable to obtain reference values for the isotope ratios in the Sun, believed to be the same as those of the primordial solar nebula. Analysis of a silicon wafer exposed to the solar wind in space and returned by the crashed Genesis spacecraft has shown that the Sun has a higher proportion of oxygen-16 than does the Earth. The measurement implies that an unknown process depleted oxygen-16 from the Sun's disk of protoplanetary material prior to the coalescence of dust grains that formed the Earth.", "questions": ["What celestial object eluded efforts to measure oxygen?", "What molecule does the Sun have in higher proportion than Earth?", "What spacecraft contained data to determine the oxygen content of the Sun?", "What type of process was involved the the depletion of the Sun's oxygen 16?", "Before the formation of which planet, did Sol lose oxygen 16?"]}, {"id": "13_22", "context": "Singlet oxygen is a name given to several higher-energy species of molecular O\n2 in which all the electron spins are paired. It is much more reactive towards common organic molecules than is molecular oxygen per se. In nature, singlet oxygen is commonly formed from water during photosynthesis, using the energy of sunlight. It is also produced in the troposphere by the photolysis of ozone by light of short wavelength, and by the immune system as a source of active oxygen. Carotenoids in photosynthetic organisms (and possibly also in animals) play a major role in absorbing energy from singlet oxygen and converting it to the unexcited ground state before it can cause harm to tissues.", "questions": ["What is the name for a form of oxygen in which electrons are paired?", "To what is singlet oxygen more reactive?", "In what process is singlet oxygen usually formed?", "By what process is singlet oxygen made in the tropophere?", "What objects in organisms absorb singlet oxygen to prevent harm?"]}, {"id": "13_23", "context": "Paleoclimatologists measure the ratio of oxygen-18 and oxygen-16 in the shells and skeletons of marine organisms to determine what the climate was like millions of years ago (see oxygen isotope ratio cycle). Seawater molecules that contain the lighter isotope, oxygen-16, evaporate at a slightly faster rate than water molecules containing the 12% heavier oxygen-18; this disparity increases at lower temperatures. During periods of lower global temperatures, snow and rain from that evaporated water tends to be higher in oxygen-16, and the seawater left behind tends to be higher in oxygen-18. Marine organisms then incorporate more oxygen-18 into their skeletons and shells than they would in a warmer climate. Paleoclimatologists also directly measure this ratio in the water molecules of ice core samples that are up to several hundreds of thousands of years old.", "questions": ["What group of scientists seek to measure the amounts of oxygen in marine animals?", "About what weather feature do paleoclimatologists want information ?", "How much heavier is oxygen 18 than oxygen 16?", "What form of oxygen do marine animals acquire in greater amounts during cooler climatic conditions?", "During what type of climate is oxygen 18 in seawater at higher levels?"]}, {"id": "13_24", "context": "Oxygen presents two spectrophotometric absorption bands peaking at the wavelengths 687 and 760 nm. Some remote sensing scientists have proposed using the measurement of the radiance coming from vegetation canopies in those bands to characterize plant health status from a satellite platform. This approach exploits the fact that in those bands it is possible to discriminate the vegetation's reflectance from its fluorescence, which is much weaker. The measurement is technically difficult owing to the low signal-to-noise ratio and the physical structure of vegetation; but it has been proposed as a possible method of monitoring the carbon cycle from satellites on a global scale.", "questions": ["At what wavelength do the spectrophotometric bands peak?", "To monitor what event would measuring radiance from vegetation provide information?", "From where would scientists like measure vegetation radiance?", "On what scale would scientists show measurements of vegetation?", "What style of sensing do scientist like to use to measure global radiance?"]}, {"id": "13_25", "context": "In the triplet form, O\n2 molecules are paramagnetic. That is, they impart magnetic character to oxygen when it is in the presence of a magnetic field, because of the spin magnetic moments of the unpaired electrons in the molecule, and the negative exchange energy between neighboring O\n2 molecules. Liquid oxygen is attracted to a magnet to a sufficient extent that, in laboratory demonstrations, a bridge of liquid oxygen may be supported against its own weight between the poles of a powerful magnet.[c]", "questions": ["What magnetic character do triplet O2 have?", "In experiments, a bridge of what element can be built between poles of a magnet?", "The spin of what can produce a magnetic effect to oxygen molecules?", "What kind of field is necessary to produce a magnet effect in oxygen molecules?", "What device is used to test the magnetic attractions involved in liquid oxygen?"]}, {"id": "13_26", "context": "Reactive oxygen species, such as superoxide ion (O−\n2) and hydrogen peroxide (H\n2O\n2), are dangerous by-products of oxygen use in organisms. Parts of the immune system of higher organisms create peroxide, superoxide, and singlet oxygen to destroy invading microbes. Reactive oxygen species also play an important role in the hypersensitive response of plants against pathogen attack. Oxygen is toxic to obligately anaerobic organisms, which were the dominant form of early life on Earth until O\n2 began to accumulate in the atmosphere about 2.5 billion years ago during the Great Oxygenation Event, about a billion years after the first appearance of these organisms.", "questions": ["What do the reactive forms of oxygen produce in organisms?", "For what purpose do organisms make peroxide and superoxide?", "Against what does reactive oxygen play in plant defense?", "To what type of organisms is oxygen toxic?", "When did O2 begin to acculturate in the atmosphere?"]}, {"id": "13_27", "context": "Oxygen condenses at 90.20 K (−182.95 °C, −297.31 °F), and freezes at 54.36 K (−218.79 °C, −361.82 °F). Both liquid and solid O\n2 are clear substances with a light sky-blue color caused by absorption in the red (in contrast with the blue color of the sky, which is due to Rayleigh scattering of blue light). High-purity liquid O\n2 is usually obtained by the fractional distillation of liquefied air. Liquid oxygen may also be produced by condensation out of air, using liquid nitrogen as a coolant. It is a highly reactive substance and must be segregated from combustible materials.", "questions": ["At what temperature will oxygen condense?", "What is the clarity of liquid oxygen?", "What substance is used to make high quality liquid O2?", "What element is used as a coolant in the process of making liquid oxygen?", "From what type of materials must liquid oxygen be separated?"]}, {"id": "13_28", "context": "Free oxygen also occurs in solution in the world's water bodies. The increased solubility of O\n2 at lower temperatures (see Physical properties) has important implications for ocean life, as polar oceans support a much higher density of life due to their higher oxygen content. Water polluted with plant nutrients such as nitrates or phosphates may stimulate growth of algae by a process called eutrophication and the decay of these organisms and other biomaterials may reduce amounts of O\n2 in eutrophic water bodies. Scientists assess this aspect of water quality by measuring the water's biochemical oxygen demand, or the amount of O\n2 needed to restore it to a normal concentration.", "questions": ["Where on Earth is free oxygen found?", "At what temperatures is O2 more soluble?", "Why do polar water bodies support a higher amount of life?", "Pollution of water by nitrates and phosphates will encourage the growth of what?", "What measurement do scientists used to determine the quality of water?"]}, {"id": "13_29", "context": "Free oxygen gas was almost nonexistent in Earth's atmosphere before photosynthetic archaea and bacteria evolved, probably about 3.5 billion years ago. Free oxygen first appeared in significant quantities during the Paleoproterozoic eon (between 3.0 and 2.3 billion years ago). For the first billion years, any free oxygen produced by these organisms combined with dissolved iron in the oceans to form banded iron formations. When such oxygen sinks became saturated, free oxygen began to outgas from the oceans 3–2.7 billion years ago, reaching 10% of its present level around 1.7 billion years ago.", "questions": ["When did photosynthetic organisms evolve on Earth?", "During which eon did free oxygen begin appearing in quantity?", "At first, what did oxygen and iron combine to form?", "How long ago did oxygen reach 10% of its present level?", "When did oxygen begin to move from the oceans to the atmosphere?"]}, {"id": "13_30", "context": "The unusually high concentration of oxygen gas on Earth is the result of the oxygen cycle. This biogeochemical cycle describes the movement of oxygen within and between its three main reservoirs on Earth: the atmosphere, the biosphere, and the lithosphere. The main driving factor of the oxygen cycle is photosynthesis, which is responsible for modern Earth's atmosphere. Photosynthesis releases oxygen into the atmosphere, while respiration and decay remove it from the atmosphere. In the present equilibrium, production and consumption occur at the same rate of roughly 1/2000th of the entire atmospheric oxygen per year.", "questions": ["What produces the high levels of oxygen on Earth?", "What type of process is the oxygen cycle?", "In how many places is oxygen stored in its cycle?", "What process is responsible for the planet's oxygen content?", "What does photosynthesis release into the Earth's atmosphere?"]}, {"id": "13_31", "context": "The other major method of producing O\n2 gas involves passing a stream of clean, dry air through one bed of a pair of identical zeolite molecular sieves, which absorbs the nitrogen and delivers a gas stream that is 90% to 93% O\n2. Simultaneously, nitrogen gas is released from the other nitrogen-saturated zeolite bed, by reducing the chamber operating pressure and diverting part of the oxygen gas from the producer bed through it, in the reverse direction of flow. After a set cycle time the operation of the two beds is interchanged, thereby allowing for a continuous supply of gaseous oxygen to be pumped through a pipeline. This is known as pressure swing adsorption. Oxygen gas is increasingly obtained by these non-cryogenic technologies (see also the related vacuum swing adsorption).", "questions": ["What mechanism can be used to make oxygen?", "What percentage of oxygen will a zeolite sieve produce?", "While producing oxygen, what gas does a zeolite sieve absorb?", "What type of technology is the non organic separating of gases?", "How much is the sieve method of gas production used?"]}, {"id": "13_32", "context": "Oxygen gas can also be produced through electrolysis of water into molecular oxygen and hydrogen. DC electricity must be used: if AC is used, the gases in each limb consist of hydrogen and oxygen in the explosive ratio 2:1. Contrary to popular belief, the 2:1 ratio observed in the DC electrolysis of acidified water does not prove that the empirical formula of water is H2O unless certain assumptions are made about the molecular formulae of hydrogen and oxygen themselves. A similar method is the electrocatalytic O\n2 evolution from oxides and oxoacids. Chemical catalysts can be used as well, such as in chemical oxygen generators or oxygen candles that are used as part of the life-support equipment on submarines, and are still part of standard equipment on commercial airliners in case of depressurization emergencies. Another air separation technology involves forcing air to dissolve through ceramic membranes based on zirconium dioxide by either high pressure or an electric current, to produce nearly pure O\n2 gas.", "questions": ["Electrolysis of what can be used to produce oxygen and hydrogen?", "What does the electrolysis of water produce?", "What type of electric current is needed for electrolysis?", "What is the source of oxygen production through electrocatalytic means?", "What other catalysts can be used to produce oxygen?"]}, {"id": "13_33", "context": "Oxygen, as a supposed mild euphoric, has a history of recreational use in oxygen bars and in sports. Oxygen bars are establishments, found in Japan, California, and Las Vegas, Nevada since the late 1990s that offer higher than normal O\n2 exposure for a fee. Professional athletes, especially in American football, also sometimes go off field between plays to wear oxygen masks in order to get a \"boost\" in performance. The pharmacological effect is doubtful; a placebo effect is a more likely explanation. Available studies support a performance boost from enriched O\n2 mixtures only if they are breathed during aerobic exercise.", "questions": ["As a euphoric how is oxygen used in bars?", "What is the effect on humans of oxygen?", "What do professional athletes seek to boost from breathing oxygen?", "What is the most likely effect of breathing oxygen?", "What type of exercise does research show receives a boost in performance from oxygen?"]}, {"id": "13_34", "context": "Hyperbaric (high-pressure) medicine uses special oxygen chambers to increase the partial pressure of O\n2 around the patient and, when needed, the medical staff. Carbon monoxide poisoning, gas gangrene, and decompression sickness (the 'bends') are sometimes treated using these devices. Increased O\n2 concentration in the lungs helps to displace carbon monoxide from the heme group of hemoglobin. Oxygen gas is poisonous to the anaerobic bacteria that cause gas gangrene, so increasing its partial pressure helps kill them. Decompression sickness occurs in divers who decompress too quickly after a dive, resulting in bubbles of inert gas, mostly nitrogen and helium, forming in their blood. Increasing the pressure of O\n2 as soon as possible is part of the treatment.", "questions": ["What device is used to treat various conditions such as carbon monoxide poisoning?", "What does increased oxygen concentrations in the patient's lungs displace?", "To what pathogen that causes gas gangrene is oxygen poisonous?", "What occurs after a dive in which a diver decompresses too quickly?"]}, {"id": "13_35", "context": "Uptake of O\n2 from the air is the essential purpose of respiration, so oxygen supplementation is used in medicine. Treatment not only increases oxygen levels in the patient's blood, but has the secondary effect of decreasing resistance to blood flow in many types of diseased lungs, easing work load on the heart. Oxygen therapy is used to treat emphysema, pneumonia, some heart disorders (congestive heart failure), some disorders that cause increased pulmonary artery pressure, and any disease that impairs the body's ability to take up and use gaseous oxygen.", "questions": ["What medical treatment is used to benefit patients with hearth and lung disorders?", "By decreasing resistance to blood flow in the lungs, what organ's workload  can be eased?", "What medical treatment is used to increase oxygen uptake in a patient?", "In what process is the uptake from oxygen necessary?", "What does  oxygen therapy promote the body to take up?"]}, {"id": "13_36", "context": "Due to its electronegativity, oxygen forms chemical bonds with almost all other elements to give corresponding oxides. The surface of most metals, such as aluminium and titanium, are oxidized in the presence of air and become coated with a thin film of oxide that passivates the metal and slows further corrosion. Many oxides of the transition metals are non-stoichiometric compounds, with slightly less metal than the chemical formula would show. For example, the mineral FeO (wüstite) is written as Fe\n1 − xO, where x is usually around 0.05.", "questions": ["What characteristic of oxygen causes it to form bonds with other elements?", "What is usual form of oxygen bound compounds?", "What is the mineral wustite?", "What does oxygen cause to form on metals?", "What does the film of oxide on metals delay?"]}, {"id": "13_37", "context": "People who climb mountains or fly in non-pressurized fixed-wing aircraft sometimes have supplemental O\n2 supplies.[h] Passengers traveling in (pressurized) commercial airplanes have an emergency supply of O\n2 automatically supplied to them in case of cabin depressurization. Sudden cabin pressure loss activates chemical oxygen generators above each seat, causing oxygen masks to drop. Pulling on the masks \"to start the flow of oxygen\" as cabin safety instructions dictate, forces iron filings into the sodium chlorate inside the canister. A steady stream of oxygen gas is then produced by the exothermic reaction.", "questions": ["What event would necessitate airline passengers to need a supplemental supply of oxygen? ", "What is the type of oxygen production for emergency oxygen in airlines?", "What type of reaction is present in the emergency oxygen generator of an airplane?", "What gas does the airline exothermic reaction produce?"]}, {"id": "13_38", "context": "Oxygen storage methods include high pressure oxygen tanks, cryogenics and chemical compounds. For reasons of economy, oxygen is often transported in bulk as a liquid in specially insulated tankers, since one liter of liquefied oxygen is equivalent to 840 liters of gaseous oxygen at atmospheric pressure and 20 °C (68 °F). Such tankers are used to refill bulk liquid oxygen storage containers, which stand outside hospitals and other institutions with a need for large volumes of pure oxygen gas. Liquid oxygen is passed through heat exchangers, which convert the cryogenic liquid into gas before it enters the building. Oxygen is also stored and shipped in smaller cylinders containing the compressed gas; a form that is useful in certain portable medical applications and oxy-fuel welding and cutting.", "questions": ["What do oxygen tanks, cryogenics, and chemical compounds serve as for oxygen?", "By what means is bulk oxygen shipped?", "In what state is oxygen shipped in bulk?", "In what form is oxygen transported in smaller containers?", "What type of organization would need large quantities of pure oxygen?"]}, {"id": "13_39", "context": "Among the most important classes of organic compounds that contain oxygen are (where \"R\" is an organic group): alcohols (R-OH); ethers (R-O-R); ketones (R-CO-R); aldehydes (R-CO-H); carboxylic acids (R-COOH); esters (R-COO-R); acid anhydrides (R-CO-O-CO-R); and amides (R-C(O)-NR\n2). There are many important organic solvents that contain oxygen, including: acetone, methanol, ethanol, isopropanol, furan, THF, diethyl ether, dioxane, ethyl acetate, DMF, DMSO, acetic acid, and formic acid. Acetone ((CH\n3)\n2CO) and phenol (C\n6H\n5OH) are used as feeder materials in the synthesis of many different substances. Other important organic compounds that contain oxygen are: glycerol, formaldehyde, glutaraldehyde, citric acid, acetic anhydride, and acetamide. Epoxides are ethers in which the oxygen atom is part of a ring of three atoms.", "questions": ["What type of compounds such as acetone,contain oxygen?", "In what group of compounds is oxygen a necessary part?", "What function do compounds like phenol and acetone serve in the manufacture of many other substances?", "In what compound is oxygen part of a ring arrangement?", "How are the compounds that contain oxygen considered in commerce?"]}, {"id": "13_40", "context": "The element is found in almost all biomolecules that are important to (or generated by) life. Only a few common complex biomolecules, such as squalene and the carotenes, contain no oxygen. Of the organic compounds with biological relevance, carbohydrates contain the largest proportion by mass of oxygen. All fats, fatty acids, amino acids, and proteins contain oxygen (due to the presence of carbonyl groups in these acids and their ester residues). Oxygen also occurs in phosphate (PO3−\n4) groups in the biologically important energy-carrying molecules ATP and ADP, in the backbone and the purines (except adenine) and pyrimidines of RNA and DNA, and in bones as calcium phosphate and hydroxylapatite.", "questions": ["In what type of molecules are oxygen found?", "How many biomolecules contain no oxygen?", "Which organic compounds contain the greatest amount of oxygen by mass?", "Besides fats, fatty acids, and amino acids,what other organic compounds contain oxygen?", "In what calcium containing body part is oxygen a part?"]}, {"id": "13_41", "context": "Oxygen toxicity to the lungs and central nervous system can also occur in deep scuba diving and surface supplied diving. Prolonged breathing of an air mixture with an O\n2 partial pressure more than 60 kPa can eventually lead to permanent pulmonary fibrosis. Exposure to a O\n2 partial pressures greater than 160 kPa (about 1.6 atm) may lead to convulsions (normally fatal for divers). Acute oxygen toxicity (causing seizures, its most feared effect for divers) can occur by breathing an air mixture with 21% O\n2 at 66 m or more of depth; the same thing can occur by breathing 100% O\n2 at only 6 m.", "questions": ["What health condition can deep sea diving cause?", "To what can the use of prolonged breathing of oxygen at 60 kPa lead?", "Pressures greater than what can lead to convulsions?", "What is the most feared condition that divers want to avoid?", "What physical condition can acute oxygen toxicity cause?"]}, {"id": "13_42", "context": "Breathing pure O\n2 in space applications, such as in some modern space suits, or in early spacecraft such as Apollo, causes no damage due to the low total pressures used. In the case of spacesuits, the O\n2 partial pressure in the breathing gas is, in general, about 30 kPa (1.4 times normal), and the resulting O\n2 partial pressure in the astronaut's arterial blood is only marginally more than normal sea-level O\n2 partial pressure (for more information on this, see space suit and arterial blood gas).", "questions": ["Why is breathing oxygen in space craft not dangerous to health?", "What is the oxygen partial pressure of space suits?", "How much of normal is the oxygen breathed in space suits?", "How much damage does breathing oxygen in space conditions cause?", "What si the comparison to sea level with the oxygen level in space suits?"]}, {"id": "13_43", "context": "Oxygen gas (O\n2) can be toxic at elevated partial pressures, leading to convulsions and other health problems.[j] Oxygen toxicity usually begins to occur at partial pressures more than 50 kilopascals (kPa), equal to about 50% oxygen composition at standard pressure or 2.5 times the normal sea-level O\n2 partial pressure of about 21 kPa. This is not a problem except for patients on mechanical ventilators, since gas supplied through oxygen masks in medical applications is typically composed of only 30%–50% O\n2 by volume (about 30 kPa at standard pressure). (although this figure also is subject to wide variation, depending on type of mask).", "questions": ["When can oxygen gas produce a toxic condition?", "At what point does oxygen toxicity begin to happen?", "To what is 50 kilopascals equal?", "What medical appliance can be a concern for oxygen toxicity?", "What percentage of oxygen is usually supplied by a medical mask?"]}]}
