{"data": [{"id": "17_1", "context": "The word pharmacy is derived from its root word pharma which was a term used since the 15th–17th centuries. However, the original Greek roots from pharmakos imply sorcery or even poison. In addition to pharma responsibilities, the pharma offered general medical advice and a range of services that are now performed solely by other specialist practitioners, such as surgery and midwifery. The pharma (as it was referred to) often operated through a retail shop which, in addition to ingredients for medicines, sold tobacco and patent medicines. Often the place that did this was called an apothecary and several languages have this as the dominant term, though their practices are more akin to a modern pharmacy, in English the term apothecary would today be seen as outdated or only approproriate if herbal remedies were on offer to a large extent. The pharmas also used many other herbs not listed. The Greek word Pharmakeia (Greek: φαρμακεία) derives from pharmakon (φάρμακον), meaning \"drug\", \"medicine\" (or \"poison\").[n 1]", "questions": [{"question": "What word is the word pharmacy taken from?", "is_impossible": false}, {"question": "What goods were sold in a pharma?", "is_impossible": false}, {"question": "What did the Greek root pharmakos imply?", "is_impossible": false}, {"question": "How would the word apothecary be viewed by contemporary English speakers?", "is_impossible": false}, {"question": "What else was used by pharmas?", "is_impossible": false}, {"question": "What did pharma not sell?", "is_impossible": true}, {"question": "What did the English root pharmakos imply?", "is_impossible": true}, {"question": "What else was avoided by pharmas?", "is_impossible": true}, {"question": "In what century was the term pharma last used?", "is_impossible": true}]}, {"id": "17_2", "context": "Pharmacists are healthcare professionals with specialised education and training who perform various roles to ensure optimal health outcomes for their patients through the quality use of medicines. Pharmacists may also be small-business proprietors, owning the pharmacy in which they practice. Since pharmacists know about the mode of action of a particular drug, and its metabolism and physiological effects on the human body in great detail, they play an important role in optimisation of a drug treatment for an individual.", "questions": [{"question": "What type of professionals are pharmacists?", "is_impossible": false}, {"question": "What types of health outcomes do pharmacists aim for with their patients?", "is_impossible": false}, {"question": "What type of treatment are pharmacists important for?", "is_impossible": false}, {"question": "What other role do many pharmacists play?", "is_impossible": false}, {"question": "What types of preparation do pharmacists have?", "is_impossible": false}, {"question": "What type of professionals do pharmacists lack?", "is_impossible": true}, {"question": "What types of health outcomes do pharmacists never have with their patients?", "is_impossible": true}, {"question": "What other role do many pharmacists avoid?", "is_impossible": true}, {"question": "What types of preparation do pharmacists not require?", "is_impossible": true}, {"question": "What type of treatment are pharmacists not needed for?", "is_impossible": true}]}, {"id": "17_3", "context": "A Pharmacy Technician in the UK is considered a health care professional and often does not work under the direct supervision of a pharmacist (if employed in a hospital pharmacy) but instead is supervised and managed by other senior pharmacy technicians. In the UK the role of a PhT has grown and responsibility has been passed on to them to manage the pharmacy department and specialised areas in pharmacy practice allowing pharmacists the time to specialise in their expert field as medication consultants spending more time working with patients and in research. A pharmacy technician once qualified has to register as a professional on the General Pharmaceutical Council (GPhC) register. The GPhC is the governing body for pharmacy health care professionals and this is who regulates the practice of pharmacists and pharmacy technicians.", "questions": [{"question": "Who oversees a Pharmacy Technician in the UK?", "is_impossible": false}, {"question": "With what body must a pharmacy technician register?", "is_impossible": false}, {"question": "What is a main duty of the GPhC?", "is_impossible": false}, {"question": "What type of professional is a Pharmacy Technician considered to be?", "is_impossible": false}, {"question": "What types of responsibilities might a pharmacy technician have?", "is_impossible": false}, {"question": "Who is not required to oversee a Pharmacy Technician in the UK?", "is_impossible": true}, {"question": "With what body must a pharmacy not be allowed to register?", "is_impossible": true}, {"question": "What is a secondary duty of the GPhC?", "is_impossible": true}, {"question": "What types of responsibilities might a pharmacy technician not be responsible for?", "is_impossible": true}]}, {"id": "17_4", "context": "In Ancient Greece, Diocles of Carystus (4th century BC) was one of several men studying the medicinal properties of plants. He wrote several treatises on the topic. The Greek physician Pedanius Dioscorides is famous for writing a five volume book in his native Greek Περί ύλης ιατρικής in the 1st century AD. The Latin translation De Materia Medica (Concerning medical substances) was used a basis for many medieval texts, and was built upon by many middle eastern scientists during the Islamic Golden Age. The title coined the term materia medica.", "questions": [{"question": "Who was a man studying medicinal applicants of plants in Ancient Greece?", "is_impossible": false}, {"question": "What is Pedanius Dioscorides known for?", "is_impossible": false}, {"question": "What is the name of the Latin translation of Dioscorides' book?", "is_impossible": false}, {"question": "What term resulted from Dioscorides' book?", "is_impossible": false}, {"question": "Who added to Dioscorides' book in the Islamic Golden Age?", "is_impossible": false}, {"question": "Who is a man studying medicinal applicants of plants in Modern Greece?", "is_impossible": true}, {"question": "What is Pedanius Dioscorides not known for?", "is_impossible": true}, {"question": "What is the name of the German translation of Dioscorides' book?", "is_impossible": true}, {"question": "Who was removed from Dioscorides' book in the Islamic Golden Age?", "is_impossible": true}, {"question": "Who was the only man to study medicinal properties of plants in Ancient Greece?", "is_impossible": true}]}, {"id": "17_5", "context": "In Japan, at the end of the Asuka period (538–710) and the early Nara period (710–794), the men who fulfilled roles similar to those of modern pharmacists were highly respected. The place of pharmacists in society was expressly defined in the Taihō Code (701) and re-stated in the Yōrō Code (718). Ranked positions in the pre-Heian Imperial court were established; and this organizational structure remained largely intact until the Meiji Restoration (1868). In this highly stable hierarchy, the pharmacists—and even pharmacist assistants—were assigned status superior to all others in health-related fields such as physicians and acupuncturists. In the Imperial household, the pharmacist was even ranked above the two personal physicians of the Emperor.", "questions": [{"question": "How were the men who did tasks like those of today's pharmacists viewed in Japan in the Asuka and Nara periods?", "is_impossible": false}, {"question": "In which two codes were the roles of pharmacists codified?", "is_impossible": false}, {"question": "What put a hierarchical structure in place?", "is_impossible": false}, {"question": "What stature did pharmacists have in the pre-Heian Imperial court?", "is_impossible": false}, {"question": "Where did the pharmacist stand in relation to the Emperor's personal physicians?", "is_impossible": false}, {"question": "What removed a hierarchical structure?", "is_impossible": true}, {"question": "Which two codes were the roles of pharmacists destroyed?", "is_impossible": true}, {"question": "Where did the pharmacist stand in relation to the Emperor?", "is_impossible": true}, {"question": "What role was not respected during the Asuka period?", "is_impossible": true}]}, {"id": "17_6", "context": "The advances made in the Middle East in botany and chemistry led medicine in medieval Islam substantially to develop pharmacology. Muhammad ibn Zakarīya Rāzi (Rhazes) (865–915), for instance, acted to promote the medical uses of chemical compounds. Abu al-Qasim al-Zahrawi (Abulcasis) (936–1013) pioneered the preparation of medicines by sublimation and distillation. His Liber servitoris is of particular interest, as it provides the reader with recipes and explains how to prepare the `simples’ from which were compounded the complex drugs then generally used. Sabur Ibn Sahl (d 869), was, however, the first physician to initiate pharmacopoedia, describing a large variety of drugs and remedies for ailments. Al-Biruni (973–1050) wrote one of the most valuable Islamic works on pharmacology, entitled Kitab al-Saydalah (The Book of Drugs), in which he detailed the properties of drugs and outlined the role of pharmacy and the functions and duties of the pharmacist. Avicenna, too, described no less than 700 preparations, their properties, modes of action, and their indications. He devoted in fact a whole volume to simple drugs in The Canon of Medicine. Of great impact were also the works by al-Maridini of Baghdad and Cairo, and Ibn al-Wafid (1008–1074), both of which were printed in Latin more than fifty times, appearing as De Medicinis universalibus et particularibus by 'Mesue' the younger, and the Medicamentis simplicibus by 'Abenguefit'. Peter of Abano (1250–1316) translated and added a supplement to the work of al-Maridini under the title De Veneris. Al-Muwaffaq’s contributions in the field are also pioneering. Living in the 10th century, he wrote The foundations of the true properties of Remedies, amongst others describing arsenious oxide, and being acquainted with silicic acid. He made clear distinction between sodium carbonate and potassium carbonate, and drew attention to the poisonous nature of copper compounds, especially copper vitriol, and also lead compounds. He also describes the distillation of sea-water for drinking.[verification needed]", "questions": [{"question": "Developments in which scientists influenced the creation of pharmacology in medieval Islam?", "is_impossible": false}, {"question": "Who was influential in promoting the use of chemical compounds as medicines?", "is_impossible": false}, {"question": "Who authored the Liber servitoris?", "is_impossible": false}, {"question": "Which two compounds did Al-Muwaffaq differentiate between?", "is_impossible": false}, {"question": "Who wrote about the distillation of drinking water from sea water?", "is_impossible": false}, {"question": "Who had no influence in promoting the use of chemical compounds as medicines?", "is_impossible": true}, {"question": "Who couldn't read the Liber servitoris?", "is_impossible": true}, {"question": "Who wrote about the distillation of sea water from drinking water?", "is_impossible": true}, {"question": "Which two compounds did Al-Muwaffaq combine?", "is_impossible": true}, {"question": "Which scientists avoided the creation of pharmacology in modern Islam?", "is_impossible": true}]}, {"id": "17_7", "context": "In Europe there are old pharmacies still operating in Dubrovnik, Croatia, located inside the Franciscan monastery, opened in 1317; and in the Town Hall Square of Tallinn, Estonia, dating from at least 1422. The oldest is claimed to have been set up in 1221 in the Church of Santa Maria Novella in Florence, Italy, which now houses a perfume museum. The medieval Esteve Pharmacy, located in Llívia, a Catalan enclave close to Puigcerdà, also now a museum, dates back to the 15th century, keeping albarellos from the 16th and 17th centuries, old prescription books and antique drugs.", "questions": [{"question": "How far does one pharmacy in Croatia date back to?", "is_impossible": false}, {"question": "Where is the oldest pharmacy stated to be located?", "is_impossible": false}, {"question": "What is the medieval Esteve Pharmacy used as at present?", "is_impossible": false}, {"question": "What sorts of items are displayed in the Esteve Pharmacy museum?", "is_impossible": false}, {"question": "In what year is the oldest pharmacy said to have been established?", "is_impossible": false}, {"question": "Where is the newest pharmacy stated to be located?", "is_impossible": true}, {"question": "What year is the oldest pharmacy said to have been lost?", "is_impossible": true}, {"question": "What is the medieval Esteve Pharmacy no longer used as at present?", "is_impossible": true}, {"question": "What sorts of items are never displayed in the Esteve Pharmacy museum?", "is_impossible": true}]}, {"id": "17_8", "context": "In most countries, the dispensary is subject to pharmacy legislation; with requirements for storage conditions, compulsory texts, equipment, etc., specified in legislation. Where it was once the case that pharmacists stayed within the dispensary compounding/dispensing medications, there has been an increasing trend towards the use of trained pharmacy technicians while the pharmacist spends more time communicating with patients. Pharmacy technicians are now more dependent upon automation to assist them in their new role dealing with patients' prescriptions and patient safety issues.", "questions": [{"question": "What is the dispensary subject to in a majority of countries?", "is_impossible": false}, {"question": "What responsibilities were pharmacy technicians formerly limited to?", "is_impossible": false}, {"question": "What do pharmacy technicians depend on more and more?", "is_impossible": false}, {"question": "What are new responsibilities pharmacy technicians now deal with?", "is_impossible": false}, {"question": "What does pharmacy legislation mandate?", "is_impossible": false}, {"question": "What is the dispensary subject to in a minority of countries?", "is_impossible": true}, {"question": "What do pharmacy technicians depend on less and less?", "is_impossible": true}, {"question": "What does pharmacy legislation never mandate?", "is_impossible": true}, {"question": "What responsibilities are pharmacy technicians limited to?", "is_impossible": true}, {"question": "What are responsibilities pharmacy technicians never deal with?", "is_impossible": true}]}, {"id": "17_9", "context": "Because of the complexity of medications including specific indications, effectiveness of treatment regimens, safety of medications (i.e., drug interactions) and patient compliance issues (in the hospital and at home) many pharmacists practicing in hospitals gain more education and training after pharmacy school through a pharmacy practice residency and sometimes followed by another residency in a specific area. Those pharmacists are often referred to as clinical pharmacists and they often specialize in various disciplines of pharmacy. For example, there are pharmacists who specialize in hematology/oncology, HIV/AIDS, infectious disease, critical care, emergency medicine, toxicology, nuclear pharmacy, pain management, psychiatry, anti-coagulation clinics, herbal medicine, neurology/epilepsy management, pediatrics, neonatal pharmacists and more.", "questions": [{"question": "Where do pharmacists acquire more preparation following pharmacy school?", "is_impossible": false}, {"question": "What do clinical pharmacists specialize in?", "is_impossible": false}, {"question": "What is one issue that adds to the complexity of a pharmacist's job?", "is_impossible": false}, {"question": "Which pharmacists are likely to seek additional education following pharmacy school?", "is_impossible": false}, {"question": "Where do pharmacists not go following pharmacy school?", "is_impossible": true}, {"question": "What do clinical pharmacists not specialize in?", "is_impossible": true}, {"question": "What is one issue that takes away the complexity of a pharmacist's job?", "is_impossible": true}, {"question": "Which pharmacists never seek additional education following pharmacy school?", "is_impossible": true}]}, {"id": "17_10", "context": "Hospital pharmacies can often be found within the premises of the hospital. Hospital pharmacies usually stock a larger range of medications, including more specialized medications, than would be feasible in the community setting. Most hospital medications are unit-dose, or a single dose of medicine. Hospital pharmacists and trained pharmacy technicians compound sterile products for patients including total parenteral nutrition (TPN), and other medications given intravenously. This is a complex process that requires adequate training of personnel, quality assurance of products, and adequate facilities. Several hospital pharmacies have decided to outsource high risk preparations and some other compounding functions to companies who specialize in compounding. The high cost of medications and drug-related technology, combined with the potential impact of medications and pharmacy services on patient-care outcomes and patient safety, make it imperative that hospital pharmacies perform at the highest level possible.", "questions": [{"question": "Where are many hospital pharmacies located?", "is_impossible": false}, {"question": "In what form are most hospital medications?", "is_impossible": false}, {"question": "What types of pharmacy functions have begun to be outsourced?", "is_impossible": false}, {"question": "What is one factor that increases the importance of the pharmacy performing at a high level?", "is_impossible": false}, {"question": "What are some advantages of hospital pharmacies?", "is_impossible": false}, {"question": "Where are no hospital pharmacies located?", "is_impossible": true}, {"question": "What form are most hospital medications forbidden from being?", "is_impossible": true}, {"question": "What types of pharmacy functions have never been outsourced?", "is_impossible": true}, {"question": "What is one factor that decreases the importance of the pharmacy performing at a high level?", "is_impossible": true}, {"question": "What are some disadvantages of hospital pharmacies?", "is_impossible": true}]}, {"id": "17_11", "context": "Pharmacists provide direct patient care services that optimizes the use of medication and promotes health, wellness, and disease prevention. Clinical pharmacists care for patients in all health care settings, but the clinical pharmacy movement initially began inside hospitals and clinics. Clinical pharmacists often collaborate with physicians and other healthcare professionals to improve pharmaceutical care. Clinical pharmacists are now an integral part of the interdisciplinary approach to patient care. They often participate in patient care rounds drug product selection.", "questions": [{"question": "What do the services given by pharmacists provide?", "is_impossible": false}, {"question": "What is the origin of clinical pharmacy?", "is_impossible": false}, {"question": "Who do clinical pharmacists work with much of the time?", "is_impossible": false}, {"question": "What do clinical pharmacists often participate in?", "is_impossible": false}, {"question": "Where do clinical pharmacists work with patients?", "is_impossible": false}, {"question": "What is not the origin of clinical pharmacy?", "is_impossible": true}, {"question": "Who do clinical pharmacists never work with?", "is_impossible": true}, {"question": "What do clinical pharmacists not participate in?", "is_impossible": true}, {"question": "Where are clinical pharmacists not allowed to work with patients?", "is_impossible": true}]}, {"id": "17_12", "context": "The clinical pharmacist's role involves creating a comprehensive drug therapy plan for patient-specific problems, identifying goals of therapy, and reviewing all prescribed medications prior to dispensing and administration to the patient. The review process often involves an evaluation of the appropriateness of the drug therapy (e.g., drug choice, dose, route, frequency, and duration of therapy) and its efficacy. The pharmacist must also monitor for potential drug interactions, adverse drug reactions, and assess patient drug allergies while designing and initiating a drug therapy plan.", "questions": [{"question": "What is one example of what a clinical pharmacist's duties entail?", "is_impossible": false}, {"question": "What is involved in a review of prescribed medications?", "is_impossible": false}, {"question": "What are the components of drug therapy?", "is_impossible": false}, {"question": "What are some other factors a pharmacist must monitor?", "is_impossible": false}, {"question": "What is not an example of what a clinical pharmacist's duties entail?", "is_impossible": true}, {"question": "What is never involved in a review of prescribed medications?", "is_impossible": true}, {"question": "What are no longer components of drug therapy?", "is_impossible": true}, {"question": "What are some other factors a pharmacist can't monitor?", "is_impossible": true}]}, {"id": "17_13", "context": "In the U.S. federal health care system (including the VA, the Indian Health Service, and NIH) ambulatory care pharmacists are given full independent prescribing authority. In some states such North Carolina and New Mexico these pharmacist clinicians are given collaborative prescriptive and diagnostic authority. In 2011 the board of Pharmaceutical Specialties approved ambulatory care pharmacy practice as a separate board certification. The official designation for pharmacists who pass the ambulatory care pharmacy specialty certification exam will be Board Certified Ambulatory Care Pharmacist and these pharmacists will carry the initials BCACP.", "questions": [{"question": "What type of authority are ambulatory care pharmacists given in the U.S. federal health care system?", "is_impossible": false}, {"question": "In what states are pharmacist clinicians given prescriptive and diagnostic authority?", "is_impossible": false}, {"question": "When was ambulatory care pharmacy approved as its own certification?", "is_impossible": false}, {"question": "What will a pharmacist who passes the ambulatory pharmacist exam be called?", "is_impossible": false}, {"question": "What entities are included in the federal health care system?", "is_impossible": false}, {"question": "What type of authority are ambulatory care pharmacists not given in the U.S. federal health care system?", "is_impossible": true}, {"question": "What states are pharmacist clinicians given no prescriptive and diagnostic authority?", "is_impossible": true}, {"question": "When was ambulatory care pharmacy rejected as its own certification?", "is_impossible": true}, {"question": "What entities are not included in the federal health care system?", "is_impossible": true}, {"question": "What will a pharmacist who fails the ambulatory pharmacist exam be called?", "is_impossible": true}]}, {"id": "17_14", "context": "Consultant pharmacy practice focuses more on medication regimen review (i.e. \"cognitive services\") than on actual dispensing of drugs. Consultant pharmacists most typically work in nursing homes, but are increasingly branching into other institutions and non-institutional settings. Traditionally consultant pharmacists were usually independent business owners, though in the United States many now work for several large pharmacy management companies (primarily Omnicare, Kindred Healthcare and PharMerica). This trend may be gradually reversing as consultant pharmacists begin to work directly with patients, primarily because many elderly people are now taking numerous medications but continue to live outside of institutional settings. Some community pharmacies employ consultant pharmacists and/or provide consulting services.", "questions": [{"question": "What is consultant pharmacy mainly concerned with?", "is_impossible": false}, {"question": "Where do a majority of consultant pharmacists tend to work?", "is_impossible": false}, {"question": "What are some large pharmacy management companies?", "is_impossible": false}, {"question": "What is the main reason consulting pharmacists are increasingly working directly with patients?", "is_impossible": false}, {"question": "What do some community pharmacies do?", "is_impossible": false}, {"question": "What is consultant pharmacy not concerned with?", "is_impossible": true}, {"question": "Where do a minority of consultant pharmacists tend to work?", "is_impossible": true}, {"question": "What are some small pharmacy management companies?", "is_impossible": true}, {"question": "What is the secondary reason consulting pharmacists are increasingly working directly with patients?", "is_impossible": true}, {"question": "What do no community pharmacies do?", "is_impossible": true}]}, {"id": "17_15", "context": "Since about the year 2000, a growing number of Internet pharmacies have been established worldwide. Many of these pharmacies are similar to community pharmacies, and in fact, many of them are actually operated by brick-and-mortar community pharmacies that serve consumers online and those that walk in their door. The primary difference is the method by which the medications are requested and received. Some customers consider this to be more convenient and private method rather than traveling to a community drugstore where another customer might overhear about the drugs that they take. Internet pharmacies (also known as online pharmacies) are also recommended to some patients by their physicians if they are homebound.", "questions": [{"question": "When did internet pharmacies begin to come into being?", "is_impossible": false}, {"question": "Who often operates internet pharmacies?", "is_impossible": false}, {"question": "What are internet pharmacies also called?", "is_impossible": false}, {"question": "What is one reason a patient might choose an internet pharmacy?", "is_impossible": false}, {"question": "What is the main difference between online pharmacies and community pharmacies?", "is_impossible": false}, {"question": "When did internet pharmacies begin to end?", "is_impossible": true}, {"question": "Who can't operates internet pharmacies?", "is_impossible": true}, {"question": "What are internet pharmacies never called?", "is_impossible": true}, {"question": "What is not a reason a patient might choose an internet pharmacy?", "is_impossible": true}, {"question": "What is no different between online pharmacies and community pharmacies?", "is_impossible": true}]}, {"id": "17_16", "context": "While most Internet pharmacies sell prescription drugs and require a valid prescription, some Internet pharmacies sell prescription drugs without requiring a prescription. Many customers order drugs from such pharmacies to avoid the \"inconvenience\" of visiting a doctor or to obtain medications which their doctors were unwilling to prescribe. However, this practice has been criticized as potentially dangerous, especially by those who feel that only doctors can reliably assess contraindications, risk/benefit ratios, and an individual's overall suitability for use of a medication. There also have been reports of such pharmacies dispensing substandard products.", "questions": [{"question": "Why might customers order from internet pharmacies?", "is_impossible": false}, {"question": "Who has criticized ordering from online pharmacies that don't require prescriptions?", "is_impossible": false}, {"question": "What is a criticism of online pharmacies that issue drugs without a prescription?", "is_impossible": false}, {"question": "What practice do some internet pharmacies engage in?", "is_impossible": false}, {"question": "What do most online pharmacies do?", "is_impossible": false}, {"question": "Why might customers not order from internet pharmacies?", "is_impossible": true}, {"question": "What do no online pharmacies allow?", "is_impossible": true}, {"question": "What is a requirement of online pharmacies that issue drugs without a prescription?", "is_impossible": true}, {"question": "What practice do all internet pharmacies avoid?", "is_impossible": true}]}, {"id": "17_17", "context": "Of particular concern with Internet pharmacies is the ease with which people, youth in particular, can obtain controlled substances (e.g., Vicodin, generically known as hydrocodone) via the Internet without a prescription issued by a doctor/practitioner who has an established doctor-patient relationship. There are many instances where a practitioner issues a prescription, brokered by an Internet server, for a controlled substance to a \"patient\" s/he has never met.[citation needed] In the United States, in order for a prescription for a controlled substance to be valid, it must be issued for a legitimate medical purpose by a licensed practitioner acting in the course of legitimate doctor-patient relationship. The filling pharmacy has a corresponding responsibility to ensure that the prescription is valid. Often, individual state laws outline what defines a valid patient-doctor relationship.", "questions": [{"question": "What conditions must be met for a prescription for a controlled substance to be valid?", "is_impossible": false}, {"question": "What is one problem with internet pharmacies?", "is_impossible": false}, {"question": "What conditions must be met to prescribe a controlled substance?", "is_impossible": false}, {"question": "What is the obligation of a pharmacy filling a prescription?", "is_impossible": false}, {"question": "Who defines what constitutes a patient-doctor relationship?", "is_impossible": false}, {"question": "What is an example of a controlled substance?", "is_impossible": false}, {"question": "What is not a problem with internet pharmacies?", "is_impossible": true}, {"question": "Who does not define what constitutes a patient-doctor relationship?", "is_impossible": true}, {"question": "What is not an example of a controlled substance?", "is_impossible": true}, {"question": "What conditions can't be met to prescribe a controlled substance?", "is_impossible": true}, {"question": "What is not an obligation of a pharmacy filling a prescription?", "is_impossible": true}]}, {"id": "17_18", "context": "In the United States, there has been a push to legalize importation of medications from Canada and other countries, in order to reduce consumer costs. While in most cases importation of prescription medications violates Food and Drug Administration (FDA) regulations and federal laws, enforcement is generally targeted at international drug suppliers, rather than consumers. There is no known case of any U.S. citizens buying Canadian drugs for personal use with a prescription, who has ever been charged by authorities.", "questions": [{"question": "What is a reason for the movement to legalize importing medicines from other countries?", "is_impossible": false}, {"question": "What is one country that has been suggested for importation of medicines?", "is_impossible": false}, {"question": "Who are FDA laws against importing medications aimed at?", "is_impossible": false}, {"question": "Has there ever been anyone charged with importing drugs from Canada for personal medicinal use?", "is_impossible": false}, {"question": "What is there a push for in the U.S. to reduce consumer drug costs?", "is_impossible": false}, {"question": "What is a reason for the movement to illegalize importing medicines from other countries?", "is_impossible": true}, {"question": "What is one country that can't be suggested for importation of medicines?", "is_impossible": true}, {"question": "Who are FDA laws against importing medications not aimed at?", "is_impossible": true}, {"question": "Why is there not a push for the U.S. to reduce consumer drug costs?", "is_impossible": true}]}, {"id": "17_19", "context": "Pharmacy informatics is the combination of pharmacy practice science and applied information science. Pharmacy informaticists work in many practice areas of pharmacy, however, they may also work in information technology departments or for healthcare information technology vendor companies. As a practice area and specialist domain, pharmacy informatics is growing quickly to meet the needs of major national and international patient information projects and health system interoperability goals. Pharmacists in this area are trained to participate in medication management system development, deployment and optimization.", "questions": [{"question": "What two things does pharmacy informatics bring together?", "is_impossible": false}, {"question": "What fields may pharmacy informatics also work in?", "is_impossible": false}, {"question": "Whose needs will the growth in pharmacy informatics meet?", "is_impossible": false}, {"question": "What areas are pharmacy informatics prepared to work in?", "is_impossible": false}, {"question": "How fast is pharmacy informatics growing?", "is_impossible": false}, {"question": "What two things can pharmacy informatics not bring together?", "is_impossible": true}, {"question": "What fields may pharmacy informatics not work in?", "is_impossible": true}, {"question": "Whose needs will the growth in pharmacy informatics damage?", "is_impossible": true}, {"question": "What areas are pharmacy informatics not prepared to work in?", "is_impossible": true}]}, {"id": "17_20", "context": "Specialty pharmacies supply high cost injectable, oral, infused, or inhaled medications that are used for chronic and complex disease states such as cancer, hepatitis, and rheumatoid arthritis. Unlike a traditional community pharmacy where prescriptions for any common medication can be brought in and filled, specialty pharmacies carry novel medications that need to be properly stored, administered, carefully monitored, and clinically managed. In addition to supplying these drugs, specialty pharmacies also provide lab monitoring, adherence counseling, and assist patients with cost-containment strategies needed to obtain their expensive specialty drugs. It is currently the fastest growing sector of the pharmaceutical industry with 19 of 28 newly FDA approved medications in 2013 being specialty drugs.", "questions": [{"question": "What is the fastest growing area in the pharmaceutical industry?", "is_impossible": false}, {"question": "How many drugs approved by the FDA in 2013 were specialty drugs?", "is_impossible": false}, {"question": "What types of diseases are specialty drugs often used against?", "is_impossible": false}, {"question": "What types of medications do specialty pharmacies stock?", "is_impossible": false}, {"question": "Besides drugs, what else do specialty pharmacies provide?", "is_impossible": false}, {"question": "What is the slowest growing area in the pharmaceutical industry?", "is_impossible": true}, {"question": "How many drugs approved by the FDA in 2011 were specialty drugs?", "is_impossible": true}, {"question": "What types of diseases are specialty drugs no longer used against?", "is_impossible": true}, {"question": "What types of medications do specialty pharmacies never stock?", "is_impossible": true}]}, {"id": "17_21", "context": "In most jurisdictions (such as the United States), pharmacists are regulated separately from physicians. These jurisdictions also usually specify that only pharmacists may supply scheduled pharmaceuticals to the public, and that pharmacists cannot form business partnerships with physicians or give them \"kickback\" payments. However, the American Medical Association (AMA) Code of Ethics provides that physicians may dispense drugs within their office practices as long as there is no patient exploitation and patients have the right to a written prescription that can be filled elsewhere. 7 to 10 percent of American physicians practices reportedly dispense drugs on their own.", "questions": [{"question": "How are pharmacists regulated in most jurisdictions?", "is_impossible": false}, {"question": "Who do most jurisdictions say can give scheduled drugs to the public?", "is_impossible": false}, {"question": "What body has stated that physicians can also dispense drugs under specific conditions?", "is_impossible": false}, {"question": "What is the estimate of how many physicians give out drugs on their own?", "is_impossible": false}, {"question": "What are pharmacists forbidden to do?", "is_impossible": false}, {"question": "Who do no jurisdictions say can give scheduled drugs to the public?", "is_impossible": true}, {"question": "What body has stated that physicians can't dispense drugs under specific conditions?", "is_impossible": true}, {"question": "How are pharmacists never regulated?", "is_impossible": true}]}, {"id": "17_22", "context": "In some rural areas in the United Kingdom, there are dispensing physicians who are allowed to both prescribe and dispense prescription-only medicines to their patients from within their practices. The law requires that the GP practice be located in a designated rural area and that there is also a specified, minimum distance (currently 1.6 kilometres) between a patient's home and the nearest retail pharmacy. This law also exists in Austria for general physicians if the nearest pharmacy is more than 4 kilometers away, or where none is registered in the city.", "questions": [{"question": "Where are some physicians permitted to prescribe and give out medications within their practices?", "is_impossible": false}, {"question": "What is another country that permits physicians to give out drugs from within their practice?", "is_impossible": false}, {"question": "What is the minimum distance between a patient's home and the nearest pharmacy that allows a physician to give out medication?", "is_impossible": false}, {"question": "What is the minimum distance between a patient's home and the nearest pharmacy that allows a physician in Austria to give out medicine?", "is_impossible": false}, {"question": "Where are some physicians not permitted to prescribe and give out medications within their practices?", "is_impossible": true}, {"question": "What is another country that doesn't permit physicians to give out drugs from within their practice?", "is_impossible": true}, {"question": "What is the maximum distance between a patient's home and the nearest pharmacy that allows a physician to give out medication?", "is_impossible": true}, {"question": "What is the maximum distance between a patient's home and the nearest pharmacy that allows a physician in Austria to give out medicine?", "is_impossible": true}]}, {"id": "17_23", "context": "The reason for the majority rule is the high risk of a conflict of interest and/or the avoidance of absolute powers. Otherwise, the physician has a financial self-interest in \"diagnosing\" as many conditions as possible, and in exaggerating their seriousness, because he or she can then sell more medications to the patient. Such self-interest directly conflicts with the patient's interest in obtaining cost-effective medication and avoiding the unnecessary use of medication that may have side-effects. This system reflects much similarity to the checks and balances system of the U.S. and many other governments.[citation needed]", "questions": [{"question": "Why is majority rule used?", "is_impossible": false}, {"question": "Why might a physician diagnose a large number of conditions?", "is_impossible": false}, {"question": "What do rules about conflict of interest involving doctors diagnosing patients resemble?", "is_impossible": false}, {"question": "Where might the doctor's self-interest be at odds with the patient's self-interest?", "is_impossible": false}, {"question": "How else might a physician take advantage of self-interest?", "is_impossible": false}, {"question": "Why is majority rule avoided?", "is_impossible": true}, {"question": "Why might a physician never diagnose a large number of conditions?", "is_impossible": true}, {"question": "What do rules about conflict of interest involving doctors diagnosing patients not resemble?", "is_impossible": true}, {"question": "Where might the doctor's self-interest be equivalent with the patient's self-interest?", "is_impossible": true}, {"question": "How else might a physician not take advantage of self-interest?", "is_impossible": true}]}, {"id": "17_24", "context": "In the coming decades, pharmacists are expected to become more integral within the health care system. Rather than simply dispensing medication, pharmacists are increasingly expected to be compensated for their patient care skills. In particular, Medication Therapy Management (MTM) includes the clinical services that pharmacists can provide for their patients. Such services include the thorough analysis of all medication (prescription, non-prescription, and herbals) currently being taken by an individual. The result is a reconciliation of medication and patient education resulting in increased patient health outcomes and decreased costs to the health care system.", "questions": [{"question": "What will be the importance of the pharmacist in coming decades?", "is_impossible": false}, {"question": "What responsibilities are pharmacists believed to be taking on more in the future?", "is_impossible": false}, {"question": "What is included in Medication Therapy Management?", "is_impossible": false}, {"question": "What are examples of clinical services that pharmacists can provide?", "is_impossible": false}, {"question": "What are outcomes expected with Medication Therapy Management?", "is_impossible": false}, {"question": "What will be the importance of the pharmacist in past decades?", "is_impossible": true}, {"question": "What responsibilities are pharmacists believed to be taking less of in the future?", "is_impossible": true}, {"question": "What is not included in Medication Therapy Management?", "is_impossible": true}, {"question": "What are not examples of clinical services that pharmacists can provide?", "is_impossible": true}, {"question": "What outcomes are not expected with Medication Therapy Management?", "is_impossible": true}]}, {"id": "17_25", "context": "This shift has already commenced in some countries; for instance, pharmacists in Australia receive remuneration from the Australian Government for conducting comprehensive Home Medicines Reviews. In Canada, pharmacists in certain provinces have limited prescribing rights (as in Alberta and British Columbia) or are remunerated by their provincial government for expanded services such as medications reviews (Medschecks in Ontario). In the United Kingdom, pharmacists who undertake additional training are obtaining prescribing rights and this is because of pharmacy education. They are also being paid for by the government for medicine use reviews. In Scotland the pharmacist can write prescriptions for Scottish registered patients of their regular medications, for the majority of drugs, except for controlled drugs, when the patient is unable to see their doctor, as could happen if they are away from home or the doctor is unavailable. In the United States, pharmaceutical care or clinical pharmacy has had an evolving influence on the practice of pharmacy. Moreover, the Doctor of Pharmacy (Pharm. D.) degree is now required before entering practice and some pharmacists now complete one or two years of residency or fellowship training following graduation. In addition, consultant pharmacists, who traditionally operated primarily in nursing homes are now expanding into direct consultation with patients, under the banner of \"senior care pharmacy.\"", "questions": [{"question": "Which provinces in Canada limit the rights of pharmacists in prescribing?", "is_impossible": false}, {"question": "Who pays Australian pharmacists for doing Home Medicines Reviews?", "is_impossible": false}, {"question": "What are pharmacists in the United Kingdom being increasingly paid for?", "is_impossible": false}, {"question": "What fields have increased in influence on pharmacy in the United States?", "is_impossible": false}, {"question": "What degree is now mandatory in the U.S. in order to be a licensed pharmacist?", "is_impossible": false}, {"question": "Which provinces in Canada extend the rights of pharmacists in prescribing?", "is_impossible": true}, {"question": "Who can't pay Australian pharmacists for doing Home Medicines Reviews?", "is_impossible": true}, {"question": "What are pharmacists in the United Kingdom being paid less for?", "is_impossible": true}, {"question": "What fields have lost influence over pharmacy in the United States?", "is_impossible": true}, {"question": "What degree is no longer mandatory in the U.S. in order to be a licensed pharmacist?", "is_impossible": true}]}, {"id": "17_26", "context": "The two symbols most commonly associated with pharmacy in English-speaking countries are the mortar and pestle and the ℞ (recipere) character, which is often written as \"Rx\" in typed text. The show globe was also used until the early 20th century. Pharmacy organizations often use other symbols, such as the Bowl of Hygieia which is often used in the Netherlands, conical measures, and caduceuses in their logos. Other symbols are common in different countries: the green Greek cross in France, Argentina, the United Kingdom, Belgium, Ireland, Italy, Spain, and India, the increasingly rare Gaper in the Netherlands, and a red stylized letter A in Germany and Austria (from Apotheke, the German word for pharmacy, from the same Greek root as the English word 'apothecary').", "questions": [{"question": "What are the two symbols that signify pharmacy in English-speaking countries?", "is_impossible": false}, {"question": "What symbol was employed until early in the 20th century?", "is_impossible": false}, {"question": "What country uses the Bowl of Hygieia as a symbol of pharmacy?", "is_impossible": false}, {"question": "What countries use a red stylized A to signify pharmacy?", "is_impossible": false}, {"question": "Which countries use the green Greek cross as a symbol of pharmacy?", "is_impossible": false}, {"question": "What are the two symbols that signify pharmacy in non-English-speaking countries?", "is_impossible": true}, {"question": "What symbol was employed until early in the 19th century?", "is_impossible": true}, {"question": "What country no longer uses the Bowl of Hygieia as a symbol of pharmacy?", "is_impossible": true}, {"question": "What countries use a blue stylized A to signify pharmacy?", "is_impossible": true}, {"question": "Which countries use the red Greek cross as a symbol of pharmacy?", "is_impossible": true}]}]}
