{"data": [{"id": "1_1", "context": "The Normans (Norman: Nourmands; French: Normands; Latin: Normanni) were the people who in the 10th and 11th centuries gave their name to Normandy, a region in France. They were descended from Norse (\"Norman\" comes from \"Norseman\") raiders and pirates from Denmark, Iceland and Norway who, under their leader Rollo, agreed to swear fealty to King Charles III of West Francia. Through generations of assimilation and mixing with the native Frankish and Roman-Gaulish populations, their descendants would gradually merge with the Carolingian-based cultures of West Francia. The distinct cultural and ethnic identity of the Normans emerged initially in the first half of the 10th century, and it continued to evolve over the succeeding centuries.", "questions": [{"question": "In what country is Normandy located?", "is_impossible": false}, {"question": "When were the Normans in Normandy?", "is_impossible": false}, {"question": "From which countries did the Norse originate?", "is_impossible": false}, {"question": "Who was the Norse leader?", "is_impossible": false}, {"question": "What century did the Normans first gain their separate identity?", "is_impossible": false}, {"question": "Who gave their name to Normandy in the 1000's and 1100's", "is_impossible": true}, {"question": "What is France a region of?", "is_impossible": true}, {"question": "Who did King Charles III swear fealty to?", "is_impossible": true}, {"question": "When did the Frankish identity emerge?", "is_impossible": true}]}, {"id": "1_2", "context": "The Norman dynasty had a major political, cultural and military impact on medieval Europe and even the Near East. The Normans were famed for their martial spirit and eventually for their Christian piety, becoming exponents of the Catholic orthodoxy into which they assimilated. They adopted the Gallo-Romance language of the Frankish land they settled, their dialect becoming known as Norman, Normaund or Norman French, an important literary language. The Duchy of Normandy, which they formed by treaty with the French crown, was a great fief of medieval France, and under Richard I of Normandy was forged into a cohesive and formidable principality in feudal tenure. The Normans are noted both for their culture, such as their unique Romanesque architecture and musical traditions, and for their significant military accomplishments and innovations. Norman adventurers founded the Kingdom of Sicily under Roger II after conquering southern Italy on the Saracens and Byzantines, and an expedition on behalf of their duke, William the Conqueror, led to the Norman conquest of England at the Battle of Hastings in 1066. Norman cultural and military influence spread from these new European centres to the Crusader states of the Near East, where their prince Bohemond I founded the Principality of Antioch in the Levant, to Scotland and Wales in Great Britain, to Ireland, and to the coasts of north Africa and the Canary Islands.", "questions": [{"question": "Who was the duke in the battle of Hastings?", "is_impossible": false}, {"question": "Who ruled the duchy of Normandy", "is_impossible": false}, {"question": "What religion were the Normans", "is_impossible": false}, {"question": "What type of major impact did the Norman dynasty have on modern Europe?", "is_impossible": true}, {"question": "Who was famed for their Christian spirit?", "is_impossible": true}, {"question": "Who assimilted the Roman language?", "is_impossible": true}, {"question": "Who ruled the country of Normandy?", "is_impossible": true}, {"question": "What principality did William the conquerer found?", "is_impossible": true}]}, {"id": "1_3", "context": "The English name \"Normans\" comes from the French words Normans/Normanz, plural of Normant, modern French normand, which is itself borrowed from Old Low Franconian Nortmann \"Northman\" or directly from Old Norse Norðmaðr, Latinized variously as Nortmannus, Normannus, or Nordmannus (recorded in Medieval Latin, 9th century) to mean \"Norseman, Viking\".", "questions": [{"question": "What is the original meaning of the word Norman?", "is_impossible": false}, {"question": "When was the Latin version of the word Norman first recorded?", "is_impossible": false}, {"question": "What name comes from the English words Normans/Normanz?", "is_impossible": true}, {"question": "When was the French version of the word Norman first recorded?", "is_impossible": true}]}, {"id": "1_4", "context": "In the course of the 10th century, the initially destructive incursions of Norse war bands into the rivers of France evolved into more permanent encampments that included local women and personal property. The Duchy of Normandy, which began in 911 as a fiefdom, was established by the treaty of Saint-Clair-sur-Epte between King Charles III of West Francia and the famed Viking ruler Rollo, and was situated in the former Frankish kingdom of Neustria. The treaty offered Rollo and his men the French lands between the river Epte and the Atlantic coast in exchange for their protection against further Viking incursions. The area corresponded to the northern part of present-day Upper Normandy down to the river Seine, but the Duchy would eventually extend west beyond the Seine. The territory was roughly equivalent to the old province of Rouen, and reproduced the Roman administrative structure of Gallia Lugdunensis II (part of the former Gallia Lugdunensis).", "questions": [{"question": "When was the Duchy of Normandy founded?", "is_impossible": false}, {"question": "Who did Rollo sign the treaty of Saint-Clair-sur-Epte with?", "is_impossible": false}, {"question": "What river originally bounded the Duchy", "is_impossible": false}, {"question": "when did Nors encampments ivolve into destructive incursions?", "is_impossible": true}, {"question": "What treaty was established in the 9th century?", "is_impossible": true}, {"question": "Who established a treaty with King Charles the third of France?", "is_impossible": true}, {"question": "What did the French promises to protect Rollo and his men from?", "is_impossible": true}]}, {"id": "1_5", "context": "Before Rollo's arrival, its populations did not differ from Picardy or the Île-de-France, which were considered \"Frankish\". Earlier Viking settlers had begun arriving in the 880s, but were divided between colonies in the east (Roumois and Pays de Caux) around the low Seine valley and in the west in the Cotentin Peninsula, and were separated by traditional pagii, where the population remained about the same with almost no foreign settlers. Rollo's contingents who raided and ultimately settled Normandy and parts of the Atlantic coast included Danes, Norwegians, Norse–Gaels, Orkney Vikings, possibly Swedes, and Anglo-Danes from the English Danelaw under Norse control.", "questions": [{"question": "Who upon arriving gave the original viking settlers a common identity?", "is_impossible": false}, {"question": "When did Rollo begin to arrive in Normandy?", "is_impossible": true}, {"question": "What Viking groups were conquered by Rollo?", "is_impossible": true}]}, {"id": "1_6", "context": "The descendants of Rollo's Vikings and their Frankish wives would replace the Norse religion and Old Norse language with Catholicism (Christianity) and the Gallo-Romance language of the local people, blending their maternal Frankish heritage with Old Norse traditions and customs to synthesize a unique \"Norman\" culture in the north of France. The Norman language was forged by the adoption of the indigenous langue d'oïl branch of Romance by a Norse-speaking ruling class, and it developed into the regional language that survives today.", "questions": [{"question": "What was the Norman religion?", "is_impossible": false}, {"question": "What part of France were the Normans located?", "is_impossible": false}, {"question": "What was replace with the Norse religion?", "is_impossible": true}, {"question": "What did maternal Old Norse traditions merge with?", "is_impossible": true}, {"question": "What language replaced the Gallo-Romance language?", "is_impossible": true}]}, {"id": "1_7", "context": "The Normans thereafter adopted the growing feudal doctrines of the rest of France, and worked them into a functional hierarchical system in both Normandy and in England. The new Norman rulers were culturally and ethnically distinct from the old French aristocracy, most of whom traced their lineage to Franks of the Carolingian dynasty. Most Norman knights remained poor and land-hungry, and by 1066 Normandy had been exporting fighting horsemen for more than a generation. Many Normans of Italy, France and England eventually served as avid Crusaders under the Italo-Norman prince Bohemund I and the Anglo-Norman king Richard the Lion-Heart.", "questions": [{"question": "What was one of the Norman's major exports?", "is_impossible": false}, {"question": "Who adopted the fuedel doctrines of the Normans?", "is_impossible": true}, {"question": "What was one of the Norman's major imports?", "is_impossible": true}, {"question": "Who's arristocracy eventually served as avid Crusaders?", "is_impossible": true}]}, {"id": "1_8", "context": "Soon after the Normans began to enter Italy, they entered the Byzantine Empire and then Armenia, fighting against the Pechenegs, the Bulgars, and especially the Seljuk Turks. Norman mercenaries were first encouraged to come to the south by the Lombards to act against the Byzantines, but they soon fought in Byzantine service in Sicily. They were prominent alongside Varangian and Lombard contingents in the Sicilian campaign of George Maniaces in 1038–40. There is debate whether the Normans in Greek service actually were from Norman Italy, and it now seems likely only a few came from there. It is also unknown how many of the \"Franks\", as the Byzantines called them, were Normans and not other Frenchmen.", "questions": [{"question": "Who was the Normans' main enemy in Italy, the Byzantine Empire and Armenia?", "is_impossible": false}, {"question": "Who entered Italy soon after the Byzantine Empire?", "is_impossible": true}, {"question": "Who did the Normans fight in Italy?", "is_impossible": true}, {"question": "Who did the Normans encourage to come to the south?", "is_impossible": true}, {"question": "During what campaign did the Vargian and Lombard fight?", "is_impossible": true}]}, {"id": "1_9", "context": "One of the first Norman mercenaries to serve as a Byzantine general was Hervé in the 1050s. By then however, there were already Norman mercenaries serving as far away as Trebizond and Georgia. They were based at Malatya and Edessa, under the Byzantine duke of Antioch, Isaac Komnenos. In the 1060s, Robert Crispin led the Normans of Edessa against the Turks. Roussel de Bailleul even tried to carve out an independent state in Asia Minor with support from the local population, but he was stopped by the Byzantine general Alexius Komnenos.", "questions": [{"question": "When did Herve serve as a Byzantine general?", "is_impossible": false}, {"question": "When did Robert Crispin go up against the Turks?", "is_impossible": false}, {"question": "Who ruined Roussel de Bailleul's plans for an independent state?", "is_impossible": false}, {"question": "Who was the first Byzantine mercenary to serve with the Normans?", "is_impossible": true}, {"question": "When did Herve serve as a Norman general?", "is_impossible": true}, {"question": "Who ruined Alexius Komnenos plans for an independent state?", "is_impossible": true}, {"question": "When did Herve go up against the Turks?", "is_impossible": true}]}, {"id": "1_10", "context": "Some Normans joined Turkish forces to aid in the destruction of the Armenians vassal-states of Sassoun and Taron in far eastern Anatolia. Later, many took up service with the Armenian state further south in Cilicia and the Taurus Mountains. A Norman named Oursel led a force of \"Franks\" into the upper Euphrates valley in northern Syria. From 1073 to 1074, 8,000 of the 20,000 troops of the Armenian general Philaretus Brachamius were Normans—formerly of Oursel—led by Raimbaud. They even lent their ethnicity to the name of their castle: Afranji, meaning \"Franks.\" The known trade between Amalfi and Antioch and between Bari and Tarsus may be related to the presence of Italo-Normans in those cities while Amalfi and Bari were under Norman rule in Italy.", "questions": [{"question": "What was the name of the Norman castle?", "is_impossible": false}, {"question": "Who was the leader when the Franks entered the Euphrates valley?", "is_impossible": false}, {"question": "Who did the Normans team up with in Anatolia?", "is_impossible": false}, {"question": "Who joined Norman forces in the destruction of the Armenians?", "is_impossible": true}, {"question": "Who did the Turks take up service with?", "is_impossible": true}, {"question": "What Frank led Norman forces?", "is_impossible": true}, {"question": "Where did Oursel lead the Franks?", "is_impossible": true}]}, {"id": "1_11", "context": "Several families of Byzantine Greece were of Norman mercenary origin during the period of the Comnenian Restoration, when Byzantine emperors were seeking out western European warriors. The Raoulii were descended from an Italo-Norman named Raoul, the Petraliphae were descended from a Pierre d'Aulps, and that group of Albanian clans known as the Maniakates were descended from Normans who served under George Maniaces in the Sicilian expedition of 1038.", "questions": [{"question": "What were the origins of the Raouliii family?", "is_impossible": false}, {"question": "Where were several Norman mercenary familes originate from?", "is_impossible": true}, {"question": "Who did the Normans serve under in the 10th century?", "is_impossible": true}, {"question": "What expedition did George Maniaces lead in the 10th century?", "is_impossible": true}]}, {"id": "1_12", "context": "Robert Guiscard, an other Norman adventurer previously elevated to the dignity of count of Apulia as the result of his military successes, ultimately drove the Byzantines out of southern Italy. Having obtained the consent of pope Gregory VII and acting as his vassal, Robert continued his campaign conquering the Balkan peninsula as a foothold for western feudal lords and the Catholic Church. After allying himself with Croatia and the Catholic cities of Dalmatia, in 1081 he led an army of 30,000 men in 300 ships landing on the southern shores of Albania, capturing Valona, Kanina, Jericho (Orikumi), and reaching Butrint after numerous pillages. They joined the fleet that had previously conquered Corfu and attacked Dyrrachium from land and sea, devastating everything along the way. Under these harsh circumstances, the locals accepted the call of emperor Alexius I Comnenus to join forces with the Byzantines against the Normans. The Albanian forces could not take part in the ensuing battle because it had started before their arrival. Immediately before the battle, the Venetian fleet had secured a victory in the coast surrounding the city. Forced to retreat, Alexius ceded the command to a high Albanian official named Comiscortes in the service of Byzantium. The city's garrison resisted until February 1082, when Dyrrachium was betrayed to the Normans by the Venetian and Amalfitan merchants who had settled there. The Normans were now free to penetrate into the hinterland; they took Ioannina and some minor cities in southwestern Macedonia and Thessaly before appearing at the gates of Thessalonica. Dissension among the high ranks coerced the Normans to retreat to Italy. They lost Dyrrachium, Valona, and Butrint in 1085, after the death of Robert.", "questions": [{"question": "What was the name of the count of Apulia ", "is_impossible": false}, {"question": "When did Dyrrachium  fall to the Normans?", "is_impossible": false}, {"question": "How many men were in Robert's army?", "is_impossible": false}, {"question": "Who ultimatly drove the Byzantines out of Europe?", "is_impossible": true}, {"question": "What pope opposed Roberts campaign?", "is_impossible": true}, {"question": "What fell to the Normans in the 10th century?", "is_impossible": true}, {"question": "How many men did Roberts army face?", "is_impossible": true}]}, {"id": "1_13", "context": "A few years after the First Crusade, in 1107, the Normans under the command of Bohemond, Robert's son, landed in Valona and besieged Dyrrachium using the most sophisticated military equipment of the time, but to no avail. Meanwhile, they occupied Petrela, the citadel of Mili at the banks of the river Deabolis, Gllavenica (Ballsh), Kanina and Jericho. This time, the Albanians sided with the Normans, dissatisfied by the heavy taxes the Byzantines had imposed upon them. With their help, the Normans secured the Arbanon passes and opened their way to Dibra. The lack of supplies, disease and Byzantine resistance forced Bohemond to retreat from his campaign and sign a peace treaty with the Byzantines in the city of Deabolis.", "questions": [{"question": "Where did the Normans and Byzantines sign the peace treaty?", "is_impossible": false}, {"question": "Who was Robert's son?", "is_impossible": false}, {"question": "What river was Petrela located by?", "is_impossible": false}, {"question": "Who did the Normans besiege in the 11th century?", "is_impossible": true}, {"question": "Who did Robert lead agains Dyrrachium in 1107?", "is_impossible": true}, {"question": "Who was Bohemond's son?", "is_impossible": true}]}, {"id": "1_14", "context": "The further decline of Byzantine state-of-affairs paved the road to a third attack in 1185, when a large Norman army invaded Dyrrachium, owing to the betrayal of high Byzantine officials. Some time later, Dyrrachium—one of the most important naval bases of the Adriatic—fell again to Byzantine hands.", "questions": [{"question": "When did the Normans attack Dyrrachium?", "is_impossible": false}, {"question": "What was the naval base called?", "is_impossible": false}, {"question": "Where was Dyrrachium located?", "is_impossible": false}, {"question": "Who attacked Dyrrachium in the 11th century?", "is_impossible": true}, {"question": "Who betrayed the Normans?", "is_impossible": true}, {"question": "What naval base fell to the Normans?", "is_impossible": true}]}, {"id": "1_15", "context": "The Normans were in contact with England from an early date. Not only were their original Viking brethren still ravaging the English coasts, they occupied most of the important ports opposite England across the English Channel. This relationship eventually produced closer ties of blood through the marriage of Emma, sister of Duke Richard II of Normandy, and King Ethelred II of England. Because of this, Ethelred fled to Normandy in 1013, when he was forced from his kingdom by Sweyn Forkbeard. His stay in Normandy (until 1016) influenced him and his sons by Emma, who stayed in Normandy after Cnut the Great's conquest of the isle.", "questions": [{"question": "Who did Emma Marry?", "is_impossible": false}, {"question": "Who was Emma's brother?", "is_impossible": false}, {"question": "To where did Ethelred flee?", "is_impossible": false}, {"question": "Who kicked Ethelred out?", "is_impossible": false}, {"question": "Who married Cnut the Great?", "is_impossible": true}, {"question": "When did Richard II flee to Normandy?", "is_impossible": true}, {"question": "Who's major ports were controlled by the English?", "is_impossible": true}]}, {"id": "1_16", "context": "When finally Edward the Confessor returned from his father's refuge in 1041, at the invitation of his half-brother Harthacnut, he brought with him a Norman-educated mind. He also brought many Norman counsellors and fighters, some of whom established an English cavalry force. This concept never really took root, but it is a typical example of the attitudes of Edward. He appointed Robert of Jumièges archbishop of Canterbury and made Ralph the Timid earl of Hereford. He invited his brother-in-law Eustace II, Count of Boulogne to his court in 1051, an event which resulted in the greatest of early conflicts between Saxon and Norman and ultimately resulted in the exile of Earl Godwin of Wessex.", "questions": [{"question": "Who was Edward the Confessor's half-brother?", "is_impossible": false}, {"question": "When did Edward return?", "is_impossible": false}, {"question": "Who did Edward make archbishop of Canterbury?", "is_impossible": false}, {"question": "When did Edward the Confessor's son return from his fathers refuge?", "is_impossible": true}, {"question": "What kind of force did Harthacnut establish?", "is_impossible": true}, {"question": "Who made Robert of Jumieges earl of Hereford?", "is_impossible": true}]}, {"id": "1_17", "context": "In 1066, Duke William II of Normandy conquered England killing King Harold II at the Battle of Hastings. The invading Normans and their descendants replaced the Anglo-Saxons as the ruling class of England. The nobility of England were part of a single Normans culture and many had lands on both sides of the channel. Early Norman kings of England, as Dukes of Normandy, owed homage to the King of France for their land on the continent. They considered England to be their most important holding (it brought with it the title of King—an important status symbol).", "questions": [{"question": "Where did Harold II die?", "is_impossible": false}, {"question": "Who killed Harold II? ", "is_impossible": false}, {"question": "When was the Battle of Hastings?", "is_impossible": false}, {"question": "Who was the ruling class ahead of the Normans?", "is_impossible": false}, {"question": "When did King Harold II conquer England?", "is_impossible": true}, {"question": "What battle took place in the 10th century?", "is_impossible": true}, {"question": "Who replaced the Normans as the ruling class?", "is_impossible": true}, {"question": "Who considered their land on the continent their most important holding?", "is_impossible": true}]}, {"id": "1_18", "context": "Eventually, the Normans merged with the natives, combining languages and traditions. In the course of the Hundred Years' War, the Norman aristocracy often identified themselves as English. The Anglo-Norman language became distinct from the Latin language, something that was the subject of some humour by Geoffrey Chaucer. The Anglo-Norman language was eventually absorbed into the Anglo-Saxon language of their subjects (see Old English) and influenced it, helping (along with the Norse language of the earlier Anglo-Norse settlers and the Latin used by the church) in the development of Middle English. It in turn evolved into Modern English.", "questions": [{"question": "What was the Anglo-Norman language's final form?", "is_impossible": false}, {"question": "Who identified themselves as French during the Hundred Years War?", "is_impossible": true}, {"question": "What was absorbed into the Anglo-Norman language?", "is_impossible": true}, {"question": "Who made fun of the Latin language?", "is_impossible": true}]}, {"id": "1_19", "context": "The Normans had a profound effect on Irish culture and history after their invasion at Bannow Bay in 1169. Initially the Normans maintained a distinct culture and ethnicity. Yet, with time, they came to be subsumed into Irish culture to the point that it has been said that they became \"more Irish than the Irish themselves.\" The Normans settled mostly in an area in the east of Ireland, later known as the Pale, and also built many fine castles and settlements, including Trim Castle and Dublin Castle. Both cultures intermixed, borrowing from each other's language, culture and outlook. Norman descendants today can be recognised by their surnames. Names such as French, (De) Roche, Devereux, D'Arcy, Treacy and Lacy are particularly common in the southeast of Ireland, especially in the southern part of County Wexford where the first Norman settlements were established. Other Norman names such as Furlong predominate there. Another common Norman-Irish name was Morell (Murrell) derived from the French Norman name Morel. Other names beginning with Fitz (from the Norman for son) indicate Norman ancestry. These included Fitzgerald, FitzGibbons (Gibbons) dynasty, Fitzmaurice. Other families bearing such surnames as Barry (de Barra) and De Búrca (Burke) are also of Norman extraction.", "questions": [{"question": "In what year did the Norman's invade at Bannow Bay?", "is_impossible": false}, {"question": "What country did the Normans invade in 1169?", "is_impossible": false}, {"question": "What culture did the Normans combine with in Ireland?", "is_impossible": false}, {"question": "Where did the Normans invade in the 11th century?", "is_impossible": true}, {"question": "Who did the Irish culture have a profound effect on?", "is_impossible": true}, {"question": "What castles were built by the Irish?", "is_impossible": true}]}, {"id": "1_20", "context": "One of the claimants of the English throne opposing William the Conqueror, Edgar Atheling, eventually fled to Scotland. King Malcolm III of Scotland married Edgar's sister Margaret, and came into opposition to William who had already disputed Scotland's southern borders. William invaded Scotland in 1072, riding as far as Abernethy where he met up with his fleet of ships. Malcolm submitted, paid homage to William and surrendered his son Duncan as a hostage, beginning a series of arguments as to whether the Scottish Crown owed allegiance to the King of England.", "questions": [{"question": "Who was Margaret's brother?", "is_impossible": false}, {"question": "Who was Margaret's husband?", "is_impossible": false}, {"question": "When was Scotland invaded by William?", "is_impossible": false}, {"question": "Who was the hostage?", "is_impossible": false}, {"question": "Who did Edgar marry?", "is_impossible": true}, {"question": "Who invaded Scotland in the 10th century?", "is_impossible": true}, {"question": "Who did the Scotish king take hostage?", "is_impossible": true}]}, {"id": "1_21", "context": "Normans came into Scotland, building castles and founding noble families who would provide some future kings, such as Robert the Bruce, as well as founding a considerable number of the Scottish clans. King David I of Scotland, whose elder brother Alexander I had married Sybilla of Normandy, was instrumental in introducing Normans and Norman culture to Scotland, part of the process some scholars call the \"Davidian Revolution\". Having spent time at the court of Henry I of England (married to David's sister Maud of Scotland), and needing them to wrestle the kingdom from his half-brother Máel Coluim mac Alaxandair, David had to reward many with lands. The process was continued under David's successors, most intensely of all under William the Lion. The Norman-derived feudal system was applied in varying degrees to most of Scotland. Scottish families of the names Bruce, Gray, Ramsay, Fraser, Ogilvie, Montgomery, Sinclair, Pollock, Burnard, Douglas and Gordon to name but a few, and including the later royal House of Stewart, can all be traced back to Norman ancestry.", "questions": [{"question": "Who did Alexander I marry?", "is_impossible": false}, {"question": "What culture's arrival in Scotland is know as the \"Davidian Revolution\"?", "is_impossible": false}, {"question": "Who did King David I of Scotland Marry?", "is_impossible": true}, {"question": "What did Sybilla of Normandy introduce to Scotland?", "is_impossible": true}]}, {"id": "1_22", "context": "Even before the Norman Conquest of England, the Normans had come into contact with Wales. Edward the Confessor had set up the aforementioned Ralph as earl of Hereford and charged him with defending the Marches and warring with the Welsh. In these original ventures, the Normans failed to make any headway into Wales.", "questions": [{"question": "Where was Ralph earl of?", "is_impossible": false}, {"question": "Who was Ralph in charge of being at war with?", "is_impossible": false}, {"question": "Who made Ralph earl?", "is_impossible": false}, {"question": "Who came into contact with Wales after the conquest of England?", "is_impossible": true}, {"question": "Who made Edward the Confessor Earl?", "is_impossible": true}]}, {"id": "1_23", "context": "Subsequent to the Conquest, however, the Marches came completely under the dominance of William's most trusted Norman barons, including Bernard de Neufmarché, Roger of Montgomery in Shropshire and Hugh Lupus in Cheshire. These Normans began a long period of slow conquest during which almost all of Wales was at some point subject to Norman interference. Norman words, such as baron (barwn), first entered Welsh at that time.", "questions": [{"question": "What country was under the control of Norman barons?", "is_impossible": false}, {"question": "What came under Williams dominace before the conquest?", "is_impossible": true}, {"question": "What Welsh lords did William conquer?", "is_impossible": true}]}, {"id": "1_24", "context": "The legendary religious zeal of the Normans was exercised in religious wars long before the First Crusade carved out a Norman principality in Antioch. They were major foreign participants in the Reconquista in Iberia. In 1018, Roger de Tosny travelled to the Iberian Peninsula to carve out a state for himself from Moorish lands, but failed. In 1064, during the War of Barbastro, William of Montreuil led the papal army and took a huge booty.", "questions": [{"question": "What year did Roger de Tosny fail to accomplish what he set out to do?", "is_impossible": false}, {"question": "Who was in charge of the papal army in the War of Barbastro?", "is_impossible": false}, {"question": "Where did the Normans carve out a principality before the First Crusade?", "is_impossible": true}, {"question": "What did the Normans take part in in the 10th century?", "is_impossible": true}, {"question": "Who carved out a state for himself from Moorish lands?", "is_impossible": true}, {"question": "What war occured in the 1oth century?", "is_impossible": true}]}, {"id": "1_25", "context": "In 1096, Crusaders passing by the siege of Amalfi were joined by Bohemond of Taranto and his nephew Tancred with an army of Italo-Normans. Bohemond was the de facto leader of the Crusade during its passage through Asia Minor. After the successful Siege of Antioch in 1097, Bohemond began carving out an independent principality around that city. Tancred was instrumental in the conquest of Jerusalem and he worked for the expansion of the Crusader kingdom in Transjordan and the region of Galilee.[citation needed]", "questions": [{"question": "When did the Siege of Antioch take place?", "is_impossible": false}, {"question": "What was the name of Bohemond's nephew?", "is_impossible": false}, {"question": "What major conquest did Tancred play a roll in?", "is_impossible": false}, {"question": "When did Tancred lay siege to Antioch?", "is_impossible": true}, {"question": "What was the name of Tancred's nephew?", "is_impossible": true}]}, {"id": "1_26", "context": "The conquest of Cyprus by the Anglo-Norman forces of the Third Crusade opened a new chapter in the history of the island, which would be under Western European domination for the following 380 years. Although not part of a planned operation, the conquest had much more permanent results than initially expected.", "questions": [{"question": "How long did Western Europe control Cyprus?", "is_impossible": false}, {"question": "Who defeated Anglo-Norman forces during the third Crusade?", "is_impossible": true}, {"question": "Who dominated Western Europe for 380 years?", "is_impossible": true}]}, {"id": "1_27", "context": "In April 1191 Richard the Lion-hearted left Messina with a large fleet in order to reach Acre. But a storm dispersed the fleet. After some searching, it was discovered that the boat carrying his sister and his fiancée Berengaria was anchored on the south coast of Cyprus, together with the wrecks of several other ships, including the treasure ship. Survivors of the wrecks had been taken prisoner by the island's despot Isaac Komnenos. On 1 May 1191, Richard's fleet arrived in the port of Limassol on Cyprus. He ordered Isaac to release the prisoners and the treasure. Isaac refused, so Richard landed his troops and took Limassol.", "questions": [{"question": "What ruined Richard's plans to reach Acre?", "is_impossible": false}, {"question": "Who was Richard's fiancee?", "is_impossible": false}, {"question": "What year did the storm hit Richard's fleet?", "is_impossible": false}, {"question": "Who ruled Cyprus in 1191?", "is_impossible": false}, {"question": "Who left Messina in the 11th century?", "is_impossible": true}, {"question": "What year did Richards fleet avoid a storm?", "is_impossible": true}, {"question": "Who ruled Cyprus in the 11th century?", "is_impossible": true}]}, {"id": "1_28", "context": "Various princes of the Holy Land arrived in Limassol at the same time, in particular Guy de Lusignan. All declared their support for Richard provided that he support Guy against his rival Conrad of Montferrat. The local barons abandoned Isaac, who considered making peace with Richard, joining him on the crusade, and offering his daughter in marriage to the person named by Richard. But Isaac changed his mind and tried to escape. Richard then proceeded to conquer the whole island, his troops being led by Guy de Lusignan. Isaac surrendered and was confined with silver chains, because Richard had promised that he would not place him in irons. By 1 June, Richard had conquered the whole island. His exploit was well publicized and contributed to his reputation; he also derived significant financial gains from the conquest of the island. Richard left for Acre on 5 June, with his allies. Before his departure, he named two of his Norman generals, Richard de Camville and Robert de Thornham, as governors of Cyprus.", "questions": [{"question": "Who was Guy's Rival?", "is_impossible": false}, {"question": "What were Isaac's chains made out of?", "is_impossible": false}, {"question": "Who led Richard's troops when Cyprus was conquered?", "is_impossible": false}, {"question": "Who's chains were made out of copper?", "is_impossible": true}, {"question": "Who led Issacs troops to Cyprus?", "is_impossible": true}, {"question": "Who offered Issac his daughter?", "is_impossible": true}]}, {"id": "1_29", "context": "Between 1402 and 1405, the expedition led by the Norman noble Jean de Bethencourt and the Poitevine Gadifer de la Salle conquered the Canarian islands of Lanzarote, Fuerteventura and El Hierro off the Atlantic coast of Africa. Their troops were gathered in Normandy, Gascony and were later reinforced by Castilian colonists.", "questions": [{"question": "What continent are the Canarian Islands off the coast of?", "is_impossible": false}, {"question": "Who conquered the Canary Island in the 14th century?", "is_impossible": true}, {"question": "What Islands are of the coast of Asia?", "is_impossible": true}]}, {"id": "1_30", "context": "Bethencourt took the title of King of the Canary Islands, as vassal to Henry III of Castile. In 1418, Jean's nephew Maciot de Bethencourt sold the rights to the islands to Enrique Pérez de Guzmán, 2nd Count de Niebla.", "questions": [{"question": "Who became the King of the Canary Islands?", "is_impossible": false}, {"question": "Who bought the rights?", "is_impossible": false}, {"question": "Who sold the rights?", "is_impossible": false}, {"question": "What title did Henry II take in the Canary Island?", "is_impossible": true}, {"question": "Who sold the rights to the island in the 14th century?", "is_impossible": true}]}, {"id": "1_31", "context": "The customary law of Normandy was developed between the 10th and 13th centuries and survives today through the legal systems of Jersey and Guernsey in the Channel Islands. Norman customary law was transcribed in two customaries in Latin by two judges for use by them and their colleagues: These are the Très ancien coutumier (Very ancient customary), authored between 1200 and 1245; and the Grand coutumier de Normandie (Great customary of Normandy, originally Summa de legibus Normanniae in curia laïcali), authored between 1235 and 1245.", "questions": [{"question": "Where are Jersey and Guernsey", "is_impossible": false}, {"question": "How many customaries does Norman customary law have?", "is_impossible": false}, {"question": "What Norman law wasdeveloped between 1000 and 1300?", "is_impossible": true}, {"question": "What law has 3 customeries?", "is_impossible": true}, {"question": "What was authored in the 12th century?", "is_impossible": true}]}, {"id": "1_32", "context": "Norman architecture typically stands out as a new stage in the architectural history of the regions they subdued. They spread a unique Romanesque idiom to England and Italy, and the encastellation of these regions with keeps in their north French style fundamentally altered the military landscape. Their style was characterised by rounded arches, particularly over windows and doorways, and massive proportions.", "questions": [{"question": "What is the Norman architecture idiom?", "is_impossible": false}, {"question": "What kind of arches does Norman architecture have?", "is_impossible": false}, {"question": "What type of arch did the Normans invent?", "is_impossible": true}]}, {"id": "1_33", "context": "In England, the period of Norman architecture immediately succeeds that of the Anglo-Saxon and precedes the Early Gothic. In southern Italy, the Normans incorporated elements of Islamic, Lombard, and Byzantine building techniques into their own, initiating a unique style known as Norman-Arab architecture within the Kingdom of Sicily.", "questions": [{"question": "What architecture type came after Norman in England?", "is_impossible": false}, {"question": "What architecture type came before Norman in England?", "is_impossible": false}, {"question": "What place had the Norman Arab architectural style?", "is_impossible": false}, {"question": "What precedes the period of Anglo-Saxon architecture?", "is_impossible": true}, {"question": "What architecture type came after Early Gothic?", "is_impossible": true}, {"question": "Who incorperated Islamic, LOmbard, and Byzantine building techniques in England?", "is_impossible": true}]}, {"id": "1_34", "context": "In the visual arts, the Normans did not have the rich and distinctive traditions of the cultures they conquered. However, in the early 11th century the dukes began a programme of church reform, encouraging the Cluniac reform of monasteries and patronising intellectual pursuits, especially the proliferation of scriptoria and the reconstitution of a compilation of lost illuminated manuscripts. The church was utilised by the dukes as a unifying force for their disparate duchy. The chief monasteries taking part in this \"renaissance\" of Norman art and scholarship were Mont-Saint-Michel, Fécamp, Jumièges, Bec, Saint-Ouen, Saint-Evroul, and Saint-Wandrille. These centres were in contact with the so-called \"Winchester school\", which channeled a pure Carolingian artistic tradition to Normandy. In the final decade of the 11th and first of the 12th century, Normandy experienced a golden age of illustrated manuscripts, but it was brief and the major scriptoria of Normandy ceased to function after the midpoint of the century.", "questions": [{"question": "When did the church reform begin?", "is_impossible": false}, {"question": "Who used the church to unify themselves?", "is_impossible": false}, {"question": "What kind of art did the Normans have a rich tradition of?", "is_impossible": true}, {"question": "Who began a program of church reform in the 1100s", "is_impossible": true}, {"question": "Who was divided by the church?", "is_impossible": true}, {"question": "Who experienced aa golden age in the 1100s and 1200s", "is_impossible": true}]}, {"id": "1_35", "context": "The French Wars of Religion in the 16th century and French Revolution in the 18th successively destroyed much of what existed in the way of the architectural and artistic remnant of this Norman creativity. The former, with their violence, caused the wanton destruction of many Norman edifices; the latter, with its assault on religion, caused the purposeful destruction of religious objects of any type, and its destabilisation of society resulted in rampant pillaging.", "questions": [{"question": "When were the French wars of religion?", "is_impossible": false}, {"question": "What wars did France fight in the 1600s?", "is_impossible": true}, {"question": "What revolution was fought in the 1899's?", "is_impossible": true}]}, {"id": "1_36", "context": "By far the most famous work of Norman art is the Bayeux Tapestry, which is not a tapestry but a work of embroidery. It was commissioned by Odo, the Bishop of Bayeux and first Earl of Kent, employing natives from Kent who were learned in the Nordic traditions imported in the previous half century by the Danish Vikings.", "questions": [{"question": "What kind of needlework was used in the creation of the Bayeux Tapestry?", "is_impossible": false}, {"question": "What is Norman art's most well known piece?", "is_impossible": false}, {"question": "Who commissioned the Tapestry?", "is_impossible": false}, {"question": "What is the oldest work of Norman art?", "is_impossible": true}, {"question": "Who commissioned Danish vikings to create the Bayeux Tapestry?", "is_impossible": true}]}, {"id": "1_37", "context": "In Britain, Norman art primarily survives as stonework or metalwork, such as capitals and baptismal fonts. In southern Italy, however, Norman artwork survives plentifully in forms strongly influenced by its Greek, Lombard, and Arab forebears. Of the royal regalia preserved in Palermo, the crown is Byzantine in style and the coronation cloak is of Arab craftsmanship with Arabic inscriptions. Many churches preserve sculptured fonts, capitals, and more importantly mosaics, which were common in Norman Italy and drew heavily on the Greek heritage. Lombard Salerno was a centre of ivorywork in the 11th century and this continued under Norman domination. Finally should be noted the intercourse between French Crusaders traveling to the Holy Land who brought with them French artefacts with which to gift the churches at which they stopped in southern Italy amongst their Norman cousins. For this reason many south Italian churches preserve works from France alongside their native pieces.", "questions": [{"question": "What is the most important type of Norman art preserved in churches?", "is_impossible": false}, {"question": "How has British art survived in Normandy?", "is_impossible": true}, {"question": "What is the most common form of Norman art in churches?", "is_impossible": true}, {"question": "What was a centre of ivorywork in the 1100s?", "is_impossible": true}]}, {"id": "1_38", "context": "Normandy was the site of several important developments in the history of classical music in the 11th century. Fécamp Abbey and Saint-Evroul Abbey were centres of musical production and education. At Fécamp, under two Italian abbots, William of Volpiano and John of Ravenna, the system of denoting notes by letters was developed and taught. It is still the most common form of pitch representation in English- and German-speaking countries today. Also at Fécamp, the staff, around which neumes were oriented, was first developed and taught in the 11th century. Under the German abbot Isembard, La Trinité-du-Mont became a centre of musical composition.", "questions": [{"question": "In what century did important classical music developments occur in Normandy?", "is_impossible": false}, {"question": "Who were the two abbots at Fécamp Abbey?", "is_impossible": false}, {"question": "What developed in Normandy during the 1100s?", "is_impossible": true}, {"question": "What was Fecamp Abby the center of?", "is_impossible": true}]}, {"id": "1_39", "context": "At Saint Evroul, a tradition of singing had developed and the choir achieved fame in Normandy. Under the Norman abbot Robert de Grantmesnil, several monks of Saint-Evroul fled to southern Italy, where they were patronised by Robert Guiscard and established a Latin monastery at Sant'Eufemia. There they continued the tradition of singing.", "questions": [{"question": "Where did the monks flee to?", "is_impossible": false}, {"question": "What monastery did the Saint-Evroul monks establish in Italy?", "is_impossible": false}, {"question": "Who patronized the monks in Italy? ", "is_impossible": false}, {"question": "What tradition were the Saint-Evroul monks known for?", "is_impossible": false}, {"question": "Who fled from southern Italy?", "is_impossible": true}]}]}
