{"data": [{"id": "20_1", "context": "Private schools, also known as independent schools, non-governmental, or nonstate schools, are not administered by local, state or national governments; thus, they retain the right to select their students and are funded in whole or in part by charging their students tuition, rather than relying on mandatory taxation through public (government) funding; at some private schools students may be able to get a scholarship, which makes the cost cheaper, depending on a talent the student may have (e.g. sport scholarship, art scholarship, academic scholarship), financial need, or tax credit scholarships that might be available.", "questions": [{"question": "Along with non-governmental and nonstate schools, what is another name for private schools?", "is_impossible": false}, {"question": "Along with sport and art, what is a type of talent scholarship?", "is_impossible": false}, {"question": "Rather than taxation, what are private schools largely funded by?", "is_impossible": false}, {"question": "What right do private schools have that public schools don't?", "is_impossible": false}, {"question": "What is another name for a public school?", "is_impossible": true}, {"question": "What kind of taxation funds private schools?", "is_impossible": true}, {"question": "What can help a student get a scholarship for a public school?", "is_impossible": true}, {"question": "What are two reasons a student would be able to get a scholarship for a public school?", "is_impossible": true}, {"question": "What are public schools allowed to do to retain talented students?", "is_impossible": true}]}, {"id": "20_2", "context": "In the United Kingdom and several other Commonwealth countries including Australia and Canada, the use of the term is generally restricted to primary and secondary educational levels; it is almost never used of universities and other tertiary institutions. Private education in North America covers the whole gamut of educational activity, ranging from pre-school to tertiary level institutions. Annual tuition fees at K-12 schools range from nothing at so called 'tuition-free' schools to more than $45,000 at several New England preparatory schools.", "questions": [{"question": "What is the yearly cost of some notable prep schools in New England?", "is_impossible": false}, {"question": "What are private schools that charge no tuition called?", "is_impossible": false}, {"question": "Along with Canada and the United Kingdom, what country generally doesn't refer to universities as private schools?", "is_impossible": false}, {"question": "What region does use the term 'private schools' to refer to universities?", "is_impossible": false}, {"question": "How much does it cost yearly to go to a UK university?", "is_impossible": true}, {"question": "What is the term private school restricted to in the US?", "is_impossible": true}, {"question": "When is the term private school never used in the US?", "is_impossible": true}, {"question": "What are schools called that don't charge tuition in Austraila?", "is_impossible": true}, {"question": "What term does the UK, Australia and Canada always use when referring to universities?", "is_impossible": true}]}, {"id": "20_3", "context": "The secondary level includes schools offering years 7 through 12 (year twelve is known as lower sixth) and year 13 (upper sixth). This category includes university-preparatory schools or \"prep schools\", boarding schools and day schools. Tuition at private secondary schools varies from school to school and depends on many factors, including the location of the school, the willingness of parents to pay, peer tuitions and the school's financial endowment. High tuition, schools claim, is used to pay higher salaries for the best teachers and also used to provide enriched learning environments, including a low student to teacher ratio, small class sizes and services, such as libraries, science laboratories and computers. Some private schools are boarding schools and many military academies are privately owned or operated as well.", "questions": [{"question": "What is another term for year 12 of education?", "is_impossible": false}, {"question": "What is another term used for year 13?", "is_impossible": false}, {"question": "What is another term for university-preparatory schools?", "is_impossible": false}, {"question": "Along with location, endowment and the willingness of parents to pay, what factor influences private school tuition?", "is_impossible": false}, {"question": "Who receives higher salaries at private schools that charge higher tuition?", "is_impossible": false}, {"question": "What is another term used for library?", "is_impossible": true}, {"question": "What is  another term used for science lab?", "is_impossible": true}, {"question": "What is the tuititon used for at military academies?", "is_impossible": true}, {"question": "What ameneties are available when you are enrolled at a military academy?", "is_impossible": true}]}, {"id": "20_4", "context": "Religiously affiliated and denominational schools form a subcategory of private schools. Some such schools teach religious education, together with the usual academic subjects to impress their particular faith's beliefs and traditions in the students who attend. Others use the denomination as more of a general label to describe on what the founders based their belief, while still maintaining a fine distinction between academics and religion. They include parochial schools, a term which is often used to denote Roman Catholic schools. Other religious groups represented in the K-12 private education sector include Protestants, Jews, Muslims and the Orthodox Christians.", "questions": [{"question": "What religion's schools does the term 'parochial schools' generally refer to?", "is_impossible": false}, {"question": "Along with Muslims, Jews and Protestant Christians, what religious group notably operates private schools?", "is_impossible": false}, {"question": "What type of education is sometimes present at religious schools in addition to the secular curriculum?", "is_impossible": false}, {"question": "What category are schools put into that maintain a line between academics and religion?", "is_impossible": true}, {"question": "What do all Roman Catholic schools teach?", "is_impossible": true}, {"question": "Why were Roman Catholic schools founded?", "is_impossible": true}, {"question": "What method do Muslim run schools use in their curriculum?", "is_impossible": true}]}, {"id": "20_5", "context": "Private schools in Australia may be favoured for many reasons: prestige and the social status of the 'old school tie'; better quality physical infrastructure and more facilities (e.g. playing fields, swimming pools, etc.), higher-paid teachers; and/or the belief that private schools offer a higher quality of education. Some schools offer the removal of the purported distractions of co-education; the presence of boarding facilities; or stricter discipline based on their power of expulsion, a tool not readily available to government schools. Student uniforms for Australian private schools are generally stricter and more formal than in government schools - for example, a compulsory blazer. Private schools in Australia are always more expensive than their public counterparts.[citation needed]", "questions": [{"question": "What power is available to Australian private schools but generally not present in public schools?", "is_impossible": false}, {"question": "What is an example of an article of uniform clothing typically present in Australian private schools?", "is_impossible": false}, {"question": "What is the comparison in price between Australian private schools versus public?", "is_impossible": false}, {"question": "What kind of status comes with going to a public school in Australia?", "is_impossible": true}, {"question": "How well are teachers paid in public schools in Australia?", "is_impossible": true}, {"question": "What kind of education is offered in public schools in Australia?", "is_impossible": true}, {"question": "What tool do they use in public school to maintain discipline?", "is_impossible": true}, {"question": "What part of a uniform must you wear if you go to public school in Australia?", "is_impossible": true}]}, {"id": "20_6", "context": "Although most are non-aligned, some of the best known independent schools also belong to the large, long-established religious foundations, such as the Anglican Church, Uniting Church and Presbyterian Church, but in most cases, they do not insist on their students’ religious allegiance. These schools are typically viewed as 'elite schools'. Many of the 'grammar schools' also fall in this category. They are usually expensive schools that tend to be up-market and traditional in style, some Catholic schools fall into this category as well, e.g. St Joseph's College, Gregory Terrace, Saint Ignatius' College, Riverview, St Gregory's College, Campbelltown, St Aloysius' College (Sydney) and St Joseph's College, Hunters Hill, as well as Loreto Kirribilli, Monte Sant Angelo Mercy College, St Ursula's College and Loreto Normanhurst for girls.", "questions": [{"question": "Along with the Anglican Church and Uniting Church, what religious denomination operates private schools in Australia?", "is_impossible": false}, {"question": "What denomination operates St Joseph's College?", "is_impossible": false}, {"question": "Where is St Aloysius' College located?", "is_impossible": false}, {"question": "Who attends Loreto Normanhurst?", "is_impossible": false}, {"question": "What denomination insists that students must also be a member of the founding church?", "is_impossible": true}, {"question": "What category do all Catholic schools fall into?", "is_impossible": true}, {"question": "Where is St. Gregory's College located?", "is_impossible": true}, {"question": "What three churches have colleges in Sydney?", "is_impossible": true}, {"question": "What do all grammar schools insist their students have in order to attend?", "is_impossible": true}]}, {"id": "20_7", "context": "The right to create private schools in Germany is in Article 7, Paragraph 4 of the Grundgesetz and cannot be suspended even in a state of emergency. It is also not possible to abolish these rights. This unusual protection of private schools was implemented to protect these schools from a second Gleichschaltung or similar event in the future. Still, they are less common than in many other countries. Overall, between 1992 and 2008 the percent of pupils in such schools in Germany increased from 6.1% to 7.8% (including rise from 0.5% to 6.1% in the former GDR). Percent of students in private high schools reached 11.1%.", "questions": [{"question": "What article of the Grundgesetz grants the right to make private schools?", "is_impossible": false}, {"question": "The prospect of what event compelled the protection of German private schools?", "is_impossible": false}, {"question": "What percentage of German students attended private schools in 2008?", "is_impossible": false}, {"question": "What was the percentage of Germans attending private high schools in 2008?", "is_impossible": false}, {"question": "In 1992, what percentage of East German students attended private schools?", "is_impossible": false}, {"question": "In what article does it give Gleichschaltung the right to create private schools?", "is_impossible": true}, {"question": "When can the right to create private schools be taken away in other countries?", "is_impossible": true}, {"question": "Why was the protection of private schools implemented in 1992?", "is_impossible": true}, {"question": "What percentage of students in Grundgesetz attended private schools in 2008?", "is_impossible": true}, {"question": "What percentage of students attended private schools in Grundgesetz in 1992?", "is_impossible": true}]}, {"id": "20_8", "context": "Ersatzschulen are ordinary primary or secondary schools, which are run by private individuals, private organizations or religious groups. These schools offer the same types of diplomas as public schools. Ersatzschulen lack the freedom to operate completely outside of government regulation. Teachers at Ersatzschulen must have at least the same education and at least the same wages as teachers at public schools, an Ersatzschule must have at least the same academic standards as a public school and Article 7, Paragraph 4 of the Grundgesetz, also forbids segregation of pupils according to the means of their parents (the so-called Sonderungsverbot). Therefore, most Ersatzschulen have very low tuition fees and/or offer scholarships, compared to most other Western European countries. However, it is not possible to finance these schools with such low tuition fees, which is why all German Ersatzschulen are additionally financed with public funds. The percentages of public money could reach 100% of the personnel expenditures. Nevertheless, Private Schools became insolvent in the past in Germany.", "questions": [{"question": "What is the German term for segregating students based on their parents' wealth?", "is_impossible": false}, {"question": "What do Germans call private schools?", "is_impossible": false}, {"question": "How does the level of tuition in German private schools compare to private schools in other Western European countries?", "is_impossible": false}, {"question": "Who runs the Sonderungsverbot?", "is_impossible": true}, {"question": "What kind of school is a Sonderungsverbot?", "is_impossible": true}, {"question": "What kind of diploma is given when graduating from a Sonderungsverbot?", "is_impossible": true}, {"question": "What do Sonderungsverbot not have when trying to operate without regulation?", "is_impossible": true}, {"question": "What kind of tuition is charged if you enroll in a Sonderungsverbot?", "is_impossible": true}]}, {"id": "20_9", "context": "Ergänzungsschulen are secondary or post-secondary (non-tertiary) schools, which are run by private individuals, private organizations or rarely, religious groups and offer a type of education which is not available at public schools. Most of these schools are vocational schools. However, these vocational schools are not part of the German dual education system. Ergänzungsschulen have the freedom to operate outside of government regulation and are funded in whole by charging their students tuition fees.", "questions": [{"question": "What are private secondary schools in Germany called?", "is_impossible": false}, {"question": "What types of schools are most ergänzungsschulen?", "is_impossible": false}, {"question": "How are ergänzungsschulen funded?", "is_impossible": false}, {"question": "Along with private individuals and organizations, what groups sometimes runs ergänzungsschulen?", "is_impossible": false}, {"question": "What are public schools called in Germany?", "is_impossible": true}, {"question": "What are most public schools not a part of?", "is_impossible": true}, {"question": "What do public schools operate outside of in Germany?", "is_impossible": true}, {"question": "How are public schools funded?", "is_impossible": true}, {"question": "What group will rarely run a public school?", "is_impossible": true}]}, {"id": "20_10", "context": "In India, private schools are called independent schools, but since some private schools receive financial aid from the government, it can be an aided or an unaided school. So, in a strict sense, a private school is an unaided independent school. For the purpose of this definition, only receipt of financial aid is considered, not land purchased from the government at a subsidized rate. It is within the power of both the union government and the state governments to govern schools since Education appears in the Concurrent list of legislative subjects in the constitution. The practice has been for the union government to provide the broad policy directions while the states create their own rules and regulations for the administration of the sector. Among other things, this has also resulted in 30 different Examination Boards or academic authorities that conduct examinations for school leaving certificates. Prominent Examination Boards that are present in multiple states are the CBSE and the CISCE, NENBSE", "questions": [{"question": "What is the term for an Indian private school?", "is_impossible": false}, {"question": "Along with the CISCE and NENBSE, what is a notable Examination Board in multiple Indian states?", "is_impossible": false}, {"question": "How many Examination Boards exist in India?", "is_impossible": false}, {"question": "What body in India provides policy directions to schools?", "is_impossible": false}, {"question": "What are government schools also called in India?", "is_impossible": true}, {"question": "What two categories can a government school be put into in India?", "is_impossible": true}, {"question": "What do the CBSE and the CISCe both have the power to govern?", "is_impossible": true}, {"question": "How many independent schools are in India?", "is_impossible": true}, {"question": "For what certificate does the legislature conduct examinations?", "is_impossible": true}]}, {"id": "20_11", "context": "Legally, only non-profit trusts and societies can run schools in India. They will have to satisfy a number of infrastructure and human resource related criteria to get Recognition (a form of license) from the government. Critics of this system point out that this leads to corruption by school inspectors who check compliance and to fewer schools in a country that has the largest adult illiterate population in the world. While official data does not capture the real extent of private schooling in the country, various studies have reported unpopularity of government schools and an increasing number of private schools. The Annual Status of Education Report (ASER), which evaluates learning levels in rural India, has been reporting poorer academic achievement in government schools than in private schools. A key difference between the government and private schools is that the medium of education in private schools is English while it is the local language in government schools.", "questions": [{"question": "Along with trusts, what other non-profits are allowed to run schools in India?", "is_impossible": false}, {"question": "What country has the most illiterate adults in the world?", "is_impossible": false}, {"question": "What is the full name of the ASER?", "is_impossible": false}, {"question": "What is the purpose of the ASER?", "is_impossible": false}, {"question": "In private schools, what language are classes taught in?", "is_impossible": false}, {"question": "Who can legally teach English in India?", "is_impossible": true}, {"question": "What do government schools have to do to be able to teach English?", "is_impossible": true}, {"question": "What is happening to the number of government schools in rural India?", "is_impossible": true}, {"question": "What did the ASER report show about how people feel about private schools?", "is_impossible": true}, {"question": "What does poor academic achievement lead to according to critics?", "is_impossible": true}]}, {"id": "20_12", "context": "In Ireland, private schools (Irish: scoil phríobháideach) are unusual because a certain number of teacher's salaries are paid by the State. If the school wishes to employ extra teachers they are paid for with school fees, which tend to be relatively low in Ireland compared to the rest of the world. There is, however, a limited element of state assessment of private schools, because of the requirement that the state ensure that children receive a certain minimum education; Irish private schools must still work towards the Junior Certificate and the Leaving Certificate, for example. Many private schools in Ireland also double as boarding schools. The average fee is around €5,000 annually for most schools, but some of these schools also provide boarding and the fees may then rise up to €25,000 per year. The fee-paying schools are usually run by a religious order, i.e., the Society of Jesus or Congregation of Christian Brothers, etc.", "questions": [{"question": "What is the Irish term for private schools?", "is_impossible": false}, {"question": "How do private schools in Ireland differ from most?", "is_impossible": false}, {"question": "What is the typical annual cost for an Irish private school?", "is_impossible": false}, {"question": "Along with the Congregation of Christian Brothers, what is a notable religious group that runs fee-paying schools in Ireland?", "is_impossible": false}, {"question": "What might the fees to attend an Irish boarding school rise to?", "is_impossible": false}, {"question": "What is the Irish term for school fees?", "is_impossible": true}, {"question": "How do private schools in the rest of the world differ from Ireland?", "is_impossible": true}, {"question": "How are school fees in the rest of the world compared to Ireland?", "is_impossible": true}, {"question": "What certificates must private schools worldwide work towards?", "is_impossible": true}, {"question": "What is the average private school fee worldwide?", "is_impossible": true}]}, {"id": "20_13", "context": "After Malaysia's independence in 1957, the government instructed all schools to surrender their properties and be assimilated into the National School system. This caused an uproar among the Chinese and a compromise was achieved in that the schools would instead become \"National Type\" schools. Under such a system, the government is only in charge of the school curriculum and teaching personnel while the lands still belonged to the schools. While Chinese primary schools were allowed to retain Chinese as the medium of instruction, Chinese secondary schools are required to change into English-medium schools. Over 60 schools converted to become National Type schools.", "questions": [{"question": "In what year did Malaysia receive its independence?", "is_impossible": false}, {"question": "What language is used in Chinese primary schools in Malaysia?", "is_impossible": false}, {"question": "What language is used in Chinese secondary schools in Malaysia?", "is_impossible": false}, {"question": "What is the name of the post-independence government school system in Malaysia?", "is_impossible": false}, {"question": "As a result of a compromise, about how many Chinese schools became National Type schools?", "is_impossible": false}, {"question": "In what year did China institute English-medium schools?", "is_impossible": true}, {"question": "How many people protested the school assimilation program in Malaysia?", "is_impossible": true}, {"question": "What happened to schools after Chinese independence in 1957?", "is_impossible": true}, {"question": "What type of schools would they have in China as a compromise after Chinese independence?", "is_impossible": true}, {"question": "Who did the lands belong to in China after the school compromise?", "is_impossible": true}]}, {"id": "20_14", "context": "The other category of schools are those run and partly or fully funded by private individuals, private organizations and religious groups. The ones that accept government funds are called 'aided' schools. The private 'un-aided' schools are fully funded by private parties. The standard and the quality of education is quite high. Technically, these would be categorized as private schools, but many of them have the name \"Public School\" appended to them, e.g., the Galaxy Public School in Kathmandu. Most of the middle-class families send their children to such schools, which might be in their own city or far off, like boarding schools. The medium of education is English, but as a compulsory subject, Nepali and/or the state's official language is also taught. Preschool education is mostly limited to organized neighbourhood nursery schools.", "questions": [{"question": "What is a term for schools that receive government assistance?", "is_impossible": false}, {"question": "How are 'un-aided' schools different from 'aided' schools?", "is_impossible": false}, {"question": "Where is Galaxy Public School located?", "is_impossible": false}, {"question": "In Nepalese private schools, what is the primary language of instruction?", "is_impossible": false}, {"question": "In addition to English, what language is also often taught in Nepalese private schools?", "is_impossible": false}, {"question": "What type of familiy sends their children to preschool?", "is_impossible": true}, {"question": "What is the standard of living for most families in Kathmandu?", "is_impossible": true}, {"question": "What name is typically associated with preschool?", "is_impossible": true}, {"question": "What are boarding schools that teach English called?", "is_impossible": true}, {"question": "What group fully funds preschool?", "is_impossible": true}]}, {"id": "20_15", "context": "As of April 2014, there are 88 private schools in New Zealand, catering for around 28,000 students or 3.7% of the entire student population. Private school numbers have been in decline since the mid-1970s as a result of many private schools opting to become state-integrated schools, mostly due of financial difficulties stemming from changes in student numbers and/or the economy. State-integrated schools keep their private school special character and receives state funds in return for having to operate like a state school, e.g. they must teach the state curriculum, they must employ registered teachers, and they can't charge tuition fees (they can charge \"attendance dues\" for the upkeep on the still-private school land and buildings). The largest decline in private school numbers occurred between 1979 and 1984, when the nation's then-private Catholic school system integrated. As a result, private schools in New Zealand are now largely restricted to the largest cities (Auckland, Hamilton, Wellington and Christchurch) and niche markets.", "questions": [{"question": "How many private schools existed in New Zealand in April 2014?", "is_impossible": false}, {"question": "In April 2014, how many New Zealand students attended private schools?", "is_impossible": false}, {"question": "What percentage of New Zealand students attended private schools in April 2014?", "is_impossible": false}, {"question": "What religion's schools were integrated into New Zealand public schools between 1979 and 1984?", "is_impossible": false}, {"question": "What city, along with Hamilton, Wellington and Christchurch, is one of the largest in New Zealand?", "is_impossible": false}, {"question": "As of 1970, how many private schools were in New Zealand?", "is_impossible": true}, {"question": "How many private school students were there in 1979?", "is_impossible": true}, {"question": "How much of the student population went to private schools in 1984?", "is_impossible": true}, {"question": "What has happened to private school numbers since 2014?", "is_impossible": true}, {"question": "Why have private schools been in decline since 2014?", "is_impossible": true}]}, {"id": "20_16", "context": "Private schools are often Anglican, such as King's College and Diocesan School for Girls in Auckland, St Paul's Collegiate School in Hamilton, St Peter's School in Cambridge, Samuel Marsden Collegiate School in Wellington, and Christ's College and St Margaret's College in Christchurch; or Presbyterian, such as Saint Kentigern College and St Cuthbert's College in Auckland, Scots College and Queen Margaret College in Wellington, and St Andrew's College and Rangi Ruru Girls' School in Christchurch. Academic Colleges Group is a recent group of private schools run as a business, with schools throughout Auckland, including ACG Senior College in Auckland’s CBD, ACG Parnell College in Parnell, and international school ACG New Zealand International College. There are three private schools (including the secondary school, St Dominic's College) operated by the Catholic schismatic group, the Society of St Pius X in Wanganui.", "questions": [{"question": "What denomination is the Diocesan School for Girls in Auckland affiliated with?", "is_impossible": false}, {"question": "Where is Samuel Marsden Collegiate School located?", "is_impossible": false}, {"question": "What denomination is associated with Saint Kentigern College?", "is_impossible": false}, {"question": "In what city is Rangi Ruru Girls' School?", "is_impossible": false}, {"question": "What group operates St Dominic's College in Wanganui?", "is_impossible": false}, {"question": "How is St Andrew's College run?", "is_impossible": true}, {"question": "What is operated by Academic Colleges Group in Wanganui?", "is_impossible": true}, {"question": "What Catholic society in Wanganui is affiliated with Academic Colleges Group?", "is_impossible": true}, {"question": "What denomination are the schools run by Academic Colleges Group?", "is_impossible": true}, {"question": "How many affiliates are connected to the ACG New Zealand International College?", "is_impossible": true}]}, {"id": "20_17", "context": "In the Philippines, the private sector has been a major provider of educational services, accounting for about 7.5% of primary enrollment, 32% of secondary enrollment and about 80% of tertiary enrollment. Private schools have proven to be efficient in resource utilization. Per unit costs in private schools are generally lower when compared to public schools. This situation is more evident at the tertiary level. Government regulations have given private education more flexibility and autonomy in recent years, notably by lifting the moratorium on applications for new courses, new schools and conversions, by liberalizing tuition fee policy for private schools, by replacing values education for third and fourth years with English, mathematics and natural science at the option of the school, and by issuing the revised Manual of Regulations for Private Schools in August 1992.", "questions": [{"question": "What percentage of Filipino primary school students are in private schools?", "is_impossible": false}, {"question": "In the Philippines, what percentage of secondary school students attend private schools?", "is_impossible": false}, {"question": "What percentage of Filipino tertiary education takes place in private schools?", "is_impossible": false}, {"question": "In what month and year was the revised Manual of Regulations for Private Schools released?", "is_impossible": false}, {"question": "Along with English and mathematics, what subject replaced values education for fourth year students?", "is_impossible": false}, {"question": "What percentage of students enroll in public primary school in the Philippines?", "is_impossible": true}, {"question": "What is lower in public schools rather than private ones?", "is_impossible": true}, {"question": "What have government regulations given public schools recently?", "is_impossible": true}, {"question": "When did the Philippines start teaching English at the primary level in public school?", "is_impossible": true}]}, {"id": "20_18", "context": "The Education Service Contracting scheme of the government provides financial assistance for tuition and other school fees of students turned away from public high schools because of enrollment overflows. The Tuition Fee Supplement is geared to students enrolled in priority courses in post-secondary and non-degree programmes, including vocational and technical courses. The Private Education Student Financial Assistance is made available to underprivileged, but deserving high school graduates, who wish to pursue college/technical education in private colleges and universities.", "questions": [{"question": "What is the name of the scheme that provides tuition and fee assistance to students due to excess enrollment?", "is_impossible": false}, {"question": "What stipend do students enrolled in priority courses receive?", "is_impossible": false}, {"question": "What aid is available to underprivileged students seeking to attend a private university?", "is_impossible": false}, {"question": "Why would students be turned away from non-degree programmes?", "is_impossible": true}, {"question": "How does The Tuition Fee Suppliment help high school students?", "is_impossible": true}, {"question": "What does The Private Education Student Financial Assistance help current high school students who are turned away do?", "is_impossible": true}, {"question": "What program provides financial assistance for tuition and fees for a college or technical education?", "is_impossible": true}, {"question": "What does the government provide for students turned away from priority courses?", "is_impossible": true}]}, {"id": "20_19", "context": "Some of the oldest schools in South Africa are private church schools that were established by missionaries in the early nineteenth century. The private sector has grown ever since. After the abolition of apartheid, the laws governing private education in South Africa changed significantly. The South African Schools Act of 1996 recognises two categories of schools: \"public\" (state-controlled) and \"independent\" (which includes traditional private schools and schools which are privately governed[clarification needed].)", "questions": [{"question": "What South African law recognized two types of schools?", "is_impossible": false}, {"question": "In what year was the South African Schools Act passed?", "is_impossible": false}, {"question": "Along with public schools, what type of school was recognized under the South African Schools Act?", "is_impossible": false}, {"question": "In South Africa, along with privately governed schools, what schools are classified as independent?", "is_impossible": false}, {"question": "In what century did missionaries notably establish church schools in South Africa?", "is_impossible": false}, {"question": "In what century was apartheid abolished?", "is_impossible": true}, {"question": "What did missionaries cause to become law in 1996?", "is_impossible": true}, {"question": "How did Africa becoming independent change the laws about missionaries coming to Africa?", "is_impossible": true}, {"question": "In what century was South Africa established as a country?", "is_impossible": true}, {"question": "What has happened to the public education sector when managed by the government?", "is_impossible": true}]}, {"id": "20_20", "context": "In the final years of the apartheid era, parents at white government schools were given the option to convert to a \"semi-private\" form called Model C, and many of these schools changed their admissions policies to accept children of other races. Following the transition to democracy, the legal form of \"Model C\" was abolished, however, the term continues to be used to describe government schools formerly reserved for white children.. These schools tend to produce better academic results than government schools formerly reserved for other race groups . Former \"Model C\" schools are not private schools, as they are state-controlled. All schools in South Africa (including both independent schools and public schools) have the right to set compulsory school fees, and formerly model C schools tend to set much higher school fees than other public schools.", "questions": [{"question": "After apartheid, what types of schools are referred to as \"Model C\" schools?", "is_impossible": false}, {"question": "How do academic results in former Model C schools compare to other schools?", "is_impossible": false}, {"question": "How do the fees at former Model C schools compare to those at other schools?", "is_impossible": false}, {"question": "What school option were parents of minority children given to convert to?", "is_impossible": true}, {"question": "What was abolished during the apartheid era?", "is_impossible": true}, {"question": "What term is used for schools who accept only black children?", "is_impossible": true}, {"question": "What kind of acedemic results do schools that only accept black children produce?", "is_impossible": true}, {"question": "What do only white children have to pay when they go to school?", "is_impossible": true}]}, {"id": "20_21", "context": "In Sweden, pupils are free to choose a private school and the private school gets paid the same amount as municipal schools. Over 10% of Swedish pupils were enrolled in private schools in 2008. Sweden is internationally known for this innovative school voucher model that provides Swedish pupils with the opportunity to choose the school they prefer. For instance, the biggest school chain, Kunskapsskolan (“The Knowledge School”), offers 30 schools and a web-based environment, has 700 employees and teaches nearly 10,000 pupils. The Swedish system has been recommended to Barack Obama.", "questions": [{"question": "As of 2008, about what percentage of Swedish students attended private schools?", "is_impossible": false}, {"question": "About many students attend Kunskapsskolan schools?", "is_impossible": false}, {"question": "How many people work for Kunskapsskolan schools?", "is_impossible": false}, {"question": "What is the English translation of Kunskapsskolan?", "is_impossible": false}, {"question": "What school model is Sweden notable for?", "is_impossible": false}, {"question": "How many Swedish students were enrolled in public school in 2008?", "is_impossible": true}, {"question": "How many people have worked with Barack Obama who are from Sweden?", "is_impossible": true}, {"question": "What is the Swedish word for school voucher?", "is_impossible": true}, {"question": "What opportunity did Barack Obama support for Swedish children?", "is_impossible": true}, {"question": "How many school vouchers were issued by Sweden in 2008?", "is_impossible": true}]}, {"id": "20_22", "context": "Private schools generally prefer to be called independent schools, because of their freedom to operate outside of government and local government control. Some of these are also known as public schools. Preparatory schools in the UK prepare pupils aged up to 13 years old to enter public schools. The name \"public school\" is based on the fact that the schools were open to pupils from anywhere, and not merely to those from a certain locality, and of any religion or occupation. According to The Good Schools Guide approximately 9 per cent of children being educated in the UK are doing so at fee-paying schools at GSCE level and 13 per cent at A-level.[citation needed] Many independent schools are single-sex (though this is becoming less common). Fees range from under £3,000 to £21,000 and above per year for day pupils, rising to £27,000+ per year for boarders. For details in Scotland, see \"Meeting the Cost\".", "questions": [{"question": "Up to what age do students in the United Kingdom attend preparatory schools?", "is_impossible": false}, {"question": "What schools do preparatory schools prepare British children to attend?", "is_impossible": false}, {"question": "What percentage of British children are educated at GSCE level in fee-paying schools?", "is_impossible": false}, {"question": "At A-level, what percentage of British students attend fee-paying schools?", "is_impossible": false}, {"question": "What is the upper range of annual fees for non-boarding students in British public schools?", "is_impossible": false}, {"question": "Who do preparatory schools in Scotland prepare to enter public schools?", "is_impossible": true}, {"question": "What percentage of children educated in Scotland are at independent schools?", "is_impossible": true}, {"question": "At what level are 13% of children in Scottish independent schools?", "is_impossible": true}, {"question": "What type of school is becoming less common in Scotland?", "is_impossible": true}, {"question": "What is the highest range a student would pay when boarding  in a Scottish school?", "is_impossible": true}]}, {"id": "20_23", "context": "In many parts of the United States, after the 1954 decision in the landmark court case Brown v. Board of Education of Topeka that demanded United States schools desegregate \"with all deliberate speed\", local families organized a wave of private \"Christian academies\". In much of the U.S. South, many white students migrated to the academies, while public schools became in turn more heavily concentrated with African-American students (see List of private schools in Mississippi). The academic content of the academies was usually College Preparatory. Since the 1970s, many of these \"segregation academies\" have shut down, although some continue to operate.[citation needed]", "questions": [{"question": "What court case desegregated schools in the United States?", "is_impossible": false}, {"question": "What is a derogatory term for the Christian academies that arose in the wake of school desegregation?", "is_impossible": false}, {"question": "In what part of the United States did many students migrate to Christian academies during the desegregation period?", "is_impossible": false}, {"question": "What was the primary race of students attending Christian academies after the Brown decision?", "is_impossible": false}, {"question": "School desegregation in the United States led to an increased number of students of what ethnicity in public schools?", "is_impossible": false}, {"question": "What court case desegregated schools in 1970?", "is_impossible": true}, {"question": "How quickly were Christian academies supposed to be segregated?", "is_impossible": true}, {"question": "What was organized by local families before the Supreme Court case went to court?", "is_impossible": true}, {"question": "What kind of curriculum did public schools focus on for white students?", "is_impossible": true}, {"question": "Numbers of what race of students increased in public schools before 1954?", "is_impossible": true}]}, {"id": "20_24", "context": "Funding for private schools is generally provided through student tuition, endowments, scholarship/voucher funds, and donations and grants from religious organizations or private individuals. Government funding for religious schools is either subject to restrictions or possibly forbidden, according to the courts' interpretation of the Establishment Clause of the First Amendment or individual state Blaine Amendments. Non-religious private schools theoretically could qualify for such funding without hassle, preferring the advantages of independent control of their student admissions and course content instead of the public funding they could get with charter status.", "questions": [{"question": "Along with tuition, scholarships, vouchers, donations and grants, where does funding for private schools come from?", "is_impossible": false}, {"question": "What amendment to the United States Constitution governs government funding of religious schools?", "is_impossible": false}, {"question": "What state constitutional amendments make reference to the government funding religious schools?", "is_impossible": false}, {"question": "Granting what status would allow private non-religious schools in the US to receive public funds?", "is_impossible": false}, {"question": "What body would determine that funding for course content is forbidden?", "is_impossible": true}, {"question": "What is course content funding subject to?", "is_impossible": true}, {"question": "Why would course content funding be restricted by the courts?", "is_impossible": true}, {"question": "What can be interpreted by individuals to determine if funding for course content is forbidden?", "is_impossible": true}, {"question": "How is course content provided to a private school?", "is_impossible": true}]}, {"id": "20_25", "context": "Private schooling in the United States has been debated by educators, lawmakers and parents, since the beginnings of compulsory education in Massachusetts in 1852. The Supreme Court precedent appears to favor educational choice, so long as states may set standards for educational accomplishment. Some of the most relevant Supreme Court case law on this is as follows: Runyon v. McCrary, 427 U.S. 160 (1976); Wisconsin v. Yoder, 406 U.S. 205 (1972); Pierce v. Society of Sisters, 268 U.S. 510 (1925); Meyer v. Nebraska, 262 U.S. 390 (1923).", "questions": [{"question": "What was the first US state to have compulsory education?", "is_impossible": false}, {"question": "In what year did Massachusetts first require children to be educated in schools?", "is_impossible": false}, {"question": "In what year was Wisconsin v. Yoder decided at the Supreme Court?", "is_impossible": false}, {"question": "What is the citation for the Pierce v. Society of Sisters case?", "is_impossible": false}, {"question": "Who was the opposing party in the Runyon case?", "is_impossible": false}, {"question": "What became compulsory in Massachusetts in 1976?", "is_impossible": true}, {"question": "What was the first state to have set educational standards?", "is_impossible": true}, {"question": "Educators support educational choice as long as what happens?", "is_impossible": true}, {"question": "Who was part of the case with Wisconsin in 1976?", "is_impossible": true}, {"question": "What other person was involved in the case with Runyon in 1972?", "is_impossible": true}]}, {"id": "20_26", "context": "As of 2012, quality private schools in the United States charged substantial tuition, close to $40,000 annually for day schools in New York City, and nearly $50,000 for boarding schools. However, tuition did not cover operating expenses, particularly at boarding schools. The leading schools such as the Groton School had substantial endowments running to hundreds of millions of dollars supplemented by fundraising drives. Boarding schools with a reputation for quality in the United States have a student body drawn from throughout the country, indeed the globe, and a list of applicants which far exceeds their capacity.", "questions": [{"question": "About how much did a New York City day school cost annually in 2012?", "is_impossible": false}, {"question": "What would a parent have to pay to send their child to a boarding school in 2012?", "is_impossible": false}, {"question": "What notable private school has an endowment of several hundred million dollars?", "is_impossible": false}, {"question": "In addition to endowments and tuition, how do boarding schools cover their operating costs?", "is_impossible": false}, {"question": "How much did the Groton School charge per student for tuition in 2012?", "is_impossible": true}, {"question": "Where do most students at the Groton School come from?", "is_impossible": true}, {"question": "How many applicants does the Groton School have each year?", "is_impossible": true}, {"question": "In what city is the Groton School located?", "is_impossible": true}, {"question": "What were the operating expenses of the Groton School in 2012?", "is_impossible": true}]}]}
