{"data": [{"id": "21_1", "context": "Established originally by the Massachusetts legislature and soon thereafter named for John Harvard (its first benefactor), Harvard is the United States' oldest institution of higher learning, and the Harvard Corporation (formally, the President and Fellows of Harvard College) is its first chartered corporation. Although never formally affiliated with any denomination, the early College primarily trained Congregationalist and Unitarian clergy. Its curriculum and student body were gradually secularized during the 18th century, and by the 19th century Harvard had emerged as the central cultural establishment among Boston elites. Following the American Civil War, President Charles W. Eliot's long tenure (1869–1909) transformed the college and affiliated professional schools into a modern research university; Harvard was a founding member of the Association of American Universities in 1900. James Bryant Conant led the university through the Great Depression and World War II and began to reform the curriculum and liberalize admissions after the war. The undergraduate college became coeducational after its 1977 merger with Radcliffe College.", "questions": [{"question": "What individual is the school named after?", "is_impossible": false}, {"question": "When did the undergraduate program become coeducational?", "is_impossible": false}, {"question": "What was the name of the leader through the Great Depression and World War II?", "is_impossible": false}, {"question": "What organization did Harvard found in 1900?", "is_impossible": false}, {"question": "What president of the university transformed it into a modern research university?", "is_impossible": false}, {"question": "What distinction does Radcliffe College have among universities?", "is_impossible": true}, {"question": "Who went to Radcliffe and was trained there as students in its early days?", "is_impossible": true}, {"question": "When was Radcliffe's curriculum secularized?", "is_impossible": true}, {"question": "What had Radcliffe been transformed into by the 19th century?", "is_impossible": true}, {"question": "Who was President of Radcliffe from 1869-1909?", "is_impossible": true}]}, {"id": "21_2", "context": "Harvard is a large, highly residential research university. The nominal cost of attendance is high, but the University's large endowment allows it to offer generous financial aid packages. It operates several arts, cultural, and scientific museums, alongside the Harvard Library, which is the world's largest academic and private library system, comprising 79 individual libraries with over 18 million volumes. Harvard's alumni include eight U.S. presidents, several foreign heads of state, 62 living billionaires, 335 Rhodes Scholars, and 242 Marshall Scholars. To date, some 150 Nobel laureates, 18 Fields Medalists and 13 Turing Award winners have been affiliated as students, faculty, or staff.", "questions": [{"question": "What is the worlds largest academic and private library system?", "is_impossible": false}, {"question": "How many individual libraries make up the main school library?", "is_impossible": false}, {"question": "How many volumes are contained in the library?", "is_impossible": false}, {"question": "How many US presidents are alumni of the school?", "is_impossible": false}, {"question": "How many Nobel Laureates are among the school alumni?", "is_impossible": false}, {"question": "What is the cost of living near Harvard?", "is_impossible": true}, {"question": "Where can tourists go when they visit Cambridge?", "is_impossible": true}, {"question": "How many public libraries are there in Cambridge?", "is_impossible": true}, {"question": "How many US Presidents once campaigned in Cambridge?", "is_impossible": true}, {"question": "How many billionaires are now living in Cambridge?", "is_impossible": true}]}, {"id": "21_3", "context": "The University is organized into eleven separate academic units—ten faculties and the Radcliffe Institute for Advanced Study—with campuses throughout the Boston metropolitan area: its 209-acre (85 ha) main campus is centered on Harvard Yard in Cambridge, approximately 3 miles (5 km) northwest of Boston; the business school and athletics facilities, including Harvard Stadium, are located across the Charles River in the Allston neighborhood of Boston and the medical, dental, and public health schools are in the Longwood Medical Area. Harvard's $37.6 billion financial endowment is the largest of any academic institution.", "questions": [{"question": "What is the major US city that the is the university located?", "is_impossible": false}, {"question": "What is the size of the school's endowment?", "is_impossible": false}, {"question": "What river is located in the vicinity of the school?", "is_impossible": false}, {"question": "How many academic units make up the school?", "is_impossible": false}, {"question": "What is the name of the area that the main campus is centered in Cambridge?", "is_impossible": false}, {"question": "How much did it cost to build Harvard Stadium?", "is_impossible": true}, {"question": "How many academic units make up Radcliffe?", "is_impossible": true}, {"question": "How large is the Allston neighborhood in Boston?", "is_impossible": true}, {"question": "Where is the Longwood Medical area located?", "is_impossible": true}, {"question": "How many sports are played at the athletics facilites?", "is_impossible": true}]}, {"id": "21_4", "context": "Harvard was formed in 1636 by vote of the Great and General Court of the Massachusetts Bay Colony. It was initially called \"New College\" or \"the college at New Towne\". In 1638, the college became home for North America's first known printing press, carried by the ship John of London. In 1639, the college was renamed Harvard College after deceased clergyman John Harvard, who was an alumnus of the University of Cambridge. He had left the school £779 and his library of some 400 books. The charter creating the Harvard Corporation was granted in 1650.", "questions": [{"question": "In what year was the school formed?", "is_impossible": false}, {"question": "What organization arranged to founding of school?", "is_impossible": false}, {"question": "What year was North America's first printing press started?", "is_impossible": false}, {"question": "In what year was the school renamed as Harvard College?", "is_impossible": false}, {"question": "In what year was the charter granted for Harvard Corporation?", "is_impossible": false}, {"question": "What was the ship of John of London called?", "is_impossible": true}, {"question": "What did the Court of the Massachusetts Bay Colony vote for John Harvard to have in 1650?", "is_impossible": true}, {"question": "Who founded Cambridge in 1650?", "is_impossible": true}, {"question": "When did John of London come to live in Cambridge?", "is_impossible": true}, {"question": "What university was John of London an alum of?", "is_impossible": true}]}, {"id": "21_5", "context": "In the early years the College trained many Puritan ministers.[citation needed] (A 1643 publication said the school's purpose was \"to advance learning and perpetuate it to posterity, dreading to leave an illiterate ministry to the churches when our present ministers shall lie in the dust\".) It offered a classic curriculum on the English university model—​​many leaders in the colony had attended the University of Cambridge—​​but conformed Puritanism. It was never affiliated with any particular denomination, but many of its earliest graduates went on to become clergymen in Congregational and Unitarian churches.", "questions": [{"question": "Ministers of what faith were trained by the university in early years?", "is_impossible": false}, {"question": "After what higher learning model was the school designed?", "is_impossible": false}, {"question": "Was the school officially associated with any denomination?", "is_impossible": false}, {"question": "What group was trained at Cambridge in 1643?", "is_impossible": true}, {"question": "In what year was Cambridge founded?", "is_impossible": true}, {"question": "What was the purpose of Cambridge when it was founded in 1643?", "is_impossible": true}, {"question": "What profession did many graduates of Cambridge become in 1643?", "is_impossible": true}, {"question": "What churches were the graduates of Cambridge affiliated with after 1643?", "is_impossible": true}]}, {"id": "21_6", "context": "Throughout the 18th century, Enlightenment ideas of the power of reason and free will became widespread among Congregationalist ministers, putting those ministers and their congregations in tension with more traditionalist, Calvinist parties.:1–4 When the Hollis Professor of Divinity David Tappan died in 1803 and the president of Harvard Joseph Willard died a year later, in 1804, a struggle broke out over their replacements. Henry Ware was elected to the chair in 1805, and the liberal Samuel Webber was appointed to the presidency of Harvard two years later, which signaled the changing of the tide from the dominance of traditional ideas at Harvard to the dominance of liberal, Arminian ideas (defined by traditionalists as Unitarian ideas).:4–5:24", "questions": [{"question": "In what year did Harvard President Joseph Willard die?", "is_impossible": false}, {"question": "What liberal succeeded Joseph Willard as president?", "is_impossible": false}, {"question": "In what year was Henry Ware elected to chair?", "is_impossible": false}, {"question": "In what year did Henry Ware die?", "is_impossible": true}, {"question": "What happened after Henry Ware and Samuel Webber died?", "is_impossible": true}, {"question": "In what year was David Tappan elected to the chair?", "is_impossible": true}, {"question": "When did Calvinist parties and traditional ideas come to dominate universities?", "is_impossible": true}, {"question": "What denomination was the Hollis Professor of Divinity connected to?", "is_impossible": true}]}, {"id": "21_7", "context": "In 1846, the natural history lectures of Louis Agassiz were acclaimed both in New York and on the campus at Harvard College. Agassiz's approach was distinctly idealist and posited Americans' \"participation in the Divine Nature\" and the possibility of understanding \"intellectual existences\". Agassiz's perspective on science combined observation with intuition and the assumption that a person can grasp the \"divine plan\" in all phenomena. When it came to explaining life-forms, Agassiz resorted to matters of shape based on a presumed archetype for his evidence. This dual view of knowledge was in concert with the teachings of Common Sense Realism derived from Scottish philosophers Thomas Reid and Dugald Stewart, whose works were part of the Harvard curriculum at the time. The popularity of Agassiz's efforts to \"soar with Plato\" probably also derived from other writings to which Harvard students were exposed, including Platonic treatises by Ralph Cudworth, John Norrisand, in a Romantic vein, Samuel Coleridge. The library records at Harvard reveal that the writings of Plato and his early modern and Romantic followers were almost as regularly read during the 19th century as those of the \"official philosophy\" of the more empirical and more deistic Scottish school.", "questions": [{"question": "in 1846 who's natural history lectures were acclaimed in New York and Harvard?", "is_impossible": false}, {"question": "Agassiz's approach to science combined observation and what?", "is_impossible": false}, {"question": "Common Sense Realism of what Scottish philosophers did Agassiz incorporate in his dual view of knowedge?", "is_impossible": false}, {"question": "Where were the writings of Plato acclaimed in 1846?", "is_impossible": true}, {"question": "What was Plato's approach considered?", "is_impossible": true}, {"question": "What did Plato's perspective on science combine?", "is_impossible": true}, {"question": "What was the assumption behind Plato's writings?", "is_impossible": true}, {"question": "What evidence did Plato use to explain life-forms?", "is_impossible": true}]}, {"id": "21_8", "context": "Charles W. Eliot, president 1869–1909, eliminated the favored position of Christianity from the curriculum while opening it to student self-direction. While Eliot was the most crucial figure in the secularization of American higher education, he was motivated not by a desire to secularize education, but by Transcendentalist Unitarian convictions. Derived from William Ellery Channing and Ralph Waldo Emerson, these convictions were focused on the dignity and worth of human nature, the right and ability of each person to perceive truth, and the indwelling God in each person.", "questions": [{"question": "What president eliminated the Christian position in the curriculum?", "is_impossible": false}, {"question": "What conviction motivated Eliot to move towards secularization?", "is_impossible": false}, {"question": "From whom were the movement that Eliot followed derived?", "is_impossible": false}, {"question": "During what years was William Ellery Channing President of Harvard?", "is_impossible": true}, {"question": "When Channing eliminated Christianity from its former position in the curriculum what was allowed instead?", "is_impossible": true}, {"question": "Channing was the most crucial figure to achieve what in US universities?", "is_impossible": true}, {"question": "What ideas motivated Channing to remove Christianity as dominant in college curriculum?", "is_impossible": true}, {"question": "What did Christianity in US curriculum focus on before it was changed?", "is_impossible": true}]}, {"id": "21_9", "context": "James Bryant Conant (president, 1933–1953) reinvigorated creative scholarship to guarantee its preeminence among research institutions. He saw higher education as a vehicle of opportunity for the talented rather than an entitlement for the wealthy, so Conant devised programs to identify, recruit, and support talented youth. In 1943, he asked the faculty make a definitive statement about what general education ought to be, at the secondary as well as the college level. The resulting Report, published in 1945, was one of the most influential manifestos in the history of American education in the 20th century.", "questions": [{"question": "Who lead the school back to leading research institution in 2oth century?", "is_impossible": false}, {"question": "How was the school able to bring aboard the best talented students?", "is_impossible": false}, {"question": "In what year of 20th century, did Harvard release an important document about education in America?", "is_impossible": false}, {"question": "Who had a main goal of attracting the wealthy to Harvard?", "is_impossible": true}, {"question": "What would it guarantee for Harvard if they attracted wealthy students?", "is_impossible": true}, {"question": "What was college considered a vehicle of for the wealthy in 1945?", "is_impossible": true}, {"question": "What did Conant develop to attract wealthy students to the school in 1933?", "is_impossible": true}, {"question": "What is one thing that wealthy students needed when they first came to Harvard in 1945?", "is_impossible": true}]}, {"id": "21_10", "context": "Women remained segregated at Radcliffe, though more and more took Harvard classes. Nonetheless, Harvard's undergraduate population remained predominantly male, with about four men attending Harvard College for every woman studying at Radcliffe. Following the merger of Harvard and Radcliffe admissions in 1977, the proportion of female undergraduates steadily increased, mirroring a trend throughout higher education in the United States. Harvard's graduate schools, which had accepted females and other groups in greater numbers even before the college, also became more diverse in the post-World War II period.", "questions": [{"question": "What was the ratio of men to women at Harvard/Radcliffe?", "is_impossible": false}, {"question": "In what year did Harvard and Radcliffe admissions merge?", "is_impossible": false}, {"question": "What was the trend of female student population from 1970s and deyond?", "is_impossible": false}, {"question": "During what period were women not banned from being admitted to Radcliffe?", "is_impossible": true}, {"question": "What college was founded during World War II?", "is_impossible": true}, {"question": "What happened to Radcliffe's graduate schools during WWII?", "is_impossible": true}, {"question": "During what period did Radcliffe become prominent as a university?", "is_impossible": true}, {"question": "How many campuses affiliated with Harvard existed in 1977?", "is_impossible": true}]}, {"id": "21_11", "context": "Harvard's 209-acre (85 ha) main campus is centered on Harvard Yard in Cambridge, about 3 miles (5 km) west-northwest of the State House in downtown Boston, and extends into the surrounding Harvard Square neighborhood. Harvard Yard itself contains the central administrative offices and main libraries of the university, academic buildings including Sever Hall and University Hall, Memorial Church, and the majority of the freshman dormitories. Sophomore, junior, and senior undergraduates live in twelve residential Houses, nine of which are south of Harvard Yard along or near the Charles River. The other three are located in a residential neighborhood half a mile northwest of the Yard at the Quadrangle (commonly referred to as the Quad), which formerly housed Radcliffe College students until Radcliffe merged its residential system with Harvard. Each residential house contains rooms for undergraduates, House masters, and resident tutors, as well as a dining hall and library. The facilities were made possible by a gift from Yale University alumnus Edward Harkness.", "questions": [{"question": "How far from state house in downtown Boston is Harvard Yard?", "is_impossible": false}, {"question": "How many residential dorms house upper class, sophomore, Jr, and Sr students?", "is_impossible": false}, {"question": "Along what geographic feature are nine residential houses located?", "is_impossible": false}, {"question": "How far from the Yard is the Quad located?", "is_impossible": false}, {"question": "How many acres of land is the State House situated on?", "is_impossible": true}, {"question": "What neighborhood is Edward Harkness formerly from?", "is_impossible": true}, {"question": "Who were formerly housed at Sever Hall?", "is_impossible": true}, {"question": "Why did Radcliffe College students stop residing at Sever Hall?", "is_impossible": true}, {"question": "Where is the office of Edward Harkness located?", "is_impossible": true}]}, {"id": "21_12", "context": "The Harvard Business School and many of the university's athletics facilities, including Harvard Stadium, are located on a 358-acre (145 ha) campus opposite the Cambridge campus in Allston. The John W. Weeks Bridge is a pedestrian bridge over the Charles River connecting both campuses. The Harvard Medical School, Harvard School of Dental Medicine, and the Harvard School of Public Health are located on a 21-acre (8.5 ha) campus in the Longwood Medical and Academic Area approximately 3.3 miles (5.3 km) southwest of downtown Boston and 3.3 miles (5.3 km) south of the Cambridge campus.", "questions": [{"question": "Where is Harvard stadium located?", "is_impossible": false}, {"question": "What is the name of the bridge that joins parts of the campus of the Charles River?", "is_impossible": false}, {"question": "Where are the Harvard medical, Dental and school of Public Health located?", "is_impossible": false}, {"question": "What is the name of the bridge over the Longwood Medical and Academic area?", "is_impossible": true}, {"question": "How wide of an area does the Charles River run through?", "is_impossible": true}, {"question": "How many miles will a person walk when they cross the John W. Weeks Bridge?", "is_impossible": true}, {"question": "What is the circumference of Harvard Stadium?", "is_impossible": true}, {"question": "What medical school is located in Allston?", "is_impossible": true}]}, {"id": "21_13", "context": "Harvard has purchased tracts of land in Allston, a walk across the Charles River from Cambridge, with the intent of major expansion southward. The university now owns approximately fifty percent more land in Allston than in Cambridge. Proposals to connect the Cambridge campus with the new Allston campus include new and enlarged bridges, a shuttle service and/or a tram. Plans also call for sinking part of Storrow Drive (at Harvard's expense) for replacement with park land and pedestrian access to the Charles River, as well as the construction of bike paths, and buildings throughout the Allston campus. The institution asserts that such expansion will benefit not only the school, but surrounding community, pointing to such features as the enhanced transit infrastructure, possible shuttles open to the public, and park space which will also be publicly accessible.", "questions": [{"question": "How much more land does the school own in Allston than Cambridge?", "is_impossible": false}, {"question": "What are some proposals to connect campuses?", "is_impossible": false}, {"question": "What additional benefits are there to surrounding community of expansion?", "is_impossible": false}, {"question": "What has Cambridge purchased in Allston?", "is_impossible": true}, {"question": "Why has Cambridge purchased land in Allston?", "is_impossible": true}, {"question": "How much land does Cambridge own in Allston?", "is_impossible": true}, {"question": "Who does Cambridge say the expansion will benefit?", "is_impossible": true}, {"question": "What infrastructure will be improved in Storrow Drive?", "is_impossible": true}]}, {"id": "21_14", "context": "Harvard's 2,400 professors, lecturers, and instructors instruct 7,200 undergraduates and 14,000 graduate students. The school color is crimson, which is also the name of the Harvard sports teams and the daily newspaper, The Harvard Crimson. The color was unofficially adopted (in preference to magenta) by an 1875 vote of the student body, although the association with some form of red can be traced back to 1858, when Charles William Eliot, a young graduate student who would later become Harvard's 21st and longest-serving president (1869–1909), bought red bandanas for his crew so they could more easily be distinguished by spectators at a regatta.", "questions": [{"question": "What is the total number of professors, instructors, and lecturers at Harvard?", "is_impossible": false}, {"question": "What is the enrollment of undergraduates at Harvard?", "is_impossible": false}, {"question": "How many graduate students does Harvard have?", "is_impossible": false}, {"question": "When was the color crimson adopted at Harvard as official color?", "is_impossible": false}, {"question": "What year is the earliest traces of the color Crimson at Harvard?", "is_impossible": false}, {"question": "When did The Harvard Crimson publish its first issue?", "is_impossible": true}, {"question": "How many people were at a Harvard sponsored regatta in 1875?", "is_impossible": true}, {"question": "How many people usually go to see Harvard sports teams play each year?", "is_impossible": true}, {"question": "How many students did Charles William Eliot teach throughout his tenure at Harvard?", "is_impossible": true}, {"question": "What did Eliot handing out The Harvard Crimson at a regatta do for the school in 1875?", "is_impossible": true}]}, {"id": "21_15", "context": "Harvard has the largest university endowment in the world. As of September 2011[update], it had nearly regained the loss suffered during the 2008 recession. It was worth $32 billion in 2011, up from $28 billion in September 2010 and $26 billion in 2009. It suffered about 30% loss in 2008-09. In December 2008, Harvard announced that its endowment had lost 22% (approximately $8 billion) from July to October 2008, necessitating budget cuts. Later reports suggest the loss was actually more than double that figure, a reduction of nearly 50% of its endowment in the first four months alone. Forbes in March 2009 estimated the loss to be in the range of $12 billion. One of the most visible results of Harvard's attempt to re-balance its budget was their halting of construction of the $1.2 billion Allston Science Complex that had been scheduled to be completed by 2011, resulting in protests from local residents. As of 2012[update], Harvard University had a total financial aid reserve of $159 million for students, and a Pell Grant reserve of $4.093 million available for disbursement.", "questions": [{"question": "What was the Harvard endowment total in 2011?", "is_impossible": false}, {"question": "How great were the losses suffered in the the financial crisis of 2008-09 to Harvard endowment?", "is_impossible": false}, {"question": "What project did Harvard halt due to the financial crisis?", "is_impossible": false}, {"question": "What are Harvard's Pell grant reserves?", "is_impossible": false}, {"question": "What is Harvard's total financial aid reserves?", "is_impossible": false}, {"question": "What amount did Harvard cut from their 2012 financial aid reserve?", "is_impossible": true}, {"question": "How much did Forbes donate to charity in 2009?", "is_impossible": true}, {"question": "How much of a loss did Forbes suffer in 2008?", "is_impossible": true}, {"question": "What did Forbes halt the construction of in 2008?", "is_impossible": true}, {"question": "What did local residents do when Forbes announced budget cuts in 2011?", "is_impossible": true}]}, {"id": "21_16", "context": "During the divestment from South Africa movement in the late 1980s, student activists erected a symbolic \"shantytown\" on Harvard Yard and blockaded a speech given by South African Vice Consul Duke Kent-Brown. The Harvard Management Company repeatedly refused to divest, stating that \"operating expenses must not be subject to financially unrealistic strictures or carping by the unsophisticated or by special interest groups.\" However, the university did eventually reduce its South African holdings by $230 million (out of $400 million) in response to the pressure.", "questions": [{"question": "When was the divestment from South Africa movement? ", "is_impossible": false}, {"question": "What South African Vice Consul did Harvard students blockade the speech of? ", "is_impossible": false}, {"question": "By how much did Harvard management reduce its South Africa holdings in response to pressure?", "is_impossible": false}, {"question": "In what year did South African Vice Consul Duke Kent-Brown take office?", "is_impossible": true}, {"question": "What was erected in South Africa by Duke Kent-Brown to protest Harvard?", "is_impossible": true}, {"question": "What did Kent-Brown do to interrupt a speech by Harvard?", "is_impossible": true}, {"question": "What amount of money did Kent-Brown have invested in Harvard?", "is_impossible": true}, {"question": "By how much did Kent-Brown reduce his investment in Harvard?", "is_impossible": true}]}, {"id": "21_17", "context": "Undergraduate admission to Harvard is characterized by the Carnegie Foundation as \"more selective, lower transfer-in\". Harvard College accepted 5.3% of applicants for the class of 2019, a record low and the second lowest acceptance rate among all national universities. Harvard College ended its early admissions program in 2007 as the program was believed to disadvantage low-income and under-represented minority applicants applying to selective universities, yet for the class of 2016 an Early Action program was reintroduced.", "questions": [{"question": "What is the applicant admission rate for class of 2019?", "is_impossible": false}, {"question": "In what year did Harvard end its early admission program?", "is_impossible": false}, {"question": "Why did Harvard end its early admission program?", "is_impossible": false}, {"question": "In what year was an early admission program reintroduced?", "is_impossible": false}, {"question": "How is admission to the Early Action program characterized?", "is_impossible": true}, {"question": "What acceptance rate does the Early Action program have for 2019?", "is_impossible": true}, {"question": "What rank does the Early Action program have among all others?", "is_impossible": true}, {"question": "When did the Carnegie Foundation start managing statistics for university admissions?", "is_impossible": true}, {"question": "What applicants does the Carnegie Foundation want to have more support for?", "is_impossible": true}]}, {"id": "21_18", "context": "The four-year, full-time undergraduate program comprises a minority of enrollments at the university and emphasizes instruction with an \"arts and sciences focus\". Between 1978 and 2008, entering students were required to complete a core curriculum of seven classes outside of their concentration. Since 2008, undergraduate students have been required to complete courses in eight General Education categories: Aesthetic and Interpretive Understanding, Culture and Belief, Empirical and Mathematical Reasoning, Ethical Reasoning, Science of Living Systems, Science of the Physical Universe, Societies of the World, and United States in the World. Harvard offers a comprehensive doctoral graduate program and there is a high level of coexistence between graduate and undergraduate degrees. The Carnegie Foundation for the Advancement of Teaching, The New York Times, and some students have criticized Harvard for its reliance on teaching fellows for some aspects of undergraduate education; they consider this to adversely affect the quality of education.", "questions": [{"question": "Between 1978 an d2008 four year full time undergraduate students were required to complete how many classes outside of their concentration?", "is_impossible": false}, {"question": "Post 2008 undergraduate students are required to complete how many general education classes towards degree?", "is_impossible": false}, {"question": "What criticism in NY times article that impacts the quality of Education at Harvard?", "is_impossible": false}, {"question": "How many classes outside of their concentration did the Carnegie Foundation require in 2007?", "is_impossible": true}, {"question": "What kind of enrollments did the Ethical Reasoning program have in 2007?", "is_impossible": true}, {"question": "What kind of focus has the Ethical Reasoning program had since 2007?", "is_impossible": true}, {"question": "Since 1978 how many courses have students in the Ethical Reasoning program needed to take?", "is_impossible": true}, {"question": "Who does the Carnegie Foundation depend on for some aspects of undergraduate education?", "is_impossible": true}]}, {"id": "21_19", "context": "Harvard's academic programs operate on a semester calendar beginning in early September and ending in mid-May. Undergraduates typically take four half-courses per term and must maintain a four-course rate average to be considered full-time. In many concentrations, students can elect to pursue a basic program or an honors-eligible program requiring a senior thesis and/or advanced course work. Students graduating in the top 4–5% of the class are awarded degrees summa cum laude, students in the next 15% of the class are awarded magna cum laude, and the next 30% of the class are awarded cum laude. Harvard has chapters of academic honor societies such as Phi Beta Kappa and various committees and departments also award several hundred named prizes annually. Harvard, along with other universities, has been accused of grade inflation, although there is evidence that the quality of the student body and its motivation have also increased. Harvard College reduced the number of students who receive Latin honors from 90% in 2004 to 60% in 2005. Moreover, the honors of \"John Harvard Scholar\" and \"Harvard College Scholar\" will now be given only to the top 5 percent and the next 5 percent of each class.", "questions": [{"question": "What is the duration of Harvard Academic year?", "is_impossible": false}, {"question": "How many courses must undergraduates maintain for full time status?", "is_impossible": false}, {"question": "What are the top 4-5% graduating students honored with?", "is_impossible": false}, {"question": "From 2004 to 2005 Harvard reduced the number of students earning Latin honors from 90% to what?", "is_impossible": false}, {"question": "What does a basic program also require?", "is_impossible": true}, {"question": "What percentage of the student body is accepted to the Phi Beta Kappa honor society each year?", "is_impossible": true}, {"question": "What percentage of the student body was affected by grade inflation in 2004?", "is_impossible": true}, {"question": "What increased about Harvard's student body in 2005?", "is_impossible": true}, {"question": "What two honors were given out more frequently in 2005?", "is_impossible": true}]}, {"id": "21_20", "context": "For the 2012–13 school year annual tuition was $38,000, with a total cost of attendance of $57,000. Beginning 2007, families with incomes below $60,000 pay nothing for their children to attend, including room and board. Families with incomes between $60,000 to $80,000 pay only a few thousand dollars per year, and families earning between $120,000 and $180,000 pay no more than 10% of their annual incomes. In 2009, Harvard offered grants totaling $414 million across all eleven divisions;[further explanation needed] $340 million came from institutional funds, $35 million from federal support, and $39 million from other outside support. Grants total 88% of Harvard's aid for undergraduate students, with aid also provided by loans (8%) and work-study (4%).", "questions": [{"question": "What is tuition for 2012 - 13 year at Harvard? ", "is_impossible": false}, {"question": "What is the total cost of attendance in 2012-13?", "is_impossible": false}, {"question": "After 2007 how much do student from families earning less than $60,000 pay for school?", "is_impossible": false}, {"question": "In 2009 what was the total of Grants awarded from Harvard?", "is_impossible": false}, {"question": "What percentage of total financial aid for undergraduates from Harvard was in the form of grants?", "is_impossible": false}, {"question": "What did families with incomes below $38,000 pay for tuition in 2009?", "is_impossible": true}, {"question": "What else were families with incomes below $38,000 not required to pay for in 2009?", "is_impossible": true}, {"question": "How much did students pay in total to go to Harvard in 2007?", "is_impossible": true}, {"question": "How many student loans can you apply for in four years at Harvard?", "is_impossible": true}, {"question": "How many student dorms were there in use at Harvard in 2012?", "is_impossible": true}]}, {"id": "21_21", "context": "The Harvard University Library System is centered in Widener Library in Harvard Yard and comprises nearly 80 individual libraries holding over 18 million volumes. According to the American Library Association, this makes it the largest academic library in the United States, and one of the largest in the world. Cabot Science Library, Lamont Library, and Widener Library are three of the most popular libraries for undergraduates to use, with easy access and central locations. There are rare books, manuscripts and other special collections throughout Harvard's libraries; Houghton Library, the Arthur and Elizabeth Schlesinger Library on the History of Women in America, and the Harvard University Archives consist principally of rare and unique materials. America's oldest collection of maps, gazetteers, and atlases both old and new is stored in Pusey Library and open to the public. The largest collection of East-Asian language material outside of East Asia is held in the Harvard-Yenching Library.", "questions": [{"question": "What is the center library in the Harvard library system?", "is_impossible": false}, {"question": "How many total volumes are in the Harvard library system?", "is_impossible": false}, {"question": "What are the 3 post popular libraries for undergraduates in the Harvard system?", "is_impossible": false}, {"question": "Where are America's oldest collection of maps, gazettes, and atlases housed?", "is_impossible": false}, {"question": "Where is the American Library Association located?", "is_impossible": true}, {"question": "How many books are endorsed by the American Library Association?", "is_impossible": true}, {"question": "What is the size of the Lamont Library that gives it a unique distinction?", "is_impossible": true}, {"question": "What is the status of the Harvard University Archives with undergraduates?", "is_impossible": true}, {"question": "What kind of access for undergraduates do the Harvard University Archives have?", "is_impossible": true}]}, {"id": "21_22", "context": "Harvard operates several arts, cultural, and scientific museums. The Harvard Art Museums comprises three museums. The Arthur M. Sackler Museum includes collections of ancient, Asian, Islamic and later Indian art, the Busch-Reisinger Museum, formerly the Germanic Museum, covers central and northern European art, and the Fogg Museum of Art, covers Western art from the Middle Ages to the present emphasizing Italian early Renaissance, British pre-Raphaelite, and 19th-century French art. The Harvard Museum of Natural History includes the Harvard Mineralogical Museum, Harvard University Herbaria featuring the Blaschka Glass Flowers exhibit, and the Museum of Comparative Zoology. Other museums include the Carpenter Center for the Visual Arts, designed by Le Corbusier, housing the film archive, the Peabody Museum of Archaeology and Ethnology, specializing in the cultural history and civilizations of the Western Hemisphere, and the Semitic Museum featuring artifacts from excavations in the Middle East.", "questions": [{"question": "How many museums comprise Harvard Art Museums?", "is_impossible": false}, {"question": "What does the Fogg Museum of Art cover?", "is_impossible": false}, {"question": "What museum specializes in cultural history and civilizations of the Western Hemisphere?", "is_impossible": false}, {"question": "What is the former name of the Arthur M. Sackler Museum?", "is_impossible": true}, {"question": "How many museums does the Busch-Reisinger Museum comprise?", "is_impossible": true}, {"question": "Who designed the Fogg Museum of Art?", "is_impossible": true}, {"question": "What kind of French art is kept at the Arthur M. Sackler Museum?", "is_impossible": true}, {"question": "What glass flowers exhibit is included in the Busch-Reisinger Museum?", "is_impossible": true}]}, {"id": "21_23", "context": "Harvard has been highly ranked by many university rankings. In particular, it has consistently topped the Academic Ranking of World Universities (ARWU) since 2003, and the THE World Reputation Rankings since 2011, when the first time such league tables were published. When the QS and Times were published in partnership as the THE-QS World University Rankings during 2004-2009, Harvard had also been regarded the first in every year. The University's undergraduate program has been continuously among the top two in the U.S. News & World Report. In 2014, Harvard topped the University Ranking by Academic Performance (URAP). It was ranked 8th on the 2013-2014 PayScale College Salary Report and 14th on the 2013 PayScale College Education Value Rankings. From a poll done by The Princeton Review, Harvard is the second most commonly named \"dream college\", both for students and parents in 2013, and was the first nominated by parents in 2009. In 2011, the Mines ParisTech : Professional Ranking World Universities ranked Harvard 1st university in the world in terms of number of alumni holding CEO position in Fortune Global 500 companies.", "questions": [{"question": "Starting in what year has Harvard topped the Academic Rankings of World Universities?", "is_impossible": false}, {"question": "Beginning in what year was Harvard on top of the World Reputation Rankings?", "is_impossible": false}, {"question": "According to the Princeton Review where has Harvard ranked as a \"Dream College\" in 2013", "is_impossible": false}, {"question": "Since what year has the ARWU ranked academic performance?", "is_impossible": true}, {"question": "During what years did Harvard roll out a new undergraduate program?", "is_impossible": true}, {"question": "What news magazine transitioned to being exclusively online in 2009?", "is_impossible": true}, {"question": "How was The Princeton Review ranked by students in 2013 for being most informative?", "is_impossible": true}, {"question": "How was US News and World Report ranked in terms of CEO positions in 2011?", "is_impossible": true}]}, {"id": "21_24", "context": "The Harvard Crimson competes in 42 intercollegiate sports in the NCAA Division I Ivy League. Harvard has an intense athletic rivalry with Yale University culminating in The Game, although the Harvard–Yale Regatta predates the football game. This rivalry, though, is put aside every two years when the Harvard and Yale Track and Field teams come together to compete against a combined Oxford University and Cambridge University team, a competition that is the oldest continuous international amateur competition in the world.", "questions": [{"question": "How many intercollegiate sports does Harvard compete in NCAA division I", "is_impossible": false}, {"question": "What is Harvard's most intense rival?", "is_impossible": false}, {"question": "At what time is the Harvard-Yale rivalry set aside?", "is_impossible": false}, {"question": "How many sports does Yale compete  in in the NCAA Division I Ivy League?", "is_impossible": true}, {"question": "What kind of rivalry do Oxford and Cambridge have?", "is_impossible": true}, {"question": "What event does the Oxford-Cambridge rivalry culminate in?", "is_impossible": true}, {"question": "How often do Oxford and Cambridge put aside their rivalry?", "is_impossible": true}, {"question": "How old is the NCAA Division I Ivy League competition?", "is_impossible": true}]}, {"id": "21_25", "context": "Harvard's athletic rivalry with Yale is intense in every sport in which they meet, coming to a climax each fall in the annual football meeting, which dates back to 1875 and is usually called simply \"The Game\". While Harvard's football team is no longer one of the country's best as it often was a century ago during football's early days (it won the Rose Bowl in 1920), both it and Yale have influenced the way the game is played. In 1903, Harvard Stadium introduced a new era into football with the first-ever permanent reinforced concrete stadium of its kind in the country. The stadium's structure actually played a role in the evolution of the college game. Seeking to reduce the alarming number of deaths and serious injuries in the sport, Walter Camp (former captain of the Yale football team), suggested widening the field to open up the game. But the stadium was too narrow to accommodate a wider playing surface. So, other steps had to be taken. Camp would instead support revolutionary new rules for the 1906 season. These included legalizing the forward pass, perhaps the most significant rule change in the sport's history.", "questions": [{"question": "What was the first year that Yale and Harvard played football?", "is_impossible": false}, {"question": "In what year did Harvard Stadium become the first ever concrete reinforced stadium in the country?", "is_impossible": false}, {"question": "In what year was a set of significant rule changes introduced including the forward pass?", "is_impossible": false}, {"question": "What school was Walter Camp a captain for the football team?", "is_impossible": false}, {"question": "What event was won by Yale in 1920?", "is_impossible": true}, {"question": "What stadium was built in 1920?", "is_impossible": true}, {"question": "How did Yale introduce a new era in football?", "is_impossible": true}, {"question": "What position was Walter Camp on Harvard's football team?", "is_impossible": true}, {"question": "What newly legalized move did Harvard's football team support in 1920?", "is_impossible": true}]}, {"id": "21_26", "context": "Harvard has several athletic facilities, such as the Lavietes Pavilion, a multi-purpose arena and home to the Harvard basketball teams. The Malkin Athletic Center, known as the \"MAC\", serves both as the university's primary recreation facility and as a satellite location for several varsity sports. The five-story building includes two cardio rooms, an Olympic-size swimming pool, a smaller pool for aquaerobics and other activities, a mezzanine, where all types of classes are held, an indoor cycling studio, three weight rooms, and a three-court gym floor to play basketball. The MAC offers personal trainers and specialty classes. It is home to Harvard volleyball, fencing and wrestling. The offices of several of the school's varsity coaches are also in the MAC.", "questions": [{"question": "What is the name of Harvard's basketball facility?", "is_impossible": false}, {"question": "What is the name of Harvard's primary recreational sports facility?", "is_impossible": false}, {"question": "How many weight rooms are in the Malkin Athletic Center", "is_impossible": false}, {"question": "At what building do Olympic athletes train?", "is_impossible": true}, {"question": "What does the Lavietes Pavillion serve as a satellite location for?", "is_impossible": true}, {"question": "How many stories doe the Lavietes Pavillion have?", "is_impossible": true}, {"question": "How many cardio rooms are at the Lavietes Pavillion?", "is_impossible": true}, {"question": "What kind of swimming pool is at the Lavietes Pavillion?", "is_impossible": true}]}, {"id": "21_27", "context": "Older than The Game by 23 years, the Harvard-Yale Regatta was the original source of the athletic rivalry between the two schools. It is held annually in June on the Thames River in eastern Connecticut. The Harvard crew is typically considered to be one of the top teams in the country in rowing. Today, Harvard fields top teams in several other sports, such as the Harvard Crimson men's ice hockey team (with a strong rivalry against Cornell), squash, and even recently won NCAA titles in Men's and Women's Fencing. Harvard also won the Intercollegiate Sailing Association National Championships in 2003.", "questions": [{"question": "Harvard - Yale Regatta predates \"The Game\" by how many years?", "is_impossible": false}, {"question": "In what body of water is the Harvard - Yale Regatta held?", "is_impossible": false}, {"question": "Who is the primary rival of the Harvard Crimson hockey team?", "is_impossible": false}, {"question": "In what year did Harvard win an Intercolleiate Sailing Association National Championship?", "is_impossible": false}, {"question": "In what state is Yale located?", "is_impossible": true}, {"question": "What river is located near Cornell University?", "is_impossible": true}, {"question": "How is the Yale rowing crew ranked?", "is_impossible": true}, {"question": "What event did Cornell win in 2003?", "is_impossible": true}, {"question": "In what month does the Harvard Crimson men's ice hockey team play?", "is_impossible": true}]}, {"id": "21_28", "context": "Politics: U.N. Secretary General Ban Ki-moon; American political leaders John Hancock, John Adams, John Quincy Adams, Rutherford B. Hayes, Theodore Roosevelt, Franklin D. Roosevelt, John F. Kennedy, Al Gore, George W. Bush and Barack Obama; Chilean President Sebastián Piñera; Colombian President Juan Manuel Santos; Costa Rican President José María Figueres; Mexican Presidents Felipe Calderón, Carlos Salinas de Gortari and Miguel de la Madrid; Mongolian President Tsakhiagiin Elbegdorj; Peruvian President Alejandro Toledo; Taiwanese President Ma Ying-jeou; Canadian Governor General David Lloyd Johnston; Indian Member of Parliament Jayant Sinha; Albanian Prime Minister Fan S. Noli; Canadian Prime Ministers Mackenzie King and Pierre Trudeau; Greek Prime Minister Antonis Samaras; Israeli Prime Minister Benjamin Netanyahu; former Pakistani Prime Minister Benazir Bhutto; U. S. Secretary of Housing and Urban Development Shaun Donovan; Canadian political leader Michael Ignatieff; Pakistani Members of Provincial Assembly Murtaza Bhutto and Sanam Bhutto; Bangladesh Minister of Finance Abul Maal Abdul Muhith; President of Puntland Abdiweli Mohamed Ali; U.S. Ambassador to the European Union Anthony Luzzatto Gardner.", "questions": [{"question": "What UN secretary went to Harvard?", "is_impossible": false}, {"question": "What Columbia President went to Harvard?", "is_impossible": false}, {"question": "Who is the Costa Rican President that went to Harvard?", "is_impossible": false}, {"question": "What Harvard Alumni was the Palestine Prime Minister?", "is_impossible": false}, {"question": "At what venue did Benjamin Netanyahu give a speech recently?", "is_impossible": true}, {"question": "What office was held by George W. Bush?", "is_impossible": true}, {"question": "In what office has Barack Obama recently served his last term?", "is_impossible": true}, {"question": "Where did Barack Obama give his last speech in 2016?", "is_impossible": true}, {"question": "What Union is Antonis Samaras a part of?", "is_impossible": true}]}, {"id": "21_29", "context": "Other: Civil rights leader W. E. B. Du Bois; philosopher Henry David Thoreau; authors Ralph Waldo Emerson and William S. Burroughs; educators Werner Baer, Harlan Hanson; poets Wallace Stevens, T. S. Eliot and E. E. Cummings; conductor Leonard Bernstein; cellist Yo Yo Ma; pianist and composer Charlie Albright; composer John Alden Carpenter; comedian, television show host and writer Conan O'Brien; actors Tatyana Ali, Nestor Carbonell, Matt Damon, Fred Gwynne, Hill Harper, Rashida Jones, Tommy Lee Jones, Ashley Judd, Jack Lemmon, Natalie Portman, Mira Sorvino, Elisabeth Shue, and Scottie Thompson; film directors Darren Aronofsky, Terrence Malick, Mira Nair, and Whit Stillman; architect Philip Johnson; musicians Rivers Cuomo, Tom Morello, and Gram Parsons; musician, producer and composer Ryan Leslie; serial killer Ted Kaczynski; programmer and activist Richard Stallman; NFL quarterback Ryan Fitzpatrick; NFL center Matt Birk; NBA player Jeremy Lin; US Ski Team skier Ryan Max Riley; physician Sachin H. Jain; physicist J. Robert Oppenheimer; computer pioneer and inventor An Wang; Tibetologist George de Roerich; and Marshall Admiral Isoroku Yamamoto.", "questions": [{"question": "What tv host and writer went to Harvard?", "is_impossible": false}, {"question": "What famous conductor went to Harvard?", "is_impossible": false}, {"question": "What is the name of world renowned cellist is a former Harvard student?", "is_impossible": false}, {"question": "What famous civil rights leader called Harvard home?", "is_impossible": false}, {"question": "Who was the former host of Late Night with Conan O'Brien?", "is_impossible": true}, {"question": "What actor starred in the Movie Saving Private Ryan?", "is_impossible": true}, {"question": "Who is a player on the Tampa Bay Buccaneers?", "is_impossible": true}, {"question": "What actor starred in The Men in Black?", "is_impossible": true}, {"question": "Who was the directer of Noah in 2014?", "is_impossible": true}]}, {"id": "21_30", "context": "Harvard's faculty includes scholars such as biologist E. O. Wilson, cognitive scientist Steven Pinker, physicists Lisa Randall and Roy Glauber, chemists Elias Corey, Dudley R. Herschbach and George M. Whitesides, computer scientists Michael O. Rabin and Leslie Valiant, Shakespeare scholar Stephen Greenblatt, writer Louis Menand, critic Helen Vendler, historians Henry Louis Gates, Jr. and Niall Ferguson, economists Amartya Sen, N. Gregory Mankiw, Robert Barro, Stephen A. Marglin, Don M. Wilson III and Martin Feldstein, political philosophers Harvey Mansfield, Baroness Shirley Williams and Michael Sandel, Fields Medalist mathematician Shing-Tung Yau, political scientists Robert Putnam, Joseph Nye, and Stanley Hoffmann, scholar/composers Robert Levin and Bernard Rands, astrophysicist Alyssa A. Goodman, and legal scholars Alan Dershowitz and Lawrence Lessig.", "questions": [{"question": "What Fields Medal winning Mathematician is a faculty member at Harvard?", "is_impossible": false}, {"question": "What prestigious legal scholars are faculty members at Harvard?", "is_impossible": false}, {"question": "What Shakespeare Scholar is a faculty member at Harvard?", "is_impossible": false}, {"question": "What scientist published \"The Better Angels of Our Nature\" in 2011?", "is_impossible": true}, {"question": "What chemist won the Nobel prize in Chemstry in 1986?", "is_impossible": true}, {"question": "What author is best known for his book The Metaphysical Club?", "is_impossible": true}, {"question": "What British citizen stands with and supports liberal democrats?", "is_impossible": true}, {"question": "What political scientist is one of the founders of the theory of neoliberalism?", "is_impossible": true}]}]}
