{"data": [{"id": "22_1", "context": "There are three major types of rock: igneous, sedimentary, and metamorphic. The rock cycle is an important concept in geology which illustrates the relationships between these three types of rock, and magma. When a rock crystallizes from melt (magma and/or lava), it is an igneous rock. This rock can be weathered and eroded, and then redeposited and lithified into a sedimentary rock, or be turned into a metamorphic rock due to heat and pressure that change the mineral content of the rock which gives it a characteristic fabric. The sedimentary rock can then be subsequently turned into a metamorphic rock due to heat and pressure and is then weathered, eroded, deposited, and lithified, ultimately becoming a sedimentary rock. Sedimentary rock may also be re-eroded and redeposited, and metamorphic rock may also undergo additional metamorphism. All three types of rocks may be re-melted; when this happens, a new magma is formed, from which an igneous rock may once again crystallize.", "questions": ["An igneous rock is a rock that crystallizes from what?", "Sedimentary rock can be turned into which of the three types of rock?", "When the three types of rock are re-melted what is formed? ", "What are the three major types of rock? ", "What changes the mineral content of a rock?"]}, {"id": "22_2", "context": "In the 1960s, a series of discoveries, the most important of which was seafloor spreading, showed that the Earth's lithosphere, which includes the crust and rigid uppermost portion of the upper mantle, is separated into a number of tectonic plates that move across the plastically deforming, solid, upper mantle, which is called the asthenosphere. There is an intimate coupling between the movement of the plates on the surface and the convection of the mantle: oceanic plate motions and mantle convection currents always move in the same direction, because the oceanic lithosphere is the rigid upper thermal boundary layer of the convecting mantle. This coupling between rigid plates moving on the surface of the Earth and the convecting mantle is called plate tectonics.", "questions": ["What was the most important discovery that led to the understanding that Earth's lithosphere is separated into tectonic plates?", "Which parts of the Earth are included in the lithosphere? ", "What is another word for the Earth's upper mantle?", "Plate tectonics can be seen as the intimate coupling between rigid plates on the surface of the Earth and what? ", "In what decade was seafloor spreading discovered? "]}, {"id": "22_3", "context": "The development of plate tectonics provided a physical basis for many observations of the solid Earth. Long linear regions of geologic features could be explained as plate boundaries. Mid-ocean ridges, high regions on the seafloor where hydrothermal vents and volcanoes exist, were explained as divergent boundaries, where two plates move apart. Arcs of volcanoes and earthquakes were explained as convergent boundaries, where one plate subducts under another. Transform boundaries, such as the San Andreas fault system, resulted in widespread powerful earthquakes. Plate tectonics also provided a mechanism for Alfred Wegener's theory of continental drift, in which the continents move across the surface of the Earth over geologic time. They also provided a driving force for crustal deformation, and a new setting for the observations of structural geology. The power of the theory of plate tectonics lies in its ability to combine all of these observations into a single theory of how the lithosphere moves over the convecting mantle.", "questions": ["What is the area called where two plates move apart?", "What is the area called where one plate subducts under another?", "What type of fault boundary is defined by having widespread powerful earthquakes, as in the state of California?", "Whose theory was the theory of continental drift?", "The lithosphere moves over which mantle n the theory of plate tectonics?"]}, {"id": "22_4", "context": "Seismologists can use the arrival times of seismic waves in reverse to image the interior of the Earth. Early advances in this field showed the existence of a liquid outer core (where shear waves were not able to propagate) and a dense solid inner core. These advances led to the development of a layered model of the Earth, with a crust and lithosphere on top, the mantle below (separated within itself by seismic discontinuities at 410 and 660 kilometers), and the outer core and inner core below that. More recently, seismologists have been able to create detailed images of wave speeds inside the earth in the same way a doctor images a body in a CT scan. These images have led to a much more detailed view of the interior of the Earth, and have replaced the simplified layered model with a much more dynamic model.", "questions": ["What types of waves do seismologists use to image the interior of the Earth?", "In the layered model of the Earth, the outermost layer is what? ", "In the layered model of the Earth there are seismic discontinuities in which layer? ", "Recently a more detailed model of the Earth was developed. Seismologists were able to create this using images of what from the interior of the Earth? ", "In the layered model of the Earth, the mantle has two layers below it. What are they? "]}, {"id": "22_5", "context": "The following four timelines show the geologic time scale. The first shows the entire time from the formation of the Earth to the present, but this compresses the most recent eon. Therefore, the second scale shows the most recent eon with an expanded scale. The second scale compresses the most recent era, so the most recent era is expanded in the third scale. Since the Quaternary is a very short period with short epochs, it is further expanded in the fourth scale. The second, third, and fourth timelines are therefore each subsections of their preceding timeline as indicated by asterisks. The Holocene (the latest epoch) is too small to be shown clearly on the third timeline on the right, another reason for expanding the fourth scale. The Pleistocene (P) epoch. Q stands for the Quaternary period.", "questions": ["Why is the second timeline needed? ", "Which timeline is further expanded in the fourth scale?", "What is the name of the latest epoch?", "The Pleistocene epoch takes place during which period?"]}, {"id": "22_6", "context": "The principle of cross-cutting relationships pertains to the formation of faults and the age of the sequences through which they cut. Faults are younger than the rocks they cut; accordingly, if a fault is found that penetrates some formations but not those on top of it, then the formations that were cut are older than the fault, and the ones that are not cut must be younger than the fault. Finding the key bed in these situations may help determine whether the fault is a normal fault or a thrust fault.", "questions": ["What principle relates to the formation of faults and the age of the sequences through which they cut? ", "When rock formations are found on top of a fault that have not been cut, then they must be older or younger than the fault?", "Finding what helps to determine if a fault is a normal fault or a thrust fault? ", "Rocks on top of a fault that are cut are always older or younger than the fault itself?"]}, {"id": "22_7", "context": "The principle of inclusions and components states that, with sedimentary rocks, if inclusions (or clasts) are found in a formation, then the inclusions must be older than the formation that contains them. For example, in sedimentary rocks, it is common for gravel from an older formation to be ripped up and included in a newer layer. A similar situation with igneous rocks occurs when xenoliths are found. These foreign bodies are picked up as magma or lava flows, and are incorporated, later to cool in the matrix. As a result, xenoliths are older than the rock which contains them.", "questions": ["What foreign bodies, which are older than the rocks themselves, occur igneous rocks?", "Xenoliths are picked up by what and deposited into the matrix of igneous rocks? ", "What is another word for inclusions in sedimentary rocks? ", "What is the principle that states that with sedimentary rocks, inclusions must be older than the formation that contains them?", "What is something that is often torn up and included in sedimentary rock?"]}, {"id": "22_8", "context": "The principle of faunal succession is based on the appearance of fossils in sedimentary rocks. As organisms exist at the same time period throughout the world, their presence or (sometimes) absence may be used to provide a relative age of the formations in which they are found. Based on principles laid out by William Smith almost a hundred years before the publication of Charles Darwin's theory of evolution, the principles of succession were developed independently of evolutionary thought. The principle becomes quite complex, however, given the uncertainties of fossilization, the localization of fossil types due to lateral changes in habitat (facies change in sedimentary strata), and that not all fossils may be found globally at the same time.", "questions": ["Which principle is based on the appearance of fossils in sedimentary rocks?", "Whose principles were the principle of faunal succession built upon?", "The fact that not all fossils may be found globally at the same time causes the principle to become what?", "The presence or absence of what can be used to determine the relative age of the formations in which they are found? ", "The principle of faunal succession was developed 100 years before whose theory of evolution?"]}, {"id": "22_9", "context": "At the beginning of the 20th century, important advancement in geological science was facilitated by the ability to obtain accurate absolute dates to geologic events using radioactive isotopes and other methods. This changed the understanding of geologic time. Previously, geologists could only use fossils and stratigraphic correlation to date sections of rock relative to one another. With isotopic dates it became possible to assign absolute ages to rock units, and these absolute dates could be applied to fossil sequences in which there was datable material, converting the old relative ages into new absolute ages.", "questions": ["When was the ability to use radioactive isotopes to date rock formations developed?", "What type of correlation was used previously to help date rock formations?", "It is now possible to convert old relative ages into what type of ages using isotopic dating?", "Previous to isotopic dating sections of rocks had to be dated using fossils and stratigraphic correlation relative to what? ", "When dating rocks, what is the absolute isotopic date applied to?"]}, {"id": "22_10", "context": "For many geologic applications, isotope ratios of radioactive elements are measured in minerals that give the amount of time that has passed since a rock passed through its particular closure temperature, the point at which different radiometric isotopes stop diffusing into and out of the crystal lattice. These are used in geochronologic and thermochronologic studies. Common methods include uranium-lead dating, potassium-argon dating, argon-argon dating and uranium-thorium dating. These methods are used for a variety of applications. Dating of lava and volcanic ash layers found within a stratigraphic sequence can provide absolute age data for sedimentary rock units which do not contain radioactive isotopes and calibrate relative dating techniques. These methods can also be used to determine ages of pluton emplacement. Thermochemical techniques can be used to determine temperature profiles within the crust, the uplift of mountain ranges, and paleotopography.", "questions": ["What techniques can be used to determine paleotopography?", "The point at which different radiometric isotopes stop diffusing into and out of the crystal lattice is called what?", "What type of ratios are used in geochronologic and thermochronologic studies?", "How can you find the absolute age of sedimentary rock units which do not contain radioactive isotopes?"]}, {"id": "22_11", "context": "When rock units are placed under horizontal compression, they shorten and become thicker. Because rock units, other than muds, do not significantly change in volume, this is accomplished in two primary ways: through faulting and folding. In the shallow crust, where brittle deformation can occur, thrust faults form, which cause deeper rock to move on top of shallower rock. Because deeper rock is often older, as noted by the principle of superposition, this can result in older rocks moving on top of younger ones. Movement along faults can result in folding, either because the faults are not planar or because rock layers are dragged along, forming drag folds as slip occurs along the fault. Deeper in the Earth, rocks behave plastically, and fold instead of faulting. These folds can either be those where the material in the center of the fold buckles upwards, creating \"antiforms\", or where it buckles downwards, creating \"synforms\". If the tops of the rock units within the folds remain pointing upwards, they are called anticlines and synclines, respectively. If some of the units in the fold are facing downward, the structure is called an overturned anticline or syncline, and if all of the rock units are overturned or the correct up-direction is unknown, they are simply called by the most general terms, antiforms and synforms.", "questions": ["Rock units become thicker and shorten when placed under this type of compression. ", "Where do thrust faults form?", "When rock folds deep in the Earth it can fold one of two ways, when it buckles upwards it creates what? ", "When rock folds deep in the Earth it can fold one of two ways, when it buckles downwards it creates what? ", "If the tops of the rock units within the folds remain pointing upwards, they are called what? "]}, {"id": "22_12", "context": "Extension causes the rock units as a whole to become longer and thinner. This is primarily accomplished through normal faulting and through the ductile stretching and thinning. Normal faults drop rock units that are higher below those that are lower. This typically results in younger units being placed below older units. Stretching of units can result in their thinning; in fact, there is a location within the Maria Fold and Thrust Belt in which the entire sedimentary sequence of the Grand Canyon can be seen over a length of less than a meter. Rocks at the depth to be ductilely stretched are often also metamorphosed. These stretched rocks can also pinch into lenses, known as boudins, after the French word for \"sausage\", because of their visual similarity.", "questions": ["This causes the rock unit as a whole to become longer and thinner. ", "Stretched rocks that pinch into lenses are known by what word? ", "Where can the entire sedimentary sequence of the Grand Canyon be seen in less than the length of a meter?", "Rocks that are a depth where they are ductilely stretched are also often what?", "What causes rock extension?"]}, {"id": "22_13", "context": "The addition of new rock units, both depositionally and intrusively, often occurs during deformation. Faulting and other deformational processes result in the creation of topographic gradients, causing material on the rock unit that is increasing in elevation to be eroded by hillslopes and channels. These sediments are deposited on the rock unit that is going down. Continual motion along the fault maintains the topographic gradient in spite of the movement of sediment, and continues to create accommodation space for the material to deposit. Deformational events are often also associated with volcanism and igneous activity. Volcanic ashes and lavas accumulate on the surface, and igneous intrusions enter from below. Dikes, long, planar igneous intrusions, enter along cracks, and therefore often form in large numbers in areas that are being actively deformed. This can result in the emplacement of dike swarms, such as those that are observable across the Canadian shield, or rings of dikes around the lava tube of a volcano.", "questions": ["What is another word for long, planar igneous intrusions?", "Where do dikes form?", "What type of gradients are formed by faulting and other deformational processes?", "What activity maintains topographic gradients?", "What events are often associated with volcanism and igneous activity?"]}, {"id": "22_14", "context": "All of these processes do not necessarily occur in a single environment, and do not necessarily occur in a single order. The Hawaiian Islands, for example, consist almost entirely of layered basaltic lava flows. The sedimentary sequences of the mid-continental United States and the Grand Canyon in the southwestern United States contain almost-undeformed stacks of sedimentary rocks that have remained in place since Cambrian time. Other areas are much more geologically complex. In the southwestern United States, sedimentary, volcanic, and intrusive rocks have been metamorphosed, faulted, foliated, and folded. Even older rocks, such as the Acasta gneiss of the Slave craton in northwestern Canada, the oldest known rock in the world have been metamorphosed to the point where their origin is undiscernable without laboratory analysis. In addition, these processes can occur in stages. In many places, the Grand Canyon in the southwestern United States being a very visible example, the lower rock units were metamorphosed and deformed, and then deformation ended and the upper, undeformed units were deposited. Although any amount of rock emplacement and rock deformation can occur, and they can occur any number of times, these concepts provide a guide to understanding the geological history of an area.", "questions": ["The Hawaiian Islands are made up almost entirely of what?", "What is the oldest known rock in the world?", "What type of rock is found at the Grand Canyon?", "The rocks at the Grand Canyon have been in place since when?", "Where is the oldest known rock in the world located?"]}, {"id": "22_15", "context": "Geologists use a number of field, laboratory, and numerical modeling methods to decipher Earth history and understand the processes that occur on and inside the Earth. In typical geological investigations, geologists use primary information related to petrology (the study of rocks), stratigraphy (the study of sedimentary layers), and structural geology (the study of positions of rock units and their deformation). In many cases, geologists also study modern soils, rivers, landscapes, and glaciers; investigate past and current life and biogeochemical pathways, and use geophysical methods to investigate the subsurface.", "questions": ["What is petrology?", "What is stratigraphy?", "What is structural geology?", " What modern formations do geologists study?"]}, {"id": "22_16", "context": "In addition to identifying rocks in the field, petrologists identify rock samples in the laboratory. Two of the primary methods for identifying rocks in the laboratory are through optical microscopy and by using an electron microprobe. In an optical mineralogy analysis, thin sections of rock samples are analyzed through a petrographic microscope, where the minerals can be identified through their different properties in plane-polarized and cross-polarized light, including their birefringence, pleochroism, twinning, and interference properties with a conoscopic lens. In the electron microprobe, individual locations are analyzed for their exact chemical compositions and variation in composition within individual crystals. Stable and radioactive isotope studies provide insight into the geochemical evolution of rock units.", "questions": ["What do petrologists use electron microprobes in the laboratory for?", "What properties are analyzed with a conoscopic lens by petrologists? ", "Stable and radioactive isotope studies provide insight into what?", "Petrologists identify rock samples in the field and where else? ", "What type of microscope is used by petrologists?"]}, {"id": "22_17", "context": "Petrologists can also use fluid inclusion data and perform high temperature and pressure physical experiments to understand the temperatures and pressures at which different mineral phases appear, and how they change through igneous and metamorphic processes. This research can be extrapolated to the field to understand metamorphic processes and the conditions of crystallization of igneous rocks. This work can also help to explain processes that occur within the Earth, such as subduction and magma chamber evolution.", "questions": ["How else can petrologists understand the pressures at which different mineral phases appear?", "How else can petrologists understand the temperature at which different mineral phases appear?", "Data from physical experiments can be extrapolated to the field to understand what processes? "]}, {"id": "22_18", "context": "Structural geologists use microscopic analysis of oriented thin sections of geologic samples to observe the fabric within the rocks which gives information about strain within the crystalline structure of the rocks. They also plot and combine measurements of geological structures in order to better understand the orientations of faults and folds in order to reconstruct the history of rock deformation in the area. In addition, they perform analog and numerical experiments of rock deformation in large and small settings.", "questions": ["What type of geologists give information about strain within the crystalline structure of the rocks?", "How do structural geologists observe the fabric within the rocks?", "In order to better understand the orientations of faults and folds, structural geologists do what with measurements of geological structures?", "What kind of experiments of rock deformation do structural geologists perform?"]}, {"id": "22_19", "context": "Among the most well-known experiments in structural geology are those involving orogenic wedges, which are zones in which mountains are built along convergent tectonic plate boundaries. In the analog versions of these experiments, horizontal layers of sand are pulled along a lower surface into a back stop, which results in realistic-looking patterns of faulting and the growth of a critically tapered (all angles remain the same) orogenic wedge. Numerical models work in the same way as these analog models, though they are often more sophisticated and can include patterns of erosion and uplift in the mountain belt. This helps to show the relationship between erosion and the shape of the mountain range. These studies can also give useful information about pathways for metamorphism through pressure, temperature, space, and time.", "questions": ["Zones in which mountains are built along convergent tectonic plate boundaries are called what?", "What are among the most well known experiments in structural geology? ", "Horizontal layers of what are pulled along a surface into a back stop in analog versions of orogenic wedge experiments?", "What does critically tapered mean? ", "Which is more sophisticated, numericals model or an analog models of orogenic wedges? "]}, {"id": "22_20", "context": "In the laboratory, stratigraphers analyze samples of stratigraphic sections that can be returned from the field, such as those from drill cores. Stratigraphers also analyze data from geophysical surveys that show the locations of stratigraphic units in the subsurface. Geophysical data and well logs can be combined to produce a better view of the subsurface, and stratigraphers often use computer programs to do this in three dimensions. Stratigraphers can then use these data to reconstruct ancient processes occurring on the surface of the Earth, interpret past environments, and locate areas for water, coal, and hydrocarbon extraction.", "questions": ["The analysis of stratigraphic sections such as drill cores is done by who?", "What type of surveys show the location of stratigraphic units in the subsurface?", "What can be combined with geophysical data to produce a better view of the subsurface?", "What tool do stratigraphers use to see their data in three dimensions?", "Stratigraphers try to locate areas for what types of extraction? "]}, {"id": "22_21", "context": "In the laboratory, biostratigraphers analyze rock samples from outcrop and drill cores for the fossils found in them. These fossils help scientists to date the core and to understand the depositional environment in which the rock units formed. Geochronologists precisely date rocks within the stratigraphic section in order to provide better absolute bounds on the timing and rates of deposition. Magnetic stratigraphers look for signs of magnetic reversals in igneous rock units within the drill cores. Other scientists perform stable isotope studies on the rocks to gain information about past climate.", "questions": ["Why is it important to precisely date rocks within the stratigraphic section? ", "Who analyzes rock samples from drill cores in the lab? ", "What types of scientists looks for signs of magnetic reversals in igneous rocks within the drill cores?", "Who dates rocks, precisely, within the stratigraphic section?"]}, {"id": "22_22", "context": "Some modern scholars, such as Fielding H. Garrison, are of the opinion that the origin of the science of geology can be traced to Persia after the Muslim conquests had come to an end. Abu al-Rayhan al-Biruni (973–1048 CE) was one of the earliest Persian geologists, whose works included the earliest writings on the geology of India, hypothesizing that the Indian subcontinent was once a sea. Drawing from Greek and Indian scientific literature that were not destroyed by the Muslim conquests, the Persian scholar Ibn Sina (Avicenna, 981–1037) proposed detailed explanations for the formation of mountains, the origin of earthquakes, and other topics central to modern geology, which provided an essential foundation for the later development of the science. In China, the polymath Shen Kuo (1031–1095) formulated a hypothesis for the process of land formation: based on his observation of fossil animal shells in a geological stratum in a mountain hundreds of miles from the ocean, he inferred that the land was formed by erosion of the mountains and by deposition of silt.", "questions": ["Fielding H. Garrison believes that the science of geology can be traced to where?", "Living from 973–1048 CE he was one of the earliest Persian geologists, what was his name?", "In China, this person inferred that the land was formed by erosion of the mountains and by silt deposition, what was his name?", "This person proposed explanations for the origins of earthquakes and the formation of mountains, what was his name?", "What prompted Shen Kuo to believe the land was formed by erosion of the mountains?"]}, {"id": "22_23", "context": "James Hutton is often viewed as the first modern geologist. In 1785 he presented a paper entitled Theory of the Earth to the Royal Society of Edinburgh. In his paper, he explained his theory that the Earth must be much older than had previously been supposed in order to allow enough time for mountains to be eroded and for sediments to form new rocks at the bottom of the sea, which in turn were raised up to become dry land. Hutton published a two-volume version of his ideas in 1795 (Vol. 1, Vol. 2).", "questions": ["Who is viewed as the first modern geologist?", "In 1785 James Hutton presented what paper to the Royal Society of Edinburgh?", "James Hutton published a 2 volume version of his theories in what year?", "What was the main idea of James Hutton's paper?"]}, {"id": "22_24", "context": "The first geological map of the U.S. was produced in 1809 by William Maclure. In 1807, Maclure commenced the self-imposed task of making a geological survey of the United States. Almost every state in the Union was traversed and mapped by him, the Allegheny Mountains being crossed and recrossed some 50 times. The results of his unaided labours were submitted to the American Philosophical Society in a memoir entitled Observations on the Geology of the United States explanatory of a Geological Map, and published in the Society's Transactions, together with the nation's first geological map. This antedates William Smith's geological map of England by six years, although it was constructed using a different classification of rocks.", "questions": ["Who produced the first geological map of the U.S.?", "In what year was the first geological map of the U.S. produced?", "In what year did William Maclure begin the process of creating the first geological map of the U.S.?", "What was the memoir entitled which was submitted to the American Philosophical Society?", "To whom did William Maclure submit the map?"]}, {"id": "22_25", "context": "Sir Charles Lyell first published his famous book, Principles of Geology, in 1830. This book, which influenced the thought of Charles Darwin, successfully promoted the doctrine of uniformitarianism. This theory states that slow geological processes have occurred throughout the Earth's history and are still occurring today. In contrast, catastrophism is the theory that Earth's features formed in single, catastrophic events and remained unchanged thereafter. Though Hutton believed in uniformitarianism, the idea was not widely accepted at the time.", "questions": ["First published by Sir Charles Lyell in 1830 this book was called what? ", "What doctrine did the doctrine of the Principles of Geology successfully promote?", "Which theory states that slow geological processes are still occurring today, and have occurred throughout Earth's history?", "Which theory states that Earth's features remained unchanged after forming in one single catastrophic event?", "Which famous evolutionist was influenced by the book Principles of Geology?"]}]}
