{"data": [{"id": "24_1", "context": "The University of Chicago (UChicago, Chicago, or U of C) is a private research university in Chicago. The university, established in 1890, consists of The College, various graduate programs, interdisciplinary committees organized into four academic research divisions and seven professional schools. Beyond the arts and sciences, Chicago is also well known for its professional schools, which include the Pritzker School of Medicine, the University of Chicago Booth School of Business, the Law School, the School of Social Service Administration, the Harris School of Public Policy Studies, the Graham School of Continuing Liberal and Professional Studies and the Divinity School. The university currently enrolls approximately 5,000 students in the College and around 15,000 students overall.", "questions": [{"question": "What kind of university is the University of Chicago?", "is_impossible": false}, {"question": "When was the University of Chicago established?", "is_impossible": false}, {"question": "How many professional schools does the University of Chicago have?", "is_impossible": false}, {"question": "How many academic research divisions does the University of Chicago have?", "is_impossible": false}, {"question": "How many students does the University of Chicago have enlisted?", "is_impossible": false}, {"question": "The city of Pritzker is home to which University?", "is_impossible": true}, {"question": "Nearly 7,000 students are enrolled where?", "is_impossible": true}, {"question": "What was established in 1809?", "is_impossible": true}, {"question": "Other than UChicago or simply Chicago, what is another term for the University of Graham Business?", "is_impossible": true}, {"question": "What types of other schools is the city of Harris well known for?", "is_impossible": true}]}, {"id": "24_2", "context": "University of Chicago scholars have played a major role in the development of various academic disciplines, including: the Chicago school of economics, the Chicago school of sociology, the law and economics movement in legal analysis, the Chicago school of literary criticism, the Chicago school of religion, and the behavioralism school of political science. Chicago's physics department helped develop the world's first man-made, self-sustaining nuclear reaction beneath the university's Stagg Field. Chicago's research pursuits have been aided by unique affiliations with world-renowned institutions like the nearby Fermilab and Argonne National Laboratory, as well as the Marine Biological Laboratory. The university is also home to the University of Chicago Press, the largest university press in the United States. With an estimated completion date of 2020, the Barack Obama Presidential Center will be housed at the university and include both the Obama presidential library and offices of the Obama Foundation.", "questions": [{"question": "University of Chicago scholars played a major part in what development?", "is_impossible": false}, {"question": "Who helped develop the first man-made self-sustaining nuclear reaction?", "is_impossible": false}, {"question": "Where is the first man-made self-sustaining nuclear reaction located?", "is_impossible": false}, {"question": "What is the name of the largest university press in the U.S?", "is_impossible": false}, {"question": "In what year will the Barack Obama Presidential Center be finished?", "is_impossible": false}, {"question": "What development has the University of Biological Physics played a lead role in?", "is_impossible": true}, {"question": "What world's first did the religion department help to develop?", "is_impossible": true}, {"question": "Under which field did the world's first synthetically produced nuclear reaction occur?", "is_impossible": true}, {"question": "What is the name of the smallest university press in the US?", "is_impossible": true}, {"question": "The Stagg Presidential Center is set to be finished in what year?", "is_impossible": true}]}, {"id": "24_3", "context": "Founded by the American Baptist Education Society with a donation from oil magnate and wealthiest man in history John D. Rockefeller, the University of Chicago was incorporated in 1890; William Rainey Harper became the university's first president in 1891, and the first classes were held in 1892. Both Harper and future president Robert Maynard Hutchins advocated for Chicago's curriculum to be based upon theoretical and perennial issues rather than on applied sciences and commercial utility. With Harper's vision in mind, the University of Chicago also became one of the 14 founding members of the Association of American Universities, an international organization of leading research universities, in 1900.", "questions": [{"question": "What society founded the University of Chicago?", "is_impossible": false}, {"question": "What person helped establish the school with a donation?", "is_impossible": false}, {"question": "Who was the first president of the University of Chicago?", "is_impossible": false}, {"question": "What year was the university's first president given his position? ", "is_impossible": false}, {"question": "What year was the first class taught at the University of Chicago?", "is_impossible": false}, {"question": "Who is known as the poorest man in all history?", "is_impossible": true}, {"question": "In what year was the University of Maynard incorporated?", "is_impossible": true}, {"question": "In what year did Robert Harper become the first president of the University?", "is_impossible": true}, {"question": "In what year did the U of C become one of 7 founding members of the Association of Chicago Universities?", "is_impossible": true}, {"question": "In what year were the last classes held in the university?", "is_impossible": true}]}, {"id": "24_4", "context": "The University of Chicago was created and incorporated as a coeducational, secular institution in 1890 by the American Baptist Education Society and a donation from oil magnate and philanthropist John D. Rockefeller on land donated by Marshall Field. While the Rockefeller donation provided money for academic operations and long-term endowment, it was stipulated that such money could not be used for buildings. The original physical campus was financed by donations from wealthy Chicagoans like Silas B. Cobb who provided the funds for the campus' first building, Cobb Lecture Hall, and matched Marshall Field's pledge of $100,000. Other early benefactors included businessmen Charles L. Hutchinson (trustee, treasurer and donor of Hutchinson Commons), Martin A. Ryerson (president of the board of trustees and donor of the Ryerson Physical Laboratory) Adolphus Clay Bartlett and Leon Mandel, who funded the construction of the gymnasium and assembly hall, and George C. Walker of the Walker Museum, a relative of Cobb who encouraged his inaugural donation for facilities.", "questions": [{"question": "Who donated property to the University of Chicago?", "is_impossible": false}, {"question": "Who helped pay for the university's first building structure? ", "is_impossible": false}, {"question": "What was the name of the first building built on campus grounds?", "is_impossible": false}, {"question": "How much did Silas B. Cobb pledge to the university?", "is_impossible": false}, {"question": "What is the name of the donor who helped establish the Hutchinson Commons?", "is_impossible": false}, {"question": "In what year did the Walker Museum create and incorporate the U of C as a coed institution?", "is_impossible": true}, {"question": "In what year did Clay Bartlett donate land by Marshall Field?", "is_impossible": true}, {"question": "Who financed the original board of trustees?", "is_impossible": true}, {"question": "George C. Walker served as trustee, treasurer and donor of what?", "is_impossible": true}, {"question": "It was outlined that who's donations could only be used for buildings?", "is_impossible": true}]}, {"id": "24_5", "context": "In the 1890s, the University of Chicago, fearful that its vast resources would injure smaller schools by drawing away good students, affiliated with several regional colleges and universities: Des Moines College, Kalamazoo College, Butler University, and Stetson University. In 1896, the university affiliated with Shimer College in Mount Carroll, Illinois. Under the terms of the affiliation, the schools were required to have courses of study comparable to those at the university, to notify the university early of any contemplated faculty appointments or dismissals, to make no faculty appointment without the university's approval, and to send copies of examinations for suggestions. The University of Chicago agreed to confer a degree on any graduating senior from an affiliated school who made a grade of A for all four years, and on any other graduate who took twelve weeks additional study at the University of Chicago. A student or faculty member of an affiliated school was entitled to free tuition at the University of Chicago, and Chicago students were eligible to attend an affiliated school on the same terms and receive credit for their work. The University of Chicago also agreed to provide affiliated schools with books and scientific apparatus and supplies at cost; special instructors and lecturers without cost except travel expenses; and a copy of every book and journal published by the University of Chicago Press at no cost. The agreement provided that either party could terminate the affiliation on proper notice. Several University of Chicago professors disliked the program, as it involved uncompensated additional labor on their part, and they believed it cheapened the academic reputation of the university. The program passed into history by 1910.", "questions": [{"question": "In 1890, who did the university decide to team up with?", "is_impossible": false}, {"question": "What year did the university team up with Shimer College?", "is_impossible": false}, {"question": "The university agreed to grant a degree to any graduate of affiliate schoos that did what?", "is_impossible": false}, {"question": "Who disliked the affiliate program?", "is_impossible": false}, {"question": "In what year did the affiliate program end?", "is_impossible": false}, {"question": "In what decade did the U of C affiliate with numerous national colleges?", "is_impossible": true}, {"question": "Shimer University is located in which Illinois city?", "is_impossible": true}, {"question": "To what schools did the U of C agree to provide books and supplies free of charge?", "is_impossible": true}, {"question": "In what year did the U of C associate with Kalamazoo College, located in Mount Carroll?", "is_impossible": true}]}, {"id": "24_6", "context": "In 1929, the university's fifth president, Robert Maynard Hutchins, took office; the university underwent many changes during his 24-year tenure. Hutchins eliminated varsity football from the university in an attempt to emphasize academics over athletics, instituted the undergraduate college's liberal-arts curriculum known as the Common Core, and organized the university's graduate work into its current[when?] four divisions. In 1933, Hutchins proposed an unsuccessful plan to merge the University of Chicago and Northwestern University into a single university. During his term, the University of Chicago Hospitals (now called the University of Chicago Medical Center) finished construction and enrolled its first medical students. Also, the Committee on Social Thought, an institution distinctive of the university, was created.", "questions": [{"question": "Who was the university's 5th president?", "is_impossible": false}, {"question": "In what year was the university's 5th president granted his position?", "is_impossible": false}, {"question": "How long did the 5th president's tenure last?", "is_impossible": false}, {"question": "Why did the 5th president of the university decide to get rid of the football program?", "is_impossible": false}, {"question": "What was the name given to the undergraduate college's liberal-arts curriculum?", "is_impossible": false}, {"question": "In what year did the fourth president, Robert Maynard Hutchins take office?", "is_impossible": true}, {"question": "What did the university undergo during Hutchins 33 year tenure?", "is_impossible": true}, {"question": "Why did Hutchins eliminate hospitals from the university?", "is_impossible": true}, {"question": "In what year did Hutchins propose a plan to combine the U of C with Common Core?", "is_impossible": true}, {"question": "During who's tenure was the University of Chicago Hospitals system destroyed?", "is_impossible": true}]}, {"id": "24_7", "context": "In the early 1950s, student applications declined as a result of increasing crime and poverty in the Hyde Park neighborhood. In response, the university became a major sponsor of a controversial urban renewal project for Hyde Park, which profoundly affected both the neighborhood's architecture and street plan. During this period the university, like Shimer College and 10 others, adopted an early entrant program that allowed very young students to attend college; in addition, students enrolled at Shimer were enabled to transfer automatically to the University of Chicago after their second year, having taken comparable or identical examinations and courses.", "questions": [{"question": "In what year did the university first see a drop in applications?", "is_impossible": false}, {"question": "Why did the university see a drop in applicants? ", "is_impossible": false}, {"question": "When were Shimer College students allowed to transfer to the University of Chicago?", "is_impossible": false}, {"question": "The urban renewal project was intended to help the residents of what neighborhood?", "is_impossible": false}, {"question": "What did the early entrant program do for potential students?", "is_impossible": false}, {"question": "During which decade was there an increase in student applications?", "is_impossible": true}, {"question": "Why did student applications increase during the 1950s?", "is_impossible": true}, {"question": "What happened to the number of student applications during the 1920s?", "is_impossible": true}, {"question": "Student enrollment increased as a result of increased crime and poverty in which neighborhood?", "is_impossible": true}, {"question": "Like the University of Hyde Park, what did Shimer College and 10 other schools adopt?", "is_impossible": true}]}, {"id": "24_8", "context": "The university experienced its share of student unrest during the 1960s, beginning in 1962, when students occupied President George Beadle's office in a protest over the university's off-campus rental policies. After continued turmoil, a university committee in 1967 issued what became known as the Kalven Report. The report, a two-page statement of the university's policy in \"social and political action,\" declared that \"To perform its mission in the society, a university must sustain an extraordinary environment of freedom of inquiry and maintain an independence from political fashions, passions, and pressures.\" The report has since been used to justify decisions such as the university's refusal to divest from South Africa in the 1980s and Darfur in the late 2000s.", "questions": [{"question": "In what year did student decide to occupy the president's office?", "is_impossible": false}, {"question": "What made the student decide to occupy the president's office in protest?", "is_impossible": false}, {"question": "In what year was the Kalven Report issued?", "is_impossible": false}, {"question": "How many pages was the Kalven Report statement?", "is_impossible": false}, {"question": "What policy did the Kelven Report contain?", "is_impossible": false}, {"question": "During which decade did the university experience student rest?", "is_impossible": true}, {"question": "Who was the vice president in 1962?", "is_impossible": true}, {"question": "Who's office did students occupy in a protest over rental policies in 1965?", "is_impossible": true}, {"question": "In what year was the Darfur Report issued?", "is_impossible": true}, {"question": "The three page Kalven Report was issued in which year?", "is_impossible": true}]}, {"id": "24_9", "context": "From the mid-2000s, the university began a number of multimillion-dollar expansion projects. In 2008, the University of Chicago announced plans to establish the Milton Friedman Institute which attracted both support and controversy from faculty members and students. The institute will cost around $200 million and occupy the buildings of the Chicago Theological Seminary. During the same year, investor David G. Booth donated $300 million to the university's Booth School of Business, which is the largest gift in the university's history and the largest gift ever to any business school. In 2009, planning or construction on several new buildings, half of which cost $100 million or more, was underway. Since 2011, major construction projects have included the Jules and Gwen Knapp Center for Biomedical Discovery, a ten-story medical research center, and further additions to the medical campus of the University of Chicago Medical Center. In 2014 the University launched the public phase of a $4.5 billion fundraising campaign. In September 2015, the University received $100 million from The Pearson Family Foundation to establish The Pearson Institute for the Study and Resolution of Global Conflicts and The Pearson Global Forum at the Harris School of Public Policy Studies.", "questions": [{"question": "When did the university decide to start multimillion-dollar expansion projects?", "is_impossible": false}, {"question": "What institute did the university announced to everyone in 2008?", "is_impossible": false}, {"question": "How much did the Milton Friedman Institute roughly cost?", "is_impossible": false}, {"question": "What buildings held the Milton Friedman Institute?", "is_impossible": false}, {"question": "Who decide to make a very large donation to the university's Booth School of Business?", "is_impossible": false}, {"question": "In which decade did the university begin several thousand dollar expansion projects?", "is_impossible": true}, {"question": "When were plans for the Harris Friedman Institute announced?", "is_impossible": true}, {"question": "Planned to occupy the Chicago Business Booth, how much is the Milton Friedman Institute estimated to cost?", "is_impossible": true}, {"question": "Who donated a half billion dollars to the university's Booth School of Business?", "is_impossible": true}, {"question": "In what year did Pearson Friedman donate $300 million to the Booth School of Business?", "is_impossible": true}]}, {"id": "24_10", "context": "The first buildings of the University of Chicago campus, which make up what is now known as the Main Quadrangles, were part of a \"master plan\" conceived by two University of Chicago trustees and plotted by Chicago architect Henry Ives Cobb. The Main Quadrangles consist of six quadrangles, each surrounded by buildings, bordering one larger quadrangle. The buildings of the Main Quadrangles were designed by Cobb, Shepley, Rutan and Coolidge, Holabird & Roche, and other architectural firms in a mixture of the Victorian Gothic and Collegiate Gothic styles, patterned on the colleges of the University of Oxford. (Mitchell Tower, for example, is modeled after Oxford's Magdalen Tower, and the university Commons, Hutchinson Hall, replicates Christ Church Hall.)", "questions": [{"question": "What are the first buildings the university built knows as today?", "is_impossible": false}, {"question": "How many quadrangles does the Main Quadrangles have?", "is_impossible": false}, {"question": "Who helped designed the Main Quadrangles?", "is_impossible": false}, {"question": "The Mitchell Tower is designed to look like what Oxford tower?", "is_impossible": false}, {"question": "Hutchinson Hall was designed to look like what Oxford hall?", "is_impossible": false}, {"question": "The first buildings of the University of Oxford are known as what?", "is_impossible": true}, {"question": "Who were the Main Gothics designed by?", "is_impossible": true}, {"question": "The second buildings of the U of C are known as what?", "is_impossible": true}, {"question": "The Main Quadrangles were a piece of a master plan conceived by how many Oxford University trustees?", "is_impossible": true}]}, {"id": "24_11", "context": "After the 1940s, the Gothic style on campus began to give way to modern styles. In 1955, Eero Saarinen was contracted to develop a second master plan, which led to the construction of buildings both north and south of the Midway, including the Laird Bell Law Quadrangle (a complex designed by Saarinen); a series of arts buildings; a building designed by Ludwig Mies van der Rohe for the university's School of Social Service Administration;, a building which is to become the home of the Harris School of Public Policy Studies by Edward Durrell Stone, and the Regenstein Library, the largest building on campus, a brutalist structure designed by Walter Netsch of the Chicago firm Skidmore, Owings & Merrill. Another master plan, designed in 1999 and updated in 2004, produced the Gerald Ratner Athletics Center (2003), the Max Palevsky Residential Commons (2001), South Campus Residence Hall and dining commons (2009), a new children's hospital, and other construction, expansions, and restorations. In 2011, the university completed the glass dome-shaped Joe and Rika Mansueto Library, which provides a grand reading room for the university library and prevents the need for an off-campus book depository.", "questions": [{"question": "During what decade did the campus start to look more modern?", "is_impossible": false}, {"question": "Who was assigned to design a second master plan?", "is_impossible": false}, {"question": "What administration did Ludwig Mies van der Rohe designa buiding?", "is_impossible": false}, {"question": "What public policy school found it's home in the building that Ludwig Mies van der Rohe designed?", "is_impossible": false}, {"question": "When was the Gerald Ratner Athletics Center constructed?", "is_impossible": false}, {"question": "After which decade did modern styles give way to Gothic styles on campus?", "is_impossible": true}, {"question": "In what year was Owings contracted to develop a second master plan?", "is_impossible": true}, {"question": "What was Eero Saarinen contracted to develop in 2011?", "is_impossible": true}, {"question": "The third master plan led to the construction of buildings where?", "is_impossible": true}, {"question": "In which year was the Gerald Palevsky Athletic Commons developed?", "is_impossible": true}]}, {"id": "24_12", "context": "The University of Chicago also maintains facilities apart from its main campus. The university's Booth School of Business maintains campuses in Singapore, London, and the downtown Streeterville neighborhood of Chicago. The Center in Paris, a campus located on the left bank of the Seine in Paris, hosts various undergraduate and graduate study programs. In fall 2010, the University of Chicago also opened a center in Beijing, near Renmin University's campus in Haidian District. The most recent additions are a center in New Delhi, India, which opened in 2014, and a center in Hong Kong which opened in 2015.", "questions": [{"question": "What other locations can the Booth School of Business be found?", "is_impossible": false}, {"question": "The Center in Paris is located near what river?", "is_impossible": false}, {"question": "The university established a center in Beijing in what year?", "is_impossible": false}, {"question": "The university's center in Beijing is located next to what school's campus?", "is_impossible": false}, {"question": "What year did the university open a center in Hong Kong?", "is_impossible": false}, {"question": "Where does the Paris School Of Business have campuses?", "is_impossible": true}, {"question": "Which campus is located on the right banks of the Seine?", "is_impossible": true}, {"question": "Which campus hosts graduate only student programs and is located on the banks of the Seine?", "is_impossible": true}, {"question": "In what year were the oldest additions in New Delhi opened?", "is_impossible": true}, {"question": "In what year were the oldest additions in Hong Kong opened?", "is_impossible": true}]}, {"id": "24_13", "context": "The University of Chicago is governed by a board of trustees. The Board of Trustees oversees the long-term development and plans of the university and manages fundraising efforts, and is composed of 50 members including the university President. Directly beneath the President are the Provost, fourteen Vice Presidents (including the Chief Financial Officer, Chief Investment Officer, and Dean of Students of the university), the Directors of Argonne National Laboratory and Fermilab, the Secretary of the university, and the Student Ombudsperson. As of August 2009[update], the Chairman of the Board of Trustees is Andrew Alper, and the President of the university is Robert Zimmer. In December 2013 it was announced that the Director of Argonne National Laboratory, Eric Isaacs, would become Provost. Isaacs was replaced as Provost in March 2016 by Daniel Diermeier. ", "questions": [{"question": "Who runs the University of Chicago?", "is_impossible": false}, {"question": "How many people belong to the university's Board of Trustees?", "is_impossible": false}, {"question": "How many Vice Presidents are in the Board of Trustees?", "is_impossible": false}, {"question": "What is the name of the Chairman of the Board of Trustees?", "is_impossible": false}, {"question": "Who took Isaacs place as Provost in 2016?", "is_impossible": false}, {"question": "Who governs the University of Zimmer?", "is_impossible": true}, {"question": "What does the Board of Presidents oversee?", "is_impossible": true}, {"question": "Along with managing student laboratories, what else does the Board of Trustees do?", "is_impossible": true}, {"question": "Which body is composed of 2009 members?", "is_impossible": true}, {"question": "Diermeier was replaced as Provost by who?", "is_impossible": true}]}, {"id": "24_14", "context": "The academic bodies of the University of Chicago consist of the College, four divisions of graduate research and seven professional schools. The university also contains a library system, the University of Chicago Press, the University of Chicago Laboratory Schools, and the University of Chicago Medical Center, and holds ties with a number of independent academic institutions, including Fermilab, Argonne National Laboratory, and the Marine Biological Laboratory. The university is accredited by The Higher Learning Commission.", "questions": [{"question": "Who is the university accredited by?", "is_impossible": false}, {"question": "The academic body of the university is made up of how many divisions of graduate?", "is_impossible": false}, {"question": "The academic body of the university is made up of how many professional schools?", "is_impossible": false}, {"question": "How many divisions of graduate research does the University of Higher Learning consist of?", "is_impossible": true}, {"question": "How many professional schools does the University of Higher Learning consist of?", "is_impossible": true}, {"question": "The U of C has ties to several dependent institutions, including?", "is_impossible": true}, {"question": "By which Commission is the University of Chicago Press accredited?", "is_impossible": true}, {"question": "What do the academic bodies of the University of Chicago Medical Center consist of?", "is_impossible": true}]}, {"id": "24_15", "context": "The College of the University of Chicago grants Bachelor of Arts and Bachelor of Science degrees in 50 academic majors and 28 minors. The college's academics are divided into five divisions: the Biological Sciences Collegiate Division, the Physical Sciences Collegiate Division, the Social Sciences Collegiate Division, the Humanities Collegiate Division, and the New Collegiate Division. The first four are sections within their corresponding graduate divisions, while the New Collegiate Division administers interdisciplinary majors and studies which do not fit in one of the other four divisions.", "questions": [{"question": "How many academic majors does the university grant in total?", "is_impossible": false}, {"question": "How many academic minors does the university grant in total?", "is_impossible": false}, {"question": "How many divisions make up the academics of the university?", "is_impossible": false}, {"question": "What division offers more then one branch of studies that don't fit in with the other four?", "is_impossible": false}, {"question": "The College grants Bachelor of Science/Arts degrees in 28 majors and how many minors?", "is_impossible": true}, {"question": "The College grants Bachelor of Science/Arts degrees in 50 minors and how many majors?", "is_impossible": true}, {"question": "Which University's College grants academic majors in 30 subject areas?", "is_impossible": true}, {"question": "Which University's College grants academic minors in 50 subject areas?", "is_impossible": true}, {"question": "The college's University is divided into how many divisions?", "is_impossible": true}]}, {"id": "24_16", "context": "Undergraduate students are required to take a distribution of courses to satisfy the university's core curriculum known as the Common Core. In 2012-2013, the Core classes at Chicago were limited to 17 students, and are generally led by a full-time professor (as opposed to a teaching assistant). As of the 2013–2014 school year, 15 courses and demonstrated proficiency in a foreign language are required under the Core. Undergraduate courses at the University of Chicago are known for their demanding standards, heavy workload and academic difficulty; according to Uni in the USA, \"Among the academic cream of American universities – Harvard, Yale, Princeton, MIT, and the University of Chicago – it is UChicago that can most convincingly claim to provide the most rigorous, intense learning experience.\"", "questions": [{"question": "What is the name of the university's core curriculum?", "is_impossible": false}, {"question": "During 2012-2013, how many student were able to take the Core classes at a single time?", "is_impossible": false}, {"question": "UChicago claims to have what kind of learning experience compared to other universities? ", "is_impossible": false}, {"question": "What guide states the Univeristy of Chicago is known for their heavy workload and academic difficulty?", "is_impossible": false}, {"question": "What are undergraduates required to take to satisfy the Chicago Core curriculum?", "is_impossible": true}, {"question": "During what time frame were the core classes limited to only 15 students?", "is_impossible": true}, {"question": "As of 2017, how many courses are required under Core?", "is_impossible": true}, {"question": "Other than requiring 17 classes, what else is required under Core as of 2013-2014?", "is_impossible": true}, {"question": "What are graduate courses at the U of C known for?", "is_impossible": true}]}, {"id": "24_17", "context": "The university runs a number of academic institutions and programs apart from its undergraduate and postgraduate schools. It operates the University of Chicago Laboratory Schools (a private day school for K-12 students and day care), the Sonia Shankman Orthogenic School (a residential treatment program for those with behavioral and emotional problems), and four public charter schools on the South Side of Chicago administered by the university's Urban Education Institute. In addition, the Hyde Park Day School, a school for students with learning disabilities, maintains a location on the University of Chicago campus. Since 1983, the University of Chicago has maintained the University of Chicago School Mathematics Project, a mathematics program used in urban primary and secondary schools. The university runs a program called the Council on Advanced Studies in the Social Sciences and Humanities, which administers interdisciplinary workshops to provide a forum for graduate students, faculty, and visiting scholars to present scholarly work in progress. The university also operates the University of Chicago Press, the largest university press in the United States.", "questions": [{"question": "What is the name of the private day school for K-12 students the university runs?", "is_impossible": false}, {"question": "What is the name of the residential treatment program the university runs?", "is_impossible": false}, {"question": "How many public charter schools does the university run?", "is_impossible": false}, {"question": "What does the Urban Education Institute help run?", "is_impossible": false}, {"question": "Where is the Hyde Park Day School located?", "is_impossible": false}, {"question": "Apart from its mathematics and postgraduate schools, what else doe the university run?", "is_impossible": true}, {"question": "What is the name for the public day school and day care for K-12 students?", "is_impossible": true}, {"question": "What has the U of C maintained since 1938?", "is_impossible": true}, {"question": "What is the name for the social science program used in urban primary and secondary schools?", "is_impossible": true}, {"question": "Which is the largest university press in the South Side?", "is_impossible": true}]}, {"id": "24_18", "context": "The University of Chicago Library system encompasses six libraries that contain a total of 9.8 million volumes, the 11th most among library systems in the United States. The university's main library is the Regenstein Library, which contains one of the largest collections of print volumes in the United States. The Joe and Rika Mansueto Library, built in 2011, houses a large study space and an automatic book storage and retrieval system. The John Crerar Library contains more than 1.3 million volumes in the biological, medical and physical sciences and collections in general science and the philosophy and history of science, medicine, and technology. The university also operates a number of special libraries, including the D'Angelo Law Library, the Social Service Administration Library, and the Eckhart Library for mathematics and computer science, which closed temporarily for renovation on July 8, 2013. Harper Memorial Library no longer contains any volumes; however it is, in addition to the Regenstein Library, a 24-hour study space on campus.", "questions": [{"question": "The University of Chicago Library system has how many libraries in total?", "is_impossible": false}, {"question": "How man volumes does the The University of Chicago Library system hold?", "is_impossible": false}, {"question": "What is the name given to the university's main library?", "is_impossible": false}, {"question": "In what year was the Joe and Rika Mansueto Library constructed?", "is_impossible": false}, {"question": "How many volumes does the John Crerar Library roughly hold?", "is_impossible": false}, {"question": "Which University's library system consists of 12 libraries?", "is_impossible": true}, {"question": "Which University's library system has over 10 millionvolumes?", "is_impossible": true}, {"question": "Which University ranks having the 9th most number of volumes in the US?", "is_impossible": true}, {"question": "In what year was the D'Angelo and Rika Library built?", "is_impossible": true}]}, {"id": "24_19", "context": "The university operates 12 research institutes and 113 research centers on campus. Among these are the Oriental Institute—a museum and research center for Near Eastern studies owned and operated by the university—and a number of National Resource Centers, including the Center for Middle Eastern Studies. Chicago also operates or is affiliated with a number of research institutions apart from the university proper. The university partially manages Argonne National Laboratory, part of the United States Department of Energy's national laboratory system, and has a joint stake in Fermilab, a nearby particle physics laboratory, as well as a stake in the Apache Point Observatory in Sunspot, New Mexico. Faculty and students at the adjacent Toyota Technological Institute at Chicago collaborate with the university, In 2013, the university announced that it was affiliating the formerly independent Marine Biological Laboratory in Woods Hole, Mass. Although formally unrelated, the National Opinion Research Center is located on Chicago's campus.", "questions": [{"question": "How many research institutes does the university run on campus?", "is_impossible": false}, {"question": "How many research centers does the university run on campus?", "is_impossible": false}, {"question": "What is the name of the museum and research center for Near Eastern studies, that is owned by the university?", "is_impossible": false}, {"question": "What lab does the university have a joint stake in? ", "is_impossible": false}, {"question": "Where is the Apache Point Observatory located?", "is_impossible": false}, {"question": "Aside from 113 research institutes, how many research centers does the U of C operate?", "is_impossible": true}, {"question": "Aside from 12 research centers, how many research institutes does the U of C operate?", "is_impossible": true}, {"question": "Which institute is a center for Near Western studies?", "is_impossible": true}, {"question": "In which Illinois city is the Marine Biological Laboratory located?", "is_impossible": true}, {"question": "On which Woods Hole campus is the National Opinion Research Center located?", "is_impossible": true}]}, {"id": "24_20", "context": "The University of Chicago has been the site of some important experiments and academic movements. In economics, the university has played an important role in shaping ideas about the free market and is the namesake of the Chicago school of economics, the school of economic thought supported by Milton Friedman and other economists. The university's sociology department was the first independent sociology department in the United States and gave birth to the Chicago school of sociology. In physics, the university was the site of the Chicago Pile-1 (the first self-sustained man-made nuclear reaction, part of the Manhattan Project), of Robert Millikan's oil-drop experiment that calculated the charge of the electron, and of the development of radiocarbon dating by Willard F. Libby in 1947. The chemical experiment that tested how life originated on early Earth, the Miller–Urey experiment, was conducted at the university. REM sleep was discovered at the university in 1953 by Nathaniel Kleitman and Eugene Aserinsky.", "questions": [{"question": "What role in economics did the university play a major part in?", "is_impossible": false}, {"question": "What was the name of the first self-sustained man-made nuclear reaction?", "is_impossible": false}, {"question": "What was the name of the experiment that tested how life originated?", "is_impossible": false}, {"question": "When was REM sleep discovered?", "is_impossible": false}, {"question": "Why was the Kleitman-Aserinsky experiment conducted?", "is_impossible": true}, {"question": "When was the Miller-Urey experiment conducted?", "is_impossible": true}, {"question": "What kind of sleep was discovered at the U of C in 1947?", "is_impossible": true}, {"question": "What was the experiment that tested early life on Mars called?", "is_impossible": true}, {"question": "What gave way to the Chicago school of psychology?", "is_impossible": true}]}, {"id": "24_21", "context": "The UChicago Arts program joins academic departments and programs in the Division of the Humanities and the College, as well as professional organizations including the Court Theatre, the Oriental Institute, the Smart Museum of Art, the Renaissance Society, University of Chicago Presents, and student arts organizations. The university has an artist-in-residence program and scholars in performance studies, contemporary art criticism, and film history. It has offered a doctorate in music composition since 1933 and in Cinema & Media studies since 2000, a master of fine arts in visual arts (early 1970s), and a master of arts in the humanities with a creative writing track (2000). It has bachelor's degree programs in visual arts, music, and art history, and, more recently, Cinema & Media studies (1996) and theater & performance studies (2002). The College's general education core includes a “dramatic, music, and visual arts” requirement, requiring students to study the history of the arts, stage desire, or begin working with sculpture. Several thousand major and non-major undergraduates enroll annually in creative and performing arts classes. UChicago is often considered the birthplace of improvisational comedy as the Compass Players student comedy troupe evolved into The Second City improv theater troupe in 1959. The Reva and David Logan Center for the Arts opened in October 2012, five years after a $35 million gift from alumnus David Logan and his wife Reva. The center includes spaces for exhibitions, performances, classes, and media production. The Logan Center was designed by Tod Williams and Billie Tsien. This building is actually entirely glass. The brick is a facade designed to keep the glass safe from the wind. The architects later removed sections of the bricks when pressure arose in the form of complaints that the views of the city were blocked.", "questions": [{"question": "Since what year did the university offer a doctorate in music composition?", "is_impossible": false}, {"question": "Since what year did the university offer a doctorate in Cinema & Media studies?", "is_impossible": false}, {"question": "When did the university start having a bachelor's degree program in Cinema & Media studies?", "is_impossible": false}, {"question": "When did the university start having a bachelor's degree program in theater & performance studies?", "is_impossible": false}, {"question": "Around roughly how many students enroll yearly in creative and performing arts classes?", "is_impossible": false}, {"question": "What doctorate program has been offered since 1996?", "is_impossible": true}, {"question": "The university has masters programs in visual arts, music and what other subjects?", "is_impossible": true}, {"question": "The university has bachelor programs in fine arts in visual arts and what other subject?", "is_impossible": true}, {"question": "What type of requirement does the College's common core require?", "is_impossible": true}, {"question": "In what year did the Williams and Logan Center open?", "is_impossible": true}]}, {"id": "24_22", "context": "In the fall quarter of 2014, the University of Chicago enrolled 5,792 students in the College, 3,468 students in its four graduate divisions, 5,984 students in its professional schools, and 15,244 students overall. In the 2012 Spring Quarter, international students comprised almost 19% of the overall study body, over 26% of students were domestic ethnic minorities, and about 44% of enrolled students were female. Admissions to the University of Chicago is highly selective. The middle 50% band of SAT scores for the undergraduate class of 2015, excluding the writing section, was 1420–1530, the average MCAT score for entering students in the Pritzker School of Medicine in 2011 was 36, and the median LSAT score for entering students in the Law School in 2011 was 171. In 2015, the College of the University of Chicago had an acceptance rate of 7.8% for the Class of 2019, the lowest in the college's history.", "questions": [{"question": "In the fall quarter of 2014, how many students signed up for the college?", "is_impossible": false}, {"question": "In the fall quarter of 2014, how many students signed up for the university's four graduate divisions?", "is_impossible": false}, {"question": "In the fall quarter of 2014, how many students signed up for the university's professional schools?", "is_impossible": false}, {"question": "In the fall quarter of 2014, how many students signed up for the university's  in total?", "is_impossible": false}, {"question": "Who made up 19% of the student body in the 2012 Spring Quarter? ", "is_impossible": false}, {"question": "How many students enrolled at the College during the spring of 2014?", "is_impossible": true}, {"question": "The University enrolled 3,468 students in the College  and how many in it's graduate divisions?", "is_impossible": true}, {"question": "How many students did the University enroll in its five graduate divisions in 2014?", "is_impossible": true}, {"question": "The University enrolled 5,984 students in the College  and how many in its professional schools?", "is_impossible": true}, {"question": "What year did the College have the highest acceptance rate in its history?", "is_impossible": true}]}, {"id": "24_23", "context": "The Maroons compete in the NCAA's Division III as members of the University Athletic Association (UAA). The university was a founding member of the Big Ten Conference and participated in the NCAA Division I Men's Basketball and Football and was a regular participant in the Men's Basketball tournament. In 1935, the University of Chicago reached the Sweet Sixteen. In 1935, Chicago Maroons football player Jay Berwanger became the first winner of the Heisman Trophy. However, the university chose to withdraw from the conference in 1946 after University President Robert Maynard Hutchins de-emphasized varsity athletics in 1939 and dropped football. (In 1969, Chicago reinstated football as a Division III team, resuming playing its home games at the new Stagg Field.)", "questions": [{"question": "The Maroons are apart of what association?", "is_impossible": false}, {"question": "The Maroons compete in what league division?", "is_impossible": false}, {"question": "The university was a founding force behind what conference?", "is_impossible": false}, {"question": "What player first won the Heisman Trophy for the university?", "is_impossible": false}, {"question": "Why did the university eventually leave the conference?", "is_impossible": false}, {"question": "What kind of member what the University to the Big Twelve Conference?", "is_impossible": true}, {"question": "When did the University reach the Sweet Seventeen?", "is_impossible": true}, {"question": "When did Robert Hutchins become the first Heisman Trophy winner?", "is_impossible": true}, {"question": "When did Jay Berwanger win the Maynard Trophy?", "is_impossible": true}, {"question": "In what did the President re-emphasize athletics at the university?", "is_impossible": true}]}, {"id": "24_24", "context": "Students at the University of Chicago run over 400 clubs and organizations known as Recognized Student Organizations (RSOs). These include cultural and religious groups, academic clubs and teams, and common-interest organizations. Notable extracurricular groups include the University of Chicago College Bowl Team, which has won 118 tournaments and 15 national championships, leading both categories internationally. The university's competitive Model United Nations team was the top ranked team in North America in 2013-14 and 2014-2015. Among notable RSOs are the nation's longest continuously running student film society Doc Films, organizing committee for the University of Chicago Scavenger Hunt, the twice-weekly student newspaper The Chicago Maroon, the alternative weekly student newspaper South Side Weekly, the nation's second oldest continuously running student improvisational theater troupe Off-Off Campus, and the university-owned radio station WHPK.", "questions": [{"question": "Roughly how many clubs are ran at the university?", "is_impossible": false}, {"question": "What is the name of the organization in charge of running the clubs at the university?", "is_impossible": false}, {"question": "What club won 118 tournaments and 15 national championships?", "is_impossible": false}, {"question": "What is the name of the country's longest continuously running student film society?", "is_impossible": false}, {"question": "What is the name of the student improvisational theater troupe?", "is_impossible": false}, {"question": "How many clubs do the students at the University of Model United Nations run?", "is_impossible": true}, {"question": "What are the over 118 clubs run by students at the U of C called collectively?", "is_impossible": true}, {"question": "When was the RSO Nations team the top ranked in North America?", "is_impossible": true}, {"question": "When was the Model United Nations team ranked second in North America?", "is_impossible": true}, {"question": "During what years was the Model United Nations team ranked first in South America?", "is_impossible": true}]}, {"id": "24_25", "context": "All Recognized Student Organizations, from the University of Chicago Scavenger Hunt to Model UN, in addition to academic teams, sports club, arts groups, and more are funded by The University of Chicago Student Government. Student Government is made up of graduate and undergraduate students elected to represent members from their respective academic unit. It is led by an Executive Committee, chaired by a President with the assistance of two Vice Presidents, one for Administration and the other for Student Life, elected together as a slate by the student body each spring. Its annual budget is greater than $2 million.", "questions": [{"question": "Who makes up the Student Government?", "is_impossible": false}, {"question": "Who leads the Student Government?", "is_impossible": false}, {"question": "How many vice presidents are on the Student Board?", "is_impossible": false}, {"question": "Roughly how much is the Student Government's budget?", "is_impossible": false}, {"question": "What organizations are funded by the student government?", "is_impossible": true}, {"question": "The Chicago government is made up of what type of students?", "is_impossible": true}, {"question": "Who are members of the sports club elected to represent?", "is_impossible": true}, {"question": "The student government is led by the president and chaired by who?", "is_impossible": true}, {"question": "What is the annual budget for the Scavenger Hunt?", "is_impossible": true}]}, {"id": "24_26", "context": "There are fifteen fraternities and seven sororities at the University of Chicago, as well as one co-ed community service fraternity, Alpha Phi Omega. Four of the sororities are members of the National Panhellenic Conference, and ten of the fraternities form the University of Chicago Interfraternity Council. In 2002, the Associate Director of Student Activities estimated that 8–10 percent of undergraduates were members of fraternities or sororities. The student activities office has used similar figures, stating that one in ten undergraduates participate in Greek life.", "questions": [{"question": "How many fraternities are apart of the university?", "is_impossible": false}, {"question": "How many sororities are apart of the university?", "is_impossible": false}, {"question": "What is the name of the co-ed community service fraternity?", "is_impossible": false}, {"question": "How many sororities belong to the National Panhellenic Conference?", "is_impossible": false}, {"question": "How many fraternities form the University of Chicago Interfraternity Council?", "is_impossible": false}, {"question": "Along with 15 sororities, how many fraternities does the U of C have?", "is_impossible": true}, {"question": "Along with 7 fraternities, how many sororities does the U of C have?", "is_impossible": true}, {"question": "What are ten of the sororities members of?", "is_impossible": true}, {"question": "What do four of the fraternities form?", "is_impossible": true}, {"question": "In what year did Alpha Phi Omega estimate that about 10% of students participated in sororities/fraternities?", "is_impossible": true}]}, {"id": "24_27", "context": "Every May since 1987, the University of Chicago has held the University of Chicago Scavenger Hunt, in which large teams of students compete to obtain notoriously esoteric items from a list. Since 1963, the Festival of the Arts (FOTA) takes over campus for 7–10 days of exhibitions and interactive artistic endeavors. Every January, the university holds a week-long winter festival, Kuviasungnerk/Kangeiko, which include early morning exercise routines and fitness workshops. The university also annually holds a summer carnival and concert called Summer Breeze that hosts outside musicians, and is home to Doc Films, a student film society founded in 1932 that screens films nightly at the university. Since 1946, the university has organized the Latke-Hamantash Debate, which involves humorous discussions about the relative merits and meanings of latkes and hamantashen.", "questions": [{"question": "In what month is the university's scavenger hunt?", "is_impossible": false}, {"question": "In what year did the scavenger hunt begin?", "is_impossible": false}, {"question": "What does FOTA stand for?", "is_impossible": false}, {"question": "What is the name of the winter festival held in January that is based on fitness? ", "is_impossible": false}, {"question": "What is the name of the university's summer festival?", "is_impossible": false}, {"question": "What has the university held since 1963 where large teams find items from a list?", "is_impossible": true}, {"question": "What has been held since 1987, taking over the campus for 7-10 days with exhibitions?", "is_impossible": true}, {"question": "What is held ever February at the university?", "is_impossible": true}, {"question": "What is the university's winter carnival and concert called?", "is_impossible": true}, {"question": "Which debate has been organized by the U of C since 1987?", "is_impossible": true}]}, {"id": "24_28", "context": "In business, notable alumni include Microsoft CEO Satya Nadella, Oracle Corporation founder and the third richest man in America Larry Ellison, Goldman Sachs and MF Global CEO as well as former Governor of New Jersey Jon Corzine, McKinsey & Company founder and author of the first management accounting textbook James O. McKinsey, Arley D. Cathey, Bloomberg L.P. CEO Daniel Doctoroff, Credit Suisse CEO Brady Dougan, Morningstar, Inc. founder and CEO Joe Mansueto, Chicago Cubs owner and chairman Thomas S. Ricketts, and NBA commissioner Adam Silver.", "questions": [{"question": "What Microsoft CEO is also an alumni of the University of Chicago?", "is_impossible": false}, {"question": "Who was the founder of the Oracle Corporation?", "is_impossible": false}, {"question": "Who is the third riches man in America?", "is_impossible": false}, {"question": "What Goldman Sachs CEO is also an alumni of the University of Chicago?", "is_impossible": false}, {"question": "Who founded McKinsey & Company?", "is_impossible": false}, {"question": "Who is the founder of Microsoft and the third richest man in America?", "is_impossible": true}, {"question": "Who is the CEO of Microsoft and also served as Governor in NJ?", "is_impossible": true}, {"question": "Who is the founder of the Chicago Cubs and author of the first management accounting text book?", "is_impossible": true}, {"question": "Who is the chairman of Microsoft as well as the NBA commissioner?", "is_impossible": true}, {"question": "Who serves as Microsoft and MF Global CEO?", "is_impossible": true}]}, {"id": "24_29", "context": "Notable alumni in the field of government and politics include the founder of modern community organizing Saul Alinsky, Obama campaign advisor and top political advisor to President Bill Clinton David Axelrod, Attorney General and federal judge Robert Bork, Attorney General Ramsey Clark, Prohibition agent Eliot Ness, Supreme Court Justice John Paul Stevens, Prime Minister of Canada William Lyon Mackenzie King, 11th Prime Minister of Poland Marek Belka, Governor of the Bank of Japan Masaaki Shirakawa, the first female African-American Senator Carol Moseley Braun, United States Senator from Vermont and 2016 Democratic Presidential Candidate Bernie Sanders, and former World Bank President Paul Wolfowitz.", "questions": [{"question": "Who is the founder of modern community organizing?", "is_impossible": false}, {"question": "What alumni was also Obama's campaign adviser?", "is_impossible": false}, {"question": "What alumni was also an Attorney General and a federal judge?", "is_impossible": false}, {"question": "What alumni is also the Governor of the Bank of Japan?", "is_impossible": false}, {"question": "What prohibition agent was also an alumni at the university?", "is_impossible": false}, {"question": "Who is the Attorney General and Obama Campaign advisor?", "is_impossible": true}, {"question": "Who serves as Attorney General as well as top political advisor to the President?", "is_impossible": true}, {"question": "Who is the 12th Prime Minister of Poland?", "is_impossible": true}, {"question": "Who is the Governor of the Bank of Justice?", "is_impossible": true}, {"question": "Who is the first Japanese Senator?", "is_impossible": true}]}, {"id": "24_30", "context": "In literature, author of the New York Times bestseller Before I Fall Lauren Oliver, Pulitzer Prize winning novelist Philip Roth, Canadian-born Pulitzer Prize and Nobel Prize for Literature winning writer Saul Bellow, political philosopher, literary critic and author of the New York Times bestseller \"The Closing of the American Mind\" Allan Bloom, ''The Good War\" author Studs Terkel, American writer, essayist, filmmaker, teacher, and political activist Susan Sontag, analytic philosopher and Stanford University Professor of Comparative Literature Richard Rorty, and American writer and satirist Kurt Vonnegut are notable alumni.", "questions": [{"question": "What alumni member also write the bestseller Before I Fall?", "is_impossible": false}, {"question": "What is the name of the Pulitzer Prize novelist who was also a university alumni? ", "is_impossible": false}, {"question": "What alumni wrote \"The Closing of the American Mind\"?", "is_impossible": false}, {"question": "What alumni wrote \"The Good War\"?", "is_impossible": false}, {"question": "What is the name of the American writer and satirist who is also a university alumni?", "is_impossible": false}, {"question": "Who won the Pullitzer Prize as well as the Nobel Prize?", "is_impossible": true}, {"question": "Who wrote the American Times bestselling book titled \"The Closing of the American Mind\"?", "is_impossible": true}, {"question": "Who wrote \"The American War\"?", "is_impossible": true}, {"question": "Who wrote the book titled \"Before I Fall\" which was a University bestseller?", "is_impossible": true}, {"question": "Who wrote \"The closing of the Good War\"?", "is_impossible": true}]}, {"id": "24_31", "context": "In the arts and entertainment, minimalist composer Philip Glass, dancer, choreographer and leader in the field of dance anthropology Katherine Dunham, Bungie founder and developer of the Halo video game series Alex Seropian, Serial host Sarah Koenig, actor Ed Asner, Pulitzer Prize for Criticism winning film critic and the subject of the 2014 documentary film Life Itself Roger Ebert, director, writer, and comedian Mike Nichols, film director and screenwriter Philip Kaufman, and Carl Van Vechten, photographer and writer, are graduates.", "questions": [{"question": "What minimalist composer is also a university graduate?", "is_impossible": false}, {"question": "What is the name of the Bungie Inc. founder who is also a university graduate?", "is_impossible": false}, {"question": "What video game series did Alex Seropian make?", "is_impossible": false}, {"question": "What American actor is also a university graduate?", "is_impossible": false}, {"question": "What comedian is also a university graduate? ", "is_impossible": false}, {"question": "Who is the Bungie founder and developer of the dance video game?", "is_impossible": true}, {"question": "Who is an actor and also Serial host?", "is_impossible": true}, {"question": "Who is an award winning photographer and writer?", "is_impossible": true}, {"question": "Who directed Life Itself?", "is_impossible": true}]}, {"id": "24_32", "context": "In science, alumni include astronomers Carl Sagan, a prominent contributor to the scientific research of extraterrestrial life, and Edwin Hubble, known for \"Hubble's Law\", NASA astronaut John M. Grunsfeld, geneticist James Watson, best known as one of the co-discoverers of the structure of DNA, experimental physicist Luis Alvarez, popular environmentalist David Suzuki, balloonist Jeannette Piccard, biologists Ernest Everett Just and Lynn Margulis, computer scientist Richard Hamming, the creator of the Hamming Code, lithium-ion battery developer John B. Goodenough, mathematician and Fields Medal recipient Paul Joseph Cohen, and geochemist Clair Cameron Patterson, who developed the uranium-lead dating method into lead-lead dating. Nuclear physicist and researcher Stanton Friedman, who worked on some early projects involving nuclear-powered spacecraft propulsion systems, is also a graduate (M.Sc).", "questions": [{"question": "What astronomers is also a university alumni member?", "is_impossible": false}, {"question": "What NASA astronaut is also a university alumni member?", "is_impossible": false}, {"question": "What popular environmentalist is also a university alumni member?", "is_impossible": false}, {"question": "Who developed the lithium-ion battery?", "is_impossible": false}, {"question": "What geochemist developed the uranium-lead dating method into lead-lead dating?", "is_impossible": false}, {"question": "What astronomer is a Hamming Code alumni?", "is_impossible": true}, {"question": "What DNA astronaut is also a U of C alumni?", "is_impossible": true}, {"question": "Who was the developer of the Hamming battery?", "is_impossible": true}, {"question": "Who developed the lithium ion battery which let to lead-lead dating?", "is_impossible": true}]}, {"id": "24_33", "context": "In economics, notable Nobel Memorial Prize in Economic Sciences winners Milton Friedman, a major advisor to Republican U.S. President Ronald Reagan and Conservative British Prime Minister Margaret Thatcher, George Stigler, Nobel laureate and proponent of regulatory capture theory, Gary Becker, an important contributor to the family economics branch of economics, Herbert A. Simon, responsible for the modern interpretation of the concept of organizational decision-making, Paul Samuelson, the first American to win the Nobel Memorial Prize in Economic Sciences, and Eugene Fama, known for his work on portfolio theory, asset pricing and stock market behaviour, are all graduates. American economist, social theorist, political philosopher, and author Thomas Sowell is also an alumnus.", "questions": [{"question": "What Nobel Memorial Prize in Economic Sciences winner is also a university alumni member?", "is_impossible": false}, {"question": "What British Prime minister advisor is also a university alumni member?", "is_impossible": false}, {"question": "Who was the first American to win the Nobel Memorial Prize in Economic Sciences?", "is_impossible": false}, {"question": "What university alumni member was known for his work on portfolio theory?", "is_impossible": false}, {"question": "Which Nobel Memorial Prize in British Sciences is an alumni?", "is_impossible": true}, {"question": "What US Prime Minister is an alumni?", "is_impossible": true}, {"question": "Who is known for working on portfolio capture theory?", "is_impossible": true}, {"question": "Name the British economist, theorist and philosopher who is also an author and alumni?", "is_impossible": true}, {"question": "Who was responsible for the ancient interpretation of organizational decision making?", "is_impossible": true}]}, {"id": "24_34", "context": "Other prominent alumni include anthropologists David Graeber and Donald Johanson, who is best known for discovering the fossil of a female hominid australopithecine known as \"Lucy\" in the Afar Triangle region, psychologist John B. Watson, American psychologist who established the psychological school of behaviorism, communication theorist Harold Innis, chess grandmaster Samuel Reshevsky, and conservative international relations scholar and White House Coordinator of Security Planning for the National Security Council Samuel P. Huntington.", "questions": [{"question": "What anthropologists are also university alumni members?", "is_impossible": false}, {"question": "What chess grandmaster is also a university alumni?", "is_impossible": false}, {"question": "What conservative international relations scholar is also a university alumni?", "is_impossible": false}, {"question": "Who are best known for uncovering the fossil of John B Watson?", "is_impossible": true}, {"question": "Who did John B Watson and David Graeber discover a fossil of?", "is_impossible": true}, {"question": "The male fossil known as Lucy was discovered by who?", "is_impossible": true}, {"question": "Who is the White House Coordinator of Security Planning and also an anthropologist?", "is_impossible": true}, {"question": "Who established the psychological school of conservative international relations?", "is_impossible": true}]}, {"id": "24_35", "context": "Notable faculty in physics have included the speed of light calculator A. A. Michelson, elementary charge calculator Robert A. Millikan, discoverer of the Compton Effect Arthur H. Compton, the creator of the first nuclear reactor Enrico Fermi, \"the father of the hydrogen bomb\" Edward Teller, \"one of the most brilliant and productive experimental physicists of the twentieth century\" Luis Walter Alvarez, Murray Gell-Mann who introduced the quark, second female Nobel laureate Maria Goeppert-Mayer, the youngest American winner of the Nobel Prize Tsung-Dao Lee, and astrophysicist Subrahmanyan Chandrasekhar.", "questions": [{"question": "Who calculated the speed of light?", "is_impossible": false}, {"question": "Who discovered the Compton Effect?", "is_impossible": false}, {"question": "Who invented the first nuclear reactor?", "is_impossible": false}, {"question": "Who is also known at the father of the hydrogen bomb?", "is_impossible": false}, {"question": "Who was the second female Nobel laureate ?", "is_impossible": false}, {"question": "Who is known for calculating the speed of nuclear reactions?", "is_impossible": true}, {"question": "Who discovered the AA Michelson effect?", "is_impossible": true}, {"question": "Who is known for inventing the first elementary charge calculator?", "is_impossible": true}, {"question": "Who is known as the father of the hydrogen atom?", "is_impossible": true}, {"question": "Who was the first female laureate winner?", "is_impossible": true}]}, {"id": "24_36", "context": "Past faculty have also included Egyptologist James Henry Breasted, mathematician Alberto Calderón, Nobel prize winning economist and classical liberalism defender Friedrich Hayek, meteorologist Ted Fujita, chemists Glenn T. Seaborg, the developer of the actinide concept and Nobel Prize winner Yuan T. Lee, Nobel Prize winning novelist Saul Bellow, political philosopher and author Allan Bloom, cancer researchers Charles Brenton Huggins and Janet Rowley, astronomer Gerard Kuiper, one of the most important figures in the early development of the discipline of linguistics Edward Sapir, and the founder of McKinsey & Co., James O. McKinsey.", "questions": [{"question": "What Egyptologist was also apart of the university's faculty?", "is_impossible": false}, {"question": "What mathematician was also apart of the university's faculty?", "is_impossible": false}, {"question": "What meteorologist was also apart of the university's faculty?", "is_impossible": false}, {"question": "Who developed the actinide concept?", "is_impossible": false}, {"question": "What cancer researchers were also apart of the university's faculty?", "is_impossible": false}, {"question": "Who is a Nobel prize winning prior novelist?", "is_impossible": true}, {"question": "Who is the founder of T. Seaborg and Co.?", "is_impossible": true}, {"question": "Who is the developer of the McKinsey concept?", "is_impossible": true}, {"question": "What Nobel Prize researchers are former faculty members?", "is_impossible": true}, {"question": "Who was a political philosopher, mathematician, author and also former faculty member?", "is_impossible": true}]}, {"id": "24_37", "context": "Current faculty include the anthropologist Marshall Sahlins, historian Dipesh Chakrabarty, paleontologists Neil Shubin and Paul Sereno, evolutionary biologist Jerry Coyne, Nobel prize winning physicist Yoichiro Nambu, Nobel prize winning physicist James Cronin, Nobel Prize winning economists Eugene Fama, James Heckman, Lars Peter Hansen, Roger Myerson and Robert Lucas, Jr., Freakonomics author and noted economist Steven Levitt, current governor of India's central bank Raghuram Rajan, the 74th United States Secretary of the Treasury and former Goldman Sachs Chairman and CEO Hank Paulson, former Chairman of President Barack Obama's Council of Economic Advisors Austan Goolsbee, Shakespeare scholar David Bevington, and renowned political scientists John Mearsheimer and Robert Pape.", "questions": [{"question": "Hank Paulson is the former Chairman and CEO of what banking firm?", "is_impossible": false}, {"question": "Who is the governor of India's central bank?", "is_impossible": false}, {"question": "What Shakespeare scholar is currently on the university's faculty?", "is_impossible": false}, {"question": "What well known political scientists are currently on the university's faculty?", "is_impossible": false}, {"question": "What paleontologists are currently on the university's faculty?", "is_impossible": false}, {"question": "Who is the current CEO and chairmen of Goldman Sachs?", "is_impossible": true}, {"question": "Who is the current Chairman of President Barack Obama's Council of Economic Advisors?", "is_impossible": true}, {"question": "Who governs Nobel Prize central bank?", "is_impossible": true}, {"question": "Who wrote Freakonomics and is also an anthropologist?", "is_impossible": true}, {"question": "Who is the 75th United States Secretary of the Treasury?", "is_impossible": true}]}]}
