{"data": [{"id": "26_1", "context": "The immune system is a system of many biological structures and processes within an organism that protects against disease. To function properly, an immune system must detect a wide variety of agents, known as pathogens, from viruses to parasitic worms, and distinguish them from the organism's own healthy tissue. In many species, the immune system can be classified into subsystems, such as the innate immune system versus the adaptive immune system, or humoral immunity versus cell-mediated immunity. In humans, the blood–brain barrier, blood–cerebrospinal fluid barrier, and similar fluid–brain barriers separate the peripheral immune system from the neuroimmune system which protects the brain.", "questions": [{"question": "The immune system protects organisms against what?", "is_impossible": false}, {"question": "What are the agents the immune system detects known as?", "is_impossible": false}, {"question": "Which part of the immune system protects the brain?", "is_impossible": false}, {"question": "What separates the neuroimmune system and peripheral immune system in humans?", "is_impossible": false}, {"question": "What are the agents detected by the immune system called?", "is_impossible": false}, {"question": "What are the two different types of immunity?", "is_impossible": false}, {"question": "What are the two major subsystems of the immune system?", "is_impossible": false}, {"question": "What is the immune system of the brained known as?", "is_impossible": false}, {"question": "What is the system of many biological structures and processes that protect an organism from cold?", "is_impossible": true}, {"question": "What is not an example of a pathogen?", "is_impossible": true}, {"question": "What is the immune system unable to distinguish from healthy tissue?", "is_impossible": true}, {"question": "What is the immune system of the stomach known as?", "is_impossible": true}, {"question": "What connects the peripheral immune system to the neuroimmune system?", "is_impossible": true}]}, {"id": "26_2", "context": "Disorders of the immune system can result in autoimmune diseases, inflammatory diseases and cancer. Immunodeficiency occurs when the immune system is less active than normal, resulting in recurring and life-threatening infections. In humans, immunodeficiency can either be the result of a genetic disease such as severe combined immunodeficiency, acquired conditions such as HIV/AIDS, or the use of immunosuppressive medication. In contrast, autoimmunity results from a hyperactive immune system attacking normal tissues as if they were foreign organisms. Common autoimmune diseases include Hashimoto's thyroiditis, rheumatoid arthritis, diabetes mellitus type 1, and systemic lupus erythematosus. Immunology covers the study of all aspects of the immune system.", "questions": [{"question": "What happens when the immune system less active than normal?", "is_impossible": false}, {"question": "What is the term for a hyperactive immune system that attacks normal tissues?", "is_impossible": false}, {"question": "What field involves the study of the immune system?", "is_impossible": false}, {"question": "What acquired condition results in immunodeficiency in humans?", "is_impossible": false}, {"question": "What is not caused by disorders of the immune system?", "is_impossible": true}, {"question": "What kind of medicine can cause autoimmunity?", "is_impossible": true}, {"question": "What causes the immune system to treat foreign organisms like normal tissues?", "is_impossible": true}, {"question": "What is not a condition that causes immunodeficiency?", "is_impossible": true}, {"question": "What is a rare autoimmune disease?", "is_impossible": true}]}, {"id": "26_3", "context": "Immunology is a science that examines the structure and function of the immune system. It originates from medicine and early studies on the causes of immunity to disease. The earliest known reference to immunity was during the plague of Athens in 430 BC. Thucydides noted that people who had recovered from a previous bout of the disease could nurse the sick without contracting the illness a second time. In the 18th century, Pierre-Louis Moreau de Maupertuis made experiments with scorpion venom and observed that certain dogs and mice were immune to this venom. This and other observations of acquired immunity were later exploited by Louis Pasteur in his development of vaccination and his proposed germ theory of disease. Pasteur's theory was in direct opposition to contemporary theories of disease, such as the miasma theory. It was not until Robert Koch's 1891 proofs, for which he was awarded a Nobel Prize in 1905, that microorganisms were confirmed as the cause of infectious disease. Viruses were confirmed as human pathogens in 1901, with the discovery of the yellow fever virus by Walter Reed.", "questions": [{"question": "Who won the Nobel Prize in 1905?", "is_impossible": false}, {"question": "What did Robert Koch prove was the cause of infectious disease?", "is_impossible": false}, {"question": "What virus did Walter Reed discover?", "is_impossible": false}, {"question": "When was the first known historical reference to immunity?", "is_impossible": false}, {"question": "What is a science that examines the structure and function of the brain?", "is_impossible": true}, {"question": "When is the latest known reference to immunity?", "is_impossible": true}, {"question": "What scientist experimented with snake venom in the 18th century?", "is_impossible": true}, {"question": "Whose theories supported the miasma theory?", "is_impossible": true}, {"question": "When did Robert Koch discover the yellow fever virus?", "is_impossible": true}]}, {"id": "26_4", "context": "The immune system protects organisms from infection with layered defenses of increasing specificity. In simple terms, physical barriers prevent pathogens such as bacteria and viruses from entering the organism. If a pathogen breaches these barriers, the innate immune system provides an immediate, but non-specific response. Innate immune systems are found in all plants and animals. If pathogens successfully evade the innate response, vertebrates possess a second layer of protection, the adaptive immune system, which is activated by the innate response. Here, the immune system adapts its response during an infection to improve its recognition of the pathogen. This improved response is then retained after the pathogen has been eliminated, in the form of an immunological memory, and allows the adaptive immune system to mount faster and stronger attacks each time this pathogen is encountered.", "questions": [{"question": "What type of immune systems are found in all plants and animals?", "is_impossible": false}, {"question": "What immune system is activated by the innate response?", "is_impossible": false}, {"question": "What allows the adaptive immune system to react faster and more strongly each subsequent time a pathogen is encountered?", "is_impossible": false}, {"question": "What is the first line of defense against pathogens that prevents them from entering an organism?", "is_impossible": false}, {"question": "What exposes organisms to infection?", "is_impossible": true}, {"question": "What is not prevented from entering an organism?", "is_impossible": true}, {"question": "What is activated before the innate response in vertebrates?", "is_impossible": true}, {"question": "What is gotten rid of after a pathogen has been eliminated?", "is_impossible": true}, {"question": "What causes the organism to attack more slowly and weakly every time a pathogen is encountered?", "is_impossible": true}]}, {"id": "26_5", "context": "Both innate and adaptive immunity depend on the ability of the immune system to distinguish between self and non-self molecules. In immunology, self molecules are those components of an organism's body that can be distinguished from foreign substances by the immune system. Conversely, non-self molecules are those recognized as foreign molecules. One class of non-self molecules are called antigens (short for antibody generators) and are defined as substances that bind to specific immune receptors and elicit an immune response.", "questions": [{"question": "The adaptive immune system must distinguish between what types of molecules?", "is_impossible": false}, {"question": "What molecules are parts of the body of an organism in immunology?", "is_impossible": false}, {"question": "What molecules are recognized as foreign by the immune system?", "is_impossible": false}, {"question": "What term is shorthand for antibody generators?", "is_impossible": false}, {"question": "Antigens bind to what in order to elicit a response of the immune system?", "is_impossible": false}, {"question": "What does not depend on the immune system's ability to distinguish between the self and others?", "is_impossible": true}, {"question": "What is a one class of self molecule?", "is_impossible": true}, {"question": "What can not be distinguished from foreign substances by the immune system?", "is_impossible": true}, {"question": "What do self molecules bind to?", "is_impossible": true}, {"question": "What happens when an antigen fails to bind to an immune receptor?", "is_impossible": true}]}, {"id": "26_6", "context": "Microorganisms or toxins that successfully enter an organism encounter the cells and mechanisms of the innate immune system. The innate response is usually triggered when microbes are identified by pattern recognition receptors, which recognize components that are conserved among broad groups of microorganisms, or when damaged, injured or stressed cells send out alarm signals, many of which (but not all) are recognized by the same receptors as those that recognize pathogens. Innate immune defenses are non-specific, meaning these systems respond to pathogens in a generic way. This system does not confer long-lasting immunity against a pathogen. The innate immune system is the dominant system of host defense in most organisms.", "questions": [{"question": "What part of the innate immune system identifies microbes and triggers immune response?", "is_impossible": false}, {"question": "For most organisms, what is the dominant system of defense?", "is_impossible": false}, {"question": "Pattern recognition receptors recognize components present in broad groups of what?", "is_impossible": false}, {"question": "The innate immune system responds in a generic way, meaning it is what?", "is_impossible": false}, {"question": "What do toxins that fail to enter an organism encounter?", "is_impossible": true}, {"question": "What causes the innate response to be disarmed?", "is_impossible": true}, {"question": "What kind of cells fail to send out alarm signals?", "is_impossible": true}, {"question": "What defenses respond to pathogens in a specific way?", "is_impossible": true}, {"question": "What system gives an organism long lasting immunity against a pathogen?", "is_impossible": true}]}, {"id": "26_7", "context": "Several barriers protect organisms from infection, including mechanical, chemical, and biological barriers. The waxy cuticle of many leaves, the exoskeleton of insects, the shells and membranes of externally deposited eggs, and skin are examples of mechanical barriers that are the first line of defense against infection. However, as organisms cannot be completely sealed from their environments, other systems act to protect body openings such as the lungs, intestines, and the genitourinary tract. In the lungs, coughing and sneezing mechanically eject pathogens and other irritants from the respiratory tract. The flushing action of tears and urine also mechanically expels pathogens, while mucus secreted by the respiratory and gastrointestinal tract serves to trap and entangle microorganisms.", "questions": [{"question": "What is a mechanical barrier in insects that protects the insect?", "is_impossible": false}, {"question": "What is an example of a mechanical barrier on leaves?", "is_impossible": false}, {"question": "What responses protect the lungs by mechanically ejecting pathogens from the respiratory system?", "is_impossible": false}, {"question": "What is secreted by the respiratory tract to trap microorganisms?", "is_impossible": false}, {"question": "The flushing action of what expels pathogens from the eyes?", "is_impossible": false}, {"question": "What kind of barrier does not protect organisms from infection?", "is_impossible": true}, {"question": "What is an example of a chemical barrier?", "is_impossible": true}, {"question": "What is the last line of defense against infection?", "is_impossible": true}, {"question": "What ejects pathogens from the gastrointestinal tract?", "is_impossible": true}, {"question": "What is not an example of a mechanical barrier?", "is_impossible": true}]}, {"id": "26_8", "context": "Chemical barriers also protect against infection. The skin and respiratory tract secrete antimicrobial peptides such as the β-defensins. Enzymes such as lysozyme and phospholipase A2 in saliva, tears, and breast milk are also antibacterials. Vaginal secretions serve as a chemical barrier following menarche, when they become slightly acidic, while semen contains defensins and zinc to kill pathogens. In the stomach, gastric acid and proteases serve as powerful chemical defenses against ingested pathogens.", "questions": [{"question": "What are the anitmicrobial peptides secreted by the skin called?", "is_impossible": false}, {"question": "What enzymes in saliva are antibacterial in nature?", "is_impossible": false}, {"question": "Semen contains what in order to kill pathogens?", "is_impossible": false}, {"question": "What compounds in the stomach protect against ingested pathogens?", "is_impossible": false}, {"question": "Vaginal secretions serve as a chemical protective barrier following what?", "is_impossible": false}, {"question": "What does the respiratory tract secrete in order to promote infection?", "is_impossible": true}, {"question": "What enzyme is not an antibacterial?", "is_impossible": true}, {"question": "What fluids are enzymes not found in?", "is_impossible": true}, {"question": "When do vaginal secretions become less acidic?", "is_impossible": true}, {"question": "What provides chemical protection to pathogens?", "is_impossible": true}]}, {"id": "26_9", "context": "Within the genitourinary and gastrointestinal tracts, commensal flora serve as biological barriers by competing with pathogenic bacteria for food and space and, in some cases, by changing the conditions in their environment, such as pH or available iron. This reduces the probability that pathogens will reach sufficient numbers to cause illness. However, since most antibiotics non-specifically target bacteria and do not affect fungi, oral antibiotics can lead to an \"overgrowth\" of fungi and cause conditions such as a vaginal candidiasis (a yeast infection). There is good evidence that re-introduction of probiotic flora, such as pure cultures of the lactobacilli normally found in unpasteurized yogurt, helps restore a healthy balance of microbial populations in intestinal infections in children and encouraging preliminary data in studies on bacterial gastroenteritis, inflammatory bowel diseases, urinary tract infection and post-surgical infections.", "questions": [{"question": "What serves as a biological barrier by competing for space and food in the GI tract?", "is_impossible": false}, {"question": "Most antibiotics target bacteria and don't affect what class of organisms?", "is_impossible": false}, {"question": "What probiotic flora is found in unpasteurized yogurt?", "is_impossible": false}, {"question": "Commensal flora can change what specific conditions of their environment in the gastrointestinal tract?", "is_impossible": false}, {"question": "What tracts does commensal flora help pathogens thrive in?", "is_impossible": true}, {"question": "What does not compete with commensal flora for food and space?", "is_impossible": true}, {"question": "What medicine can lead to a decline in fungi?", "is_impossible": true}, {"question": "What food upsets the balance of microbial populations?", "is_impossible": true}, {"question": "What is an infection caused by an overgrowth of bacteria?", "is_impossible": true}]}, {"id": "26_10", "context": "Inflammation is one of the first responses of the immune system to infection. The symptoms of inflammation are redness, swelling, heat, and pain, which are caused by increased blood flow into tissue. Inflammation is produced by eicosanoids and cytokines, which are released by injured or infected cells. Eicosanoids include prostaglandins that produce fever and the dilation of blood vessels associated with inflammation, and leukotrienes that attract certain white blood cells (leukocytes). Common cytokines include interleukins that are responsible for communication between white blood cells; chemokines that promote chemotaxis; and interferons that have anti-viral effects, such as shutting down protein synthesis in the host cell. Growth factors and cytotoxic factors may also be released. These cytokines and other chemicals recruit immune cells to the site of infection and promote healing of any damaged tissue following the removal of pathogens.", "questions": [{"question": "What is one of the first responses the immune system has to infection?", "is_impossible": false}, {"question": "What causes the symptoms of inflammation?", "is_impossible": false}, {"question": "What compounds are released by injured or infected cells, triggering inflammation?", "is_impossible": false}, {"question": "Eicosanoids include what compounds that result in fever and blood vessel dilation?", "is_impossible": false}, {"question": "What cytokines are responsible for communication between white blood cells?", "is_impossible": false}, {"question": "What is one of the last responses of the immune system to infection?", "is_impossible": true}, {"question": "What is not a symptom that is caused by inflammation?", "is_impossible": true}, {"question": "What substances do healthy cells produce?", "is_impossible": true}, {"question": "What is a rare cytokine?", "is_impossible": true}, {"question": "What chemical keeps immune cells away from the site of infection?", "is_impossible": true}]}, {"id": "26_11", "context": "Phagocytosis is an important feature of cellular innate immunity performed by cells called 'phagocytes' that engulf, or eat, pathogens or particles. Phagocytes generally patrol the body searching for pathogens, but can be called to specific locations by cytokines. Once a pathogen has been engulfed by a phagocyte, it becomes trapped in an intracellular vesicle called a phagosome, which subsequently fuses with another vesicle called a lysosome to form a phagolysosome. The pathogen is killed by the activity of digestive enzymes or following a respiratory burst that releases free radicals into the phagolysosome. Phagocytosis evolved as a means of acquiring nutrients, but this role was extended in phagocytes to include engulfment of pathogens as a defense mechanism. Phagocytosis probably represents the oldest form of host defense, as phagocytes have been identified in both vertebrate and invertebrate animals.", "questions": [{"question": "What type of cells engulf or eat pathogens and foreign particles?", "is_impossible": false}, {"question": "Phagocytes can be called to a specific location by what?", "is_impossible": false}, {"question": "When a pathogen has been eaten by a phagocyte it becomes trapped in what vesicle?", "is_impossible": false}, {"question": "What is formed when a phagosome fuses with a lysosome?", "is_impossible": false}, {"question": "Phagocytosis first evolved as means of doing what?", "is_impossible": false}, {"question": "What patrols the body looking for phagocytes?", "is_impossible": true}, {"question": "What drives phagocytes away from specific areas?", "is_impossible": true}, {"question": "Where does a phagocyte get stuck in a pathogen?", "is_impossible": true}, {"question": "How does the pathogen kill the phagocyte?", "is_impossible": true}, {"question": "What was the role of phagocytosis before it was used to acquire nutrients?", "is_impossible": true}]}, {"id": "26_12", "context": "Neutrophils and macrophages are phagocytes that travel throughout the body in pursuit of invading pathogens. Neutrophils are normally found in the bloodstream and are the most abundant type of phagocyte, normally representing 50% to 60% of the total circulating leukocytes. During the acute phase of inflammation, particularly as a result of bacterial infection, neutrophils migrate toward the site of inflammation in a process called chemotaxis, and are usually the first cells to arrive at the scene of infection. Macrophages are versatile cells that reside within tissues and produce a wide array of chemicals including enzymes, complement proteins, and regulatory factors such as interleukin 1. Macrophages also act as scavengers, ridding the body of worn-out cells and other debris, and as antigen-presenting cells that activate the adaptive immune system.", "questions": [{"question": "What are two types of phagocytes that travel through the body to find invading pathogens?", "is_impossible": false}, {"question": "What are the most abundant kind of phagocyte?", "is_impossible": false}, {"question": "What percentage of leukocytes do neutrophils represent?", "is_impossible": false}, {"question": "What is the process in which neutrophils move towards the site of inflammation called?", "is_impossible": false}, {"question": "What is a regulatory factor produced by macrophages?", "is_impossible": false}, {"question": "What are pathogens that travel through the body looking for phagocytes called?", "is_impossible": true}, {"question": "Where are neutrophils rarely found?", "is_impossible": true}, {"question": "What is the least abundant type of phagocyte?", "is_impossible": true}, {"question": "What are usually the last cells to arrive at the scene of an infection?", "is_impossible": true}, {"question": "What cell is unable to act as a scavenger?", "is_impossible": true}]}, {"id": "26_13", "context": "Leukocytes (white blood cells) act like independent, single-celled organisms and are the second arm of the innate immune system. The innate leukocytes include the phagocytes (macrophages, neutrophils, and dendritic cells), mast cells, eosinophils, basophils, and natural killer cells. These cells identify and eliminate pathogens, either by attacking larger pathogens through contact or by engulfing and then killing microorganisms. Innate cells are also important mediators in the activation of the adaptive immune system.", "questions": [{"question": "What are white blood cells known as?", "is_impossible": false}, {"question": "What cells are the second arm of the innate immune system?", "is_impossible": false}, {"question": "Innate cells can act as mediators in the activation of what branch of the immune system?", "is_impossible": false}, {"question": "What are three kinds of phagocytes?", "is_impossible": false}, {"question": "What cells can't act independently?", "is_impossible": true}, {"question": "What are leukocytes the first arm of?", "is_impossible": true}, {"question": "What kind of cell is not an innate leukocyte?", "is_impossible": true}, {"question": "What cells attack smaller pathogens through contact?", "is_impossible": true}, {"question": "What are the least important mediators in the activation of the adaptive immune system?", "is_impossible": true}]}, {"id": "26_14", "context": "Dendritic cells (DC) are phagocytes in tissues that are in contact with the external environment; therefore, they are located mainly in the skin, nose, lungs, stomach, and intestines. They are named for their resemblance to neuronal dendrites, as both have many spine-like projections, but dendritic cells are in no way connected to the nervous system. Dendritic cells serve as a link between the bodily tissues and the innate and adaptive immune systems, as they present antigens to T cells, one of the key cell types of the adaptive immune system.", "questions": [{"question": "What are the phagocytes that are located in tissues in contact with the external environment called?", "is_impossible": false}, {"question": "Dendritic cells are named that because they resemble what?", "is_impossible": false}, {"question": "What are one of the key cell types of the adaptive immune system?", "is_impossible": false}, {"question": "Dendritic cells present antigens to what cells of the adaptive nervous system?", "is_impossible": false}, {"question": "What are phagocytes in tissues that only have contact with the internal environment called?", "is_impossible": true}, {"question": "What areas are dendritic cells not found in?", "is_impossible": true}, {"question": "What is named for its resemblance to dendritic cells?", "is_impossible": true}, {"question": "What appearance do dendritic cells and neuronal dendrites not share?", "is_impossible": true}, {"question": "What serves as a barrier between bodily tissues and the nervous system?", "is_impossible": true}]}, {"id": "26_15", "context": "Natural killer cells, or NK cells, are a component of the innate immune system which does not directly attack invading microbes. Rather, NK cells destroy compromised host cells, such as tumor cells or virus-infected cells, recognizing such cells by a condition known as \"missing self.\" This term describes cells with low levels of a cell-surface marker called MHC I (major histocompatibility complex) – a situation that can arise in viral infections of host cells. They were named \"natural killer\" because of the initial notion that they do not require activation in order to kill cells that are \"missing self.\" For many years it was unclear how NK cells recognize tumor cells and infected cells. It is now known that the MHC makeup on the surface of those cells is altered and the NK cells become activated through recognition of \"missing self\". Normal body cells are not recognized and attacked by NK cells because they express intact self MHC antigens. Those MHC antigens are recognized by killer cell immunoglobulin receptors (KIR) which essentially put the brakes on NK cells.", "questions": [{"question": "What is one part of the innate immune system that doesn't attack microbes directly?", "is_impossible": false}, {"question": "Natural killer cells recognize cells that should be targeted by a condition known as what?", "is_impossible": false}, {"question": "Missing self desribes cells that only have small amounts of what cell-surface marker?", "is_impossible": false}, {"question": "MHC antigens on normal body cells are recognized by what receptor on NK cells?", "is_impossible": false}, {"question": "What part of the innate immune system directly attacks microbes?", "is_impossible": true}, {"question": "What do NK cells protect?", "is_impossible": true}, {"question": "Why are normal body cells attacked by NK cells?", "is_impossible": true}, {"question": "How long was it clear how NK cells recognized tumors?", "is_impossible": true}, {"question": "What accelerates NK cells?", "is_impossible": true}]}, {"id": "26_16", "context": "The adaptive immune system evolved in early vertebrates and allows for a stronger immune response as well as immunological memory, where each pathogen is \"remembered\" by a signature antigen. The adaptive immune response is antigen-specific and requires the recognition of specific \"non-self\" antigens during a process called antigen presentation. Antigen specificity allows for the generation of responses that are tailored to specific pathogens or pathogen-infected cells. The ability to mount these tailored responses is maintained in the body by \"memory cells\". Should a pathogen infect the body more than once, these specific memory cells are used to quickly eliminate it.", "questions": [{"question": "In what types of organisms did the adaptive immune system first evolve?", "is_impossible": false}, {"question": "The adaptive immune system recognizes non-self antigens during a process called what?", "is_impossible": false}, {"question": "Antigen specificity  allows responses that are specific to certain types of what?", "is_impossible": false}, {"question": "What evolved in later vertebrates?", "is_impossible": true}, {"question": "What immune response is not antigen-specific?", "is_impossible": true}, {"question": "What is not needed for adaptive immune responses?", "is_impossible": true}, {"question": "What allows for responses that are not tailored to a specific pathogen?", "is_impossible": true}, {"question": "What is used to eliminate a pathogen that infects the body once?", "is_impossible": true}]}, {"id": "26_17", "context": "Both B cells and T cells carry receptor molecules that recognize specific targets. T cells recognize a \"non-self\" target, such as a pathogen, only after antigens (small fragments of the pathogen) have been processed and presented in combination with a \"self\" receptor called a major histocompatibility complex (MHC) molecule. There are two major subtypes of T cells: the killer T cell and the helper T cell. In addition there are regulatory T cells which have a role in modulating immune response. Killer T cells only recognize antigens coupled to Class I MHC molecules, while helper T cells and regulatory T cells only recognize antigens coupled to Class II MHC molecules. These two mechanisms of antigen presentation reflect the different roles of the two types of T cell. A third, minor subtype are the γδ T cells that recognize intact antigens that are not bound to MHC receptors.", "questions": [{"question": "What are the two major subtypes of T cells?", "is_impossible": false}, {"question": "What kind of T cells have the purpose of modulating the immune response?", "is_impossible": false}, {"question": "Killer T cells can only recognize antigens coupled to what kind of molecules?", "is_impossible": false}, {"question": "Helper and regulatory T cells can only recognize antigens coupled to what kind of molecules?", "is_impossible": false}, {"question": "What class of T cells recognizes intact antigens that are not associated with MHC receptors?", "is_impossible": false}, {"question": "What cells do not carry receptor molecules?", "is_impossible": true}, {"question": "What do T cells recognize before antigens have been processed?", "is_impossible": true}, {"question": "How many subtypes of B cells exist?", "is_impossible": true}, {"question": "How many roles do the types of B cell have?", "is_impossible": true}, {"question": "What do killer B cells recognize?", "is_impossible": true}]}, {"id": "26_18", "context": "Killer T cells are a sub-group of T cells that kill cells that are infected with viruses (and other pathogens), or are otherwise damaged or dysfunctional. As with B cells, each type of T cell recognizes a different antigen. Killer T cells are activated when their T cell receptor (TCR) binds to this specific antigen in a complex with the MHC Class I receptor of another cell. Recognition of this MHC:antigen complex is aided by a co-receptor on the T cell, called CD8. The T cell then travels throughout the body in search of cells where the MHC I receptors bear this antigen. When an activated T cell contacts such cells, it releases cytotoxins, such as perforin, which form pores in the target cell's plasma membrane, allowing ions, water and toxins to enter. The entry of another toxin called granulysin (a protease) induces the target cell to undergo apoptosis. T cell killing of host cells is particularly important in preventing the replication of viruses. T cell activation is tightly controlled and generally requires a very strong MHC/antigen activation signal, or additional activation signals provided by \"helper\" T cells (see below).", "questions": [{"question": "What kind of T cells kill cells that are infected with pathogens?", "is_impossible": false}, {"question": "What is the receptor that killer T cells use to bind to specific antigens that are complexed with the MHC Class 1 receptor of another cell?", "is_impossible": false}, {"question": "What co-receptor on the T cell helps in recognizing the MHC-antigen complex?", "is_impossible": false}, {"question": "When an activated killer T cell finds cells where the MHC 1 receptor has specific antigens, it releases cytotoxins such as what?", "is_impossible": false}, {"question": "What toxin induces apoptosis in the target cell?", "is_impossible": false}, {"question": "What cells help breed cells that are infected with viruses?", "is_impossible": true}, {"question": "What do Killer B cells kill?", "is_impossible": true}, {"question": "When are Killer T cells deactivated?", "is_impossible": true}, {"question": "What co-receptor makes recognition more difficult?", "is_impossible": true}, {"question": "What allows ions, water and toxins to exit the target cell's membrane?", "is_impossible": true}]}, {"id": "26_19", "context": "Helper T cells express T cell receptors (TCR) that recognize antigen bound to Class II MHC molecules. The MHC:antigen complex is also recognized by the helper cell's CD4 co-receptor, which recruits molecules inside the T cell (e.g., Lck) that are responsible for the T cell's activation. Helper T cells have a weaker association with the MHC:antigen complex than observed for killer T cells, meaning many receptors (around 200–300) on the helper T cell must be bound by an MHC:antigen in order to activate the helper cell, while killer T cells can be activated by engagement of a single MHC:antigen molecule. Helper T cell activation also requires longer duration of engagement with an antigen-presenting cell. The activation of a resting helper T cell causes it to release cytokines that influence the activity of many cell types. Cytokine signals produced by helper T cells enhance the microbicidal function of macrophages and the activity of killer T cells. In addition, helper T cell activation causes an upregulation of molecules expressed on the T cell's surface, such as CD40 ligand (also called CD154), which provide extra stimulatory signals typically required to activate antibody-producing B cells.", "questions": [{"question": "What co-receptor recruits molecules inside the T cell that are responsible for cell activation?", "is_impossible": false}, {"question": "How many receptors on a helper T cell must be bound to a MHC:antigen complex in order for the cell to be activated?", "is_impossible": false}, {"question": "The receptors on a killer T cell must bind to how many MHC: antigen complexes in order to activate the cell?", "is_impossible": false}, {"question": "Activation of a helper T cell causes it to release what chemicals that influence cell activity?", "is_impossible": false}, {"question": "What is a ligand on the cell surface that is upregulated after helper T cell activation?", "is_impossible": false}, {"question": "What antigens do Helper T cells not recognize?", "is_impossible": true}, {"question": "What has a stronger association with the MHC:antigen complex than killer T cells?", "is_impossible": true}, {"question": "What are killer T cells dis-activated by?", "is_impossible": true}, {"question": "What do helper T cells absorb?", "is_impossible": true}, {"question": "What do B cells help T cells produce?", "is_impossible": true}]}, {"id": "26_20", "context": "Gamma delta T cells (γδ T cells) possess an alternative T cell receptor (TCR) as opposed to CD4+ and CD8+ (αβ) T cells and share the characteristics of helper T cells, cytotoxic T cells and NK cells. The conditions that produce responses from γδ T cells are not fully understood. Like other 'unconventional' T cell subsets bearing invariant TCRs, such as CD1d-restricted Natural Killer T cells, γδ T cells straddle the border between innate and adaptive immunity. On one hand, γδ T cells are a component of adaptive immunity as they rearrange TCR genes to produce receptor diversity and can also develop a memory phenotype. On the other hand, the various subsets are also part of the innate immune system, as restricted TCR or NK receptors may be used as pattern recognition receptors. For example, large numbers of human Vγ9/Vδ2 T cells respond within hours to common molecules produced by microbes, and highly restricted Vδ1+ T cells in epithelia respond to stressed epithelial cells.", "questions": [{"question": "Gamma delta T cells share the characteristics of what other types of T cells?", "is_impossible": false}, {"question": "Gamma delta T cells have a different version of what receptor?", "is_impossible": false}, {"question": "What type of T cells help with both innnate and adaptive immunity?", "is_impossible": false}, {"question": "Gamma delta T cells rearrange TCR genes to produce what?", "is_impossible": false}, {"question": "What kind of human T cells respond to common molecules produced by microbes?", "is_impossible": false}, {"question": "What cells do not possess an alternative T cell receptor?", "is_impossible": true}, {"question": "What cells do gamma delta T cells not share characteristics with?", "is_impossible": true}, {"question": "What is fully understood about γδ T cells?", "is_impossible": true}, {"question": "What responds in small numbers to common molecules produced by microbes?", "is_impossible": true}]}, {"id": "26_21", "context": "A B cell identifies pathogens when antibodies on its surface bind to a specific foreign antigen. This antigen/antibody complex is taken up by the B cell and processed by proteolysis into peptides. The B cell then displays these antigenic peptides on its surface MHC class II molecules. This combination of MHC and antigen attracts a matching helper T cell, which releases lymphokines and activates the B cell. As the activated B cell then begins to divide, its offspring (plasma cells) secrete millions of copies of the antibody that recognizes this antigen. These antibodies circulate in blood plasma and lymph, bind to pathogens expressing the antigen and mark them for destruction by complement activation or for uptake and destruction by phagocytes. Antibodies can also neutralize challenges directly, by binding to bacterial toxins or by interfering with the receptors that viruses and bacteria use to infect cells.", "questions": [{"question": "What kind of cell identifies pathogens when the antibodies on its surface complex with a specific foreign antigen?", "is_impossible": false}, {"question": "What is the process by which the antigen/antibody complex is processed in to peptides?", "is_impossible": false}, {"question": "What does the matching helper T cell release when it binds with the MHC:antigen complex of the B cell?", "is_impossible": false}, {"question": "When does a T cell identify pathogens?", "is_impossible": true}, {"question": "What are peptides processed into?", "is_impossible": true}, {"question": "What attracts a matching helper B cell?", "is_impossible": true}, {"question": "When do antibodies not circulate in?", "is_impossible": true}, {"question": "What can antibodies not neutralize?", "is_impossible": true}]}, {"id": "26_22", "context": "When B cells and T cells are activated and begin to replicate, some of their offspring become long-lived memory cells. Throughout the lifetime of an animal, these memory cells remember each specific pathogen encountered and can mount a strong response if the pathogen is detected again. This is \"adaptive\" because it occurs during the lifetime of an individual as an adaptation to infection with that pathogen and prepares the immune system for future challenges. Immunological memory can be in the form of either passive short-term memory or active long-term memory.", "questions": [{"question": "When B cells and T cells begin to replicate, what do some of their offspring cells become?", "is_impossible": false}, {"question": "The function of long-lived memory cells is an example of what kind of immune response?", "is_impossible": false}, {"question": "Immunological memory can take what two forms?", "is_impossible": false}, {"question": "Long-lived memory cells can remember previous encounters with what?", "is_impossible": false}, {"question": "What happens when B cells and T cells are deactivated?", "is_impossible": true}, {"question": "What cells mount a weak response if a pathogen is detected again?", "is_impossible": true}, {"question": "What is not a form of immunological memory?", "is_impossible": true}, {"question": "Why are memory cells not considered adaptive?", "is_impossible": true}, {"question": "What cells are unable to remember specific pathogens?", "is_impossible": true}]}, {"id": "26_23", "context": "Newborn infants have no prior exposure to microbes and are particularly vulnerable to infection. Several layers of passive protection are provided by the mother. During pregnancy, a particular type of antibody, called IgG, is transported from mother to baby directly across the placenta, so human babies have high levels of antibodies even at birth, with the same range of antigen specificities as their mother. Breast milk or colostrum also contains antibodies that are transferred to the gut of the infant and protect against bacterial infections until the newborn can synthesize its own antibodies. This is passive immunity because the fetus does not actually make any memory cells or antibodies—it only borrows them. This passive immunity is usually short-term, lasting from a few days up to several months. In medicine, protective passive immunity can also be transferred artificially from one individual to another via antibody-rich serum.", "questions": [{"question": "Newborns are vulnerable to infection because they have no previous exposure to what?", "is_impossible": false}, {"question": "What antibody is transported from the mother to baby across the placenta?", "is_impossible": false}, {"question": "Antibodies are transferred to the gut of the infant through what means?", "is_impossible": false}, {"question": "Antibodies transported from the mother to an infant via the placenta is an example of what type of short-lived immunity?", "is_impossible": false}, {"question": "What people are least vulnerable to infection?", "is_impossible": true}, {"question": "How many layers of protection are provided by the father?", "is_impossible": true}, {"question": "What antibody is transmitted from the father to the baby?", "is_impossible": true}, {"question": "What is not present in breast milk?", "is_impossible": true}, {"question": "What is not possible to transfer from one person to another artificially?", "is_impossible": true}]}, {"id": "26_24", "context": "Hormones can act as immunomodulators, altering the sensitivity of the immune system. For example, female sex hormones are known immunostimulators of both adaptive and innate immune responses. Some autoimmune diseases such as lupus erythematosus strike women preferentially, and their onset often coincides with puberty. By contrast, male sex hormones such as testosterone seem to be immunosuppressive. Other hormones appear to regulate the immune system as well, most notably prolactin, growth hormone and vitamin D.", "questions": [{"question": "Hormones can alter the sensitivity of the immune system, so they can be referred to as what?", "is_impossible": false}, {"question": "Female sex hormones are immunostimulators of which immune responses?", "is_impossible": false}, {"question": "What is an autoimmune disease that affects women preferentially?", "is_impossible": false}, {"question": "What is the effect of testosterone on the male immune system?", "is_impossible": false}, {"question": "What keeps the sensitivity of the immune system at the same levels? ", "is_impossible": true}, {"question": "When do autoimmune diseases often strike men?", "is_impossible": true}, {"question": "What is a hormone that does not effect the immune system?", "is_impossible": true}, {"question": "What male sex hormone is an immunostimulator?", "is_impossible": true}, {"question": "What is an autoimmune disease that mostly strikes men?", "is_impossible": true}]}, {"id": "26_25", "context": "When suffering from sleep deprivation, active immunizations may have a diminished effect and may result in lower antibody production, and a lower immune response, than would be noted in a well-rested individual. Additionally, proteins such as NFIL3, which have been shown to be closely intertwined with both T-cell differentiation and our circadian rhythms, can be affected through the disturbance of natural light and dark cycles through instances of sleep deprivation, shift work, etc. As a result, these disruptions can lead to an increase in chronic conditions such as heart disease, chronic pain, and asthma.", "questions": [{"question": "What is a protein that is closely intertwined with circadian rhythms?", "is_impossible": false}, {"question": "Disruptions in sleep can lead to increase in what chronic conditions?", "is_impossible": false}, {"question": "What kind of deprivation results in diminished immune response and lower antibody production?", "is_impossible": false}, {"question": "What has a stronger effect during sleep deprivation?", "is_impossible": true}, {"question": "When is antibody production higher than normal? ", "is_impossible": true}, {"question": "What protein does not effect T-cell differentiation? ", "is_impossible": true}, {"question": "What chronic conditions can cause sleep deprivation?", "is_impossible": true}, {"question": "What is not effected by natural light and dark cycles?", "is_impossible": true}]}, {"id": "26_26", "context": "It is conjectured that a progressive decline in hormone levels with age is partially responsible for weakened immune responses in aging individuals. Conversely, some hormones are regulated by the immune system, notably thyroid hormone activity. The age-related decline in immune function is also related to decreasing vitamin D levels in the elderly. As people age, two things happen that negatively affect their vitamin D levels. First, they stay indoors more due to decreased activity levels. This means that they get less sun and therefore produce less cholecalciferol via UVB radiation. Second, as a person ages the skin becomes less adept at producing vitamin D.", "questions": [{"question": "What is partially responsible for weakened immune response in older individuals?", "is_impossible": false}, {"question": "As a person gets older, what does the skin produce less of?", "is_impossible": false}, {"question": "The production of what signalling molecules is regulated by the immune system?", "is_impossible": false}, {"question": "Older people get less sun and produce less of what chemical via UVB radiation?", "is_impossible": false}, {"question": "What increases with age?", "is_impossible": true}, {"question": "What do increased hormone levels cause in aging adults?", "is_impossible": true}, {"question": "What hormones are independent from the immune system?", "is_impossible": true}, {"question": "What causes elevated vitamin D levels in the elderly?", "is_impossible": true}, {"question": "What becomes more adept at producing vitamin D as a person ages?", "is_impossible": true}]}, {"id": "26_27", "context": "The main response of the immune system to tumors is to destroy the abnormal cells using killer T cells, sometimes with the assistance of helper T cells. Tumor antigens are presented on MHC class I molecules in a similar way to viral antigens. This allows killer T cells to recognize the tumor cell as abnormal. NK cells also kill tumorous cells in a similar way, especially if the tumor cells have fewer MHC class I molecules on their surface than normal; this is a common phenomenon with tumors. Sometimes antibodies are generated against tumor cells allowing for their destruction by the complement system.", "questions": [{"question": "What type of immune cells help to destroy abnormal cells in tumors?", "is_impossible": false}, {"question": "Lots of tumor cells have fewer of what type of molecule on their surface?", "is_impossible": false}, {"question": "Tumor antigens are complexed with MHC class I molecules in the same way as what antigens?", "is_impossible": false}, {"question": "The immune system also produces what molecules in order to allow for tumor destruction by the complement system?", "is_impossible": false}, {"question": "What cells are used to multiply the abnormal cells?", "is_impossible": true}, {"question": "What cells do helper B cells assist?", "is_impossible": true}, {"question": "What antigens present differently than viral antigens?", "is_impossible": true}, {"question": "What do helper T cells recognize killer T cells as?", "is_impossible": true}, {"question": "What are antibodies never generated to fight?", "is_impossible": true}]}, {"id": "26_28", "context": "Unlike animals, plants lack phagocytic cells, but many plant immune responses involve systemic chemical signals that are sent through a plant. Individual plant cells respond to molecules associated with pathogens known as Pathogen-associated molecular patterns or PAMPs. When a part of a plant becomes infected, the plant produces a localized hypersensitive response, whereby cells at the site of infection undergo rapid apoptosis to prevent the spread of the disease to other parts of the plant. Systemic acquired resistance (SAR) is a type of defensive response used by plants that renders the entire plant resistant to a particular infectious agent. RNA silencing mechanisms are particularly important in this systemic response as they can block virus replication.", "questions": [{"question": "Plants lack what kind of immune cells?", "is_impossible": false}, {"question": "Plant cells respond to the molecules associated with pathogens known as what?", "is_impossible": false}, {"question": "Cells of the site of an infection in a plant undergo what process to prevent spread of the disease?", "is_impossible": false}, {"question": "What is a kind of defense response that makes the entire plant resistant to a particular agent?", "is_impossible": false}, {"question": "What is a mechanism that can help plants block virus replication?", "is_impossible": false}, {"question": "What cells do plants and animals both have?", "is_impossible": true}, {"question": "What happens when all parts of a plant become infected?", "is_impossible": true}, {"question": "What do cells away from the site of the infection undergo?", "is_impossible": true}, {"question": "What cells undergo slow apoptosis?", "is_impossible": true}, {"question": "What is unimportant in SAR?", "is_impossible": true}]}, {"id": "26_29", "context": "Overactive immune responses comprise the other end of immune dysfunction, particularly the autoimmune disorders. Here, the immune system fails to properly distinguish between self and non-self, and attacks part of the body. Under normal circumstances, many T cells and antibodies react with \"self\" peptides. One of the functions of specialized cells (located in the thymus and bone marrow) is to present young lymphocytes with self antigens produced throughout the body and to eliminate those cells that recognize self-antigens, preventing autoimmunity.", "questions": [{"question": "What kind of disorders are the result of an overactive immune response?", "is_impossible": false}, {"question": "In autoimmune disorders, the immune system doesn't distinguish between what types of cells?", "is_impossible": false}, {"question": "Where are the specialized cells that eliminate cells that recognize self-antigens located?", "is_impossible": false}, {"question": "Under normal conditions, T cells and antibodies produce what kind of peptides?", "is_impossible": false}, {"question": "What disorder causes the immune system to distinguish between self and non-self?", "is_impossible": true}, {"question": "What cell never reacts with self peptides?", "is_impossible": true}, {"question": "What is the function of specialize cells located in the brain?", "is_impossible": true}, {"question": "What cells are not eliminated by the immune system?", "is_impossible": true}, {"question": "Where are specialized cells not located?", "is_impossible": true}]}, {"id": "26_30", "context": "Immunodeficiencies occur when one or more of the components of the immune system are inactive. The ability of the immune system to respond to pathogens is diminished in both the young and the elderly, with immune responses beginning to decline at around 50 years of age due to immunosenescence. In developed countries, obesity, alcoholism, and drug use are common causes of poor immune function. However, malnutrition is the most common cause of immunodeficiency in developing countries. Diets lacking sufficient protein are associated with impaired cell-mediated immunity, complement activity, phagocyte function, IgA antibody concentrations, and cytokine production. Additionally, the loss of the thymus at an early age through genetic mutation or surgical removal results in severe immunodeficiency and a high susceptibility to infection.", "questions": [{"question": "What kind of disorders occur when part of the immune system isn't active?", "is_impossible": false}, {"question": "In what two age groups is the strength of the immune system reduced?", "is_impossible": false}, {"question": "At what age do immune responses typically begin to decline?", "is_impossible": false}, {"question": "What are some causes of reduced immune function in developed countries?", "is_impossible": false}, {"question": "What is the most common cause of immunodeficiency in developing nations?", "is_impossible": false}, {"question": "What occurs when all components of the immune system are active?", "is_impossible": true}, {"question": "In what people is the immune system the strongest?", "is_impossible": true}, {"question": "What is the rarest cause of poor immune function in developing countries?", "is_impossible": true}, {"question": "What do diets with too much protein cause?", "is_impossible": true}, {"question": "What does the loss of the thymus at an early age prevent?", "is_impossible": true}]}, {"id": "26_31", "context": "Long-term active memory is acquired following infection by activation of B and T cells. Active immunity can also be generated artificially, through vaccination. The principle behind vaccination (also called immunization) is to introduce an antigen from a pathogen in order to stimulate the immune system and develop specific immunity against that particular pathogen without causing disease associated with that organism. This deliberate induction of an immune response is successful because it exploits the natural specificity of the immune system, as well as its inducibility. With infectious disease remaining one of the leading causes of death in the human population, vaccination represents the most effective manipulation of the immune system mankind has developed.", "questions": [{"question": "By what process can active immunity be generated in an artificial manner?", "is_impossible": false}, {"question": "What is the process of vaccination also known as?", "is_impossible": false}, {"question": "In the process of vaccination, what is introduced in order to develop a specific immunity?", "is_impossible": false}, {"question": "Vaccination exploits what feature of the human immune system in order to be successful?", "is_impossible": false}, {"question": "When is short-term active memory acquired?", "is_impossible": true}, {"question": "What cells do not play a role in long-term active memory?", "is_impossible": true}, {"question": "What artificial method of spreading immunity causes disease? ", "is_impossible": true}, {"question": "What does vaccination not exploit?", "is_impossible": true}, {"question": "What is one of the least common causes of death in humans?", "is_impossible": true}]}, {"id": "26_32", "context": "The success of any pathogen depends on its ability to elude host immune responses. Therefore, pathogens evolved several methods that allow them to successfully infect a host, while evading detection or destruction by the immune system. Bacteria often overcome physical barriers by secreting enzymes that digest the barrier, for example, by using a type II secretion system. Alternatively, using a type III secretion system, they may insert a hollow tube into the host cell, providing a direct route for proteins to move from the pathogen to the host. These proteins are often used to shut down host defenses.", "questions": [{"question": "Bacteria often secrete what kind of proteins to ingest a physical barrier?", "is_impossible": false}, {"question": "What kind of system of infection involves inserting a hollow tube into a host cell?", "is_impossible": false}, {"question": "In a type III secretion system, proteins are transported to the host cell in order to do what?", "is_impossible": false}, {"question": "The success of pathogens is predicated on their ability to do what?", "is_impossible": false}, {"question": "What does the failure of a pathogen depend on?", "is_impossible": true}, {"question": "How do viruses overcome physical barriers?", "is_impossible": true}, {"question": "What do bacteria use to move proteins from the host to the pathogen?", "is_impossible": true}, {"question": "What are bacteria unable to secrete?", "is_impossible": true}, {"question": "What is used to shut down pathogen defenses?", "is_impossible": true}]}, {"id": "26_33", "context": "In the mid-1950s, Frank Burnet, inspired by a suggestion made by Niels Jerne, formulated the clonal selection theory (CST) of immunity. On the basis of CST, Burnet developed a theory of how an immune response is triggered according to the self/nonself distinction: \"self\" constituents (constituents of the body) do not trigger destructive immune responses, while \"nonself\" entities (pathogens, an allograft) trigger a destructive immune response. The theory was later modified to reflect new discoveries regarding histocompatibility or the complex \"two-signal\" activation of T cells. The self/nonself theory of immunity and the self/nonself vocabulary have been criticized, but remain very influential.", "questions": [{"question": "Who formulated the idea of clonal selection theory of immunity?", "is_impossible": false}, {"question": "What are two examples of nonself entities in accordance with Frank Burnet's theory?", "is_impossible": false}, {"question": "What is the complex \"two-signal\" activation of T cells referred to?", "is_impossible": false}, {"question": "What other scientist influence Frank Burnet when he was formulating his theory of immunity?", "is_impossible": false}, {"question": "What theory did Niels Jerne formulate?", "is_impossible": true}, {"question": "Who did Frank Burnet inspire with a suggestion?", "is_impossible": true}, {"question": "What theory of immunity is no longer influential?", "is_impossible": true}, {"question": "What did Jerne develop on the basis of CST?", "is_impossible": true}, {"question": "What did Frank Burnet formulate before the 1950s?", "is_impossible": true}]}, {"id": "26_34", "context": "Anti-inflammatory drugs are often used to control the effects of inflammation. Glucocorticoids are the most powerful of these drugs; however, these drugs can have many undesirable side effects, such as central obesity, hyperglycemia, osteoporosis, and their use must be tightly controlled. Lower doses of anti-inflammatory drugs are often used in conjunction with cytotoxic or immunosuppressive drugs such as methotrexate or azathioprine. Cytotoxic drugs inhibit the immune response by killing dividing cells such as activated T cells. However, the killing is indiscriminate and other constantly dividing cells and their organs are affected, which causes toxic side effects. Immunosuppressive drugs such as cyclosporin prevent T cells from responding to signals correctly by inhibiting signal transduction pathways.", "questions": [{"question": "What are the most powerful class of anti-inflammatory drugs?", "is_impossible": false}, {"question": "Low doses of anti-inflammatories are sometimes used with what classes of drugs?", "is_impossible": false}, {"question": "What are two examples of cytotoxic or immunosuppressive drugs?", "is_impossible": false}, {"question": "What is an example of an immunosuppressive drug that prevents T cell activity by altering signal transduction pathways?", "is_impossible": false}, {"question": "What is used to enhance the effects of inflammation?", "is_impossible": true}, {"question": "What are the least powerful anti-inflammatory drugs?", "is_impossible": true}, {"question": "What is not a side effect of glucocorticoids?", "is_impossible": true}, {"question": "What are higher doses of anti-inflammatory drugs used with?", "is_impossible": true}, {"question": "What drugs help T cells respond to signals correctly?", "is_impossible": true}]}, {"id": "26_35", "context": "In contrast, during wake periods differentiated effector cells, such as cytotoxic natural killer cells and CTLs (cytotoxic T lymphocytes), peak in order to elicit an effective response against any intruding pathogens. As well during awake active times, anti-inflammatory molecules, such as cortisol and catecholamines, peak. There are two theories as to why the pro-inflammatory state is reserved for sleep time. First, inflammation would cause serious cognitive and physical impairments if it were to occur during wake times. Second, inflammation may occur during sleep times due to the presence of melatonin. Inflammation causes a great deal of oxidative stress and the presence of melatonin during sleep times could actively counteract free radical production during this time.", "questions": [{"question": "What are examples of differentiated effector cells that peak during wake periods?", "is_impossible": false}, {"question": "What are two anti-inflammatory molecules that peak during awake hours?", "is_impossible": false}, {"question": "Inflammation occurs during sleep times because of the presence of what molecule?", "is_impossible": false}, {"question": "Melatonin during sleep can actively counteract the production of what?", "is_impossible": false}, {"question": "What cells are at their lowest while people are awake?", "is_impossible": true}, {"question": "Why do differentiated effector cells ebb during wake periods?", "is_impossible": true}, {"question": "What molecules that promote inflammation peak during waking hours? ", "is_impossible": true}, {"question": "What could inflammation do during sleep periods?", "is_impossible": true}, {"question": "What could promote free radical production during sleep times?", "is_impossible": true}]}, {"id": "26_36", "context": "When a T-cell encounters a foreign pathogen, it extends a vitamin D receptor. This is essentially a signaling device that allows the T-cell to bind to the active form of vitamin D, the steroid hormone calcitriol. T-cells have a symbiotic relationship with vitamin D. Not only does the T-cell extend a vitamin D receptor, in essence asking to bind to the steroid hormone version of vitamin D, calcitriol, but the T-cell expresses the gene CYP27B1, which is the gene responsible for converting the pre-hormone version of vitamin D, calcidiol into the steroid hormone version, calcitriol. Only after binding to calcitriol can T-cells perform their intended function. Other immune system cells that are known to express CYP27B1 and thus activate vitamin D calcidiol, are dendritic cells, keratinocytes and macrophages.", "questions": [{"question": "What does a T cell extend when it encounters a foreign pathogen?", "is_impossible": false}, {"question": "What is the active form of vitamin D known as?", "is_impossible": false}, {"question": "What is the nature of the relationship between T-cells and vitamin D?", "is_impossible": false}, {"question": "What gene is responsible for converting calcidiol into calcitriol?", "is_impossible": false}, {"question": "Other than T cells, what other immune cells express CYP27B1?", "is_impossible": false}, {"question": "What does a pathogen do when it encounters a T-cell?", "is_impossible": true}, {"question": "What cell binds to vitamin C?", "is_impossible": true}, {"question": "What vitamin do T-cells have a parasitic relationship with?", "is_impossible": true}, {"question": "What gene is expressed by the B-cell?", "is_impossible": true}, {"question": "What gene converts calcitriol into calcidiol?", "is_impossible": true}]}, {"id": "26_37", "context": "Pattern recognition receptors are proteins used by nearly all organisms to identify molecules associated with pathogens. Antimicrobial peptides called defensins are an evolutionarily conserved component of the innate immune response found in all animals and plants, and represent the main form of invertebrate systemic immunity. The complement system and phagocytic cells are also used by most forms of invertebrate life. Ribonucleases and the RNA interference pathway are conserved across all eukaryotes, and are thought to play a role in the immune response to viruses.", "questions": [{"question": "What are the proteins that organisms use to identify molecules associated with pathogens?", "is_impossible": false}, {"question": "What are the antimicrobial peptides that are the main form of invertebrate systemic immunity called?", "is_impossible": false}, {"question": "What cell type is also used for immune response in most types of invertebrate life?", "is_impossible": false}, {"question": "What pathway that plays a role in immune response to viruses is present in all eukaryotes?", "is_impossible": false}, {"question": "What proteins are used by very few organisms?", "is_impossible": true}, {"question": "What are peptides that help microbes flourish called?", "is_impossible": true}, {"question": "What is not used by any form of invertebrate?", "is_impossible": true}, {"question": "What does not play a role in the immune response to viruses?", "is_impossible": true}, {"question": "Where are ribonucleases not conserved?", "is_impossible": true}]}, {"id": "26_38", "context": "Evolution of the adaptive immune system occurred in an ancestor of the jawed vertebrates. Many of the classical molecules of the adaptive immune system (e.g., immunoglobulins and T cell receptors) exist only in jawed vertebrates. However, a distinct lymphocyte-derived molecule has been discovered in primitive jawless vertebrates, such as the lamprey and hagfish. These animals possess a large array of molecules called Variable lymphocyte receptors (VLRs) that, like the antigen receptors of jawed vertebrates, are produced from only a small number (one or two) of genes. These molecules are believed to bind pathogenic antigens in a similar way to antibodies, and with the same degree of specificity.", "questions": [{"question": "What molecules of the adaptive immune system only exist in jawed vertebrates?", "is_impossible": false}, {"question": "What are two examples of primitive jawless vertebrates?", "is_impossible": false}, {"question": "Primitive jawless vertebrates possess an array of receptors referred to as what?", "is_impossible": false}, {"question": "Evolution of what part of the immune system occurred in the evolutionary ancestor of jawed vertebrates?", "is_impossible": false}, {"question": "What evolved in modern jawed vertebrates?", "is_impossible": true}, {"question": "What only exists outside of jawed vertebrates?", "is_impossible": true}, {"question": "What primitive jawed vertebrates do not contain lymphocyte-derived molecules?", "is_impossible": true}, {"question": "What are produced from a large number of genes?", "is_impossible": true}, {"question": "What molecules are repelled by pathogenic antigens?", "is_impossible": true}]}, {"id": "26_39", "context": "It is likely that a multicomponent, adaptive immune system arose with the first vertebrates, as invertebrates do not generate lymphocytes or an antibody-based humoral response. Many species, however, utilize mechanisms that appear to be precursors of these aspects of vertebrate immunity. Immune systems appear even in the structurally most simple forms of life, with bacteria using a unique defense mechanism, called the restriction modification system to protect themselves from viral pathogens, called bacteriophages. Prokaryotes also possess acquired immunity, through a system that uses CRISPR sequences to retain fragments of the genomes of phage that they have come into contact with in the past, which allows them to block virus replication through a form of RNA interference. Offensive elements of the immune systems are also present in unicellular eukaryotes, but studies of their roles in defense are few.", "questions": [{"question": "Invertebrates do not generate what type of cells that are a part of the vertebrate adaptive immune system?", "is_impossible": false}, {"question": "What is the main defense mechanism of bacteria known as?", "is_impossible": false}, {"question": "The restriction modification system is used by bacteria for protection from what pathogens?", "is_impossible": false}, {"question": "What is the system by which prokaryotes retain phage gene fragments that they have previously come in contact with?", "is_impossible": false}, {"question": "Where is it unlikely that the first multicomponent, adaptive immune system arose?", "is_impossible": true}, {"question": "What arose in the latest vertebrates?", "is_impossible": true}, {"question": "What mechanisms do many species not utilize?", "is_impossible": true}, {"question": "What kind of immunity do prokaryotes not have?", "is_impossible": true}, {"question": "What has often been studied in unicellular eukaryotes?", "is_impossible": true}]}, {"id": "26_40", "context": "Immunology is strongly experimental in everyday practice but is also characterized by an ongoing theoretical attitude. Many theories have been suggested in immunology from the end of the nineteenth century up to the present time. The end of the 19th century and the beginning of the 20th century saw a battle between \"cellular\" and \"humoral\" theories of immunity. According to the cellular theory of immunity, represented in particular by Elie Metchnikoff, it was cells – more precisely, phagocytes – that were responsible for immune responses. In contrast, the humoral theory of immunity, held, among others, by Robert Koch and Emil von Behring, stated that the active immune agents were soluble components (molecules) found in the organism’s “humors” rather than its cells.", "questions": [{"question": "What were the two main theories of immunity at the end of the 19th century?", "is_impossible": false}, {"question": "Who was the main proponent of the cellular theory of immunity?", "is_impossible": false}, {"question": "Under Elie Metchnikoff's cellular theory, what cells were responsible for immune response?", "is_impossible": false}, {"question": "What two scientists were proponents of the humoral theory of immunity?", "is_impossible": false}, {"question": "According to the humoral theory of immunity, what were the bodies immune agents?", "is_impossible": false}, {"question": "What was suggested in immunology before the 19th century?", "is_impossible": true}, {"question": "Who was the main detractor of the cellular theory of immunity?", "is_impossible": true}, {"question": "Who were the main detractors of the humoral theory of immunity?", "is_impossible": true}, {"question": "What did cellular theory claim was in an organism's humors?", "is_impossible": true}]}, {"id": "26_41", "context": "Clearly, some tumors evade the immune system and go on to become cancers. Tumor cells often have a reduced number of MHC class I molecules on their surface, thus avoiding detection by killer T cells. Some tumor cells also release products that inhibit the immune response; for example by secreting the cytokine TGF-β, which suppresses the activity of macrophages and lymphocytes. In addition, immunological tolerance may develop against tumor antigens, so the immune system no longer attacks the tumor cells.", "questions": [{"question": "Tumors that are able to evade the body's immune response can become what?", "is_impossible": false}, {"question": "What receptors do tumor cells often have reduced concentrations of?", "is_impossible": false}, {"question": "What is a chemical secreted by tumors that suppresses the immune response?", "is_impossible": false}, {"question": "Cytokine TBF-B suppresses the activity of what cell types?", "is_impossible": false}, {"question": "What is unable to evade the immune system?", "is_impossible": true}, {"question": "What makes detection by killer T cells more likely?", "is_impossible": true}, {"question": "What do tumor cells release that strengthens the immune response?", "is_impossible": true}, {"question": "What does cytokine TGF-β encourage the activity of?", "is_impossible": true}, {"question": "What happens when the immune system loses tolerance for tumor antigens?", "is_impossible": true}]}, {"id": "26_42", "context": "Hypersensitivity is an immune response that damages the body's own tissues. They are divided into four classes (Type I – IV) based on the mechanisms involved and the time course of the hypersensitive reaction. Type I hypersensitivity is an immediate or anaphylactic reaction, often associated with allergy. Symptoms can range from mild discomfort to death. Type I hypersensitivity is mediated by IgE, which triggers degranulation of mast cells and basophils when cross-linked by antigen. Type II hypersensitivity occurs when antibodies bind to antigens on the patient's own cells, marking them for destruction. This is also called antibody-dependent (or cytotoxic) hypersensitivity, and is mediated by IgG and IgM antibodies. Immune complexes (aggregations of antigens, complement proteins, and IgG and IgM antibodies) deposited in various tissues trigger Type III hypersensitivity reactions. Type IV hypersensitivity (also known as cell-mediated or delayed type hypersensitivity) usually takes between two and three days to develop. Type IV reactions are involved in many autoimmune and infectious diseases, but may also involve contact dermatitis (poison ivy). These reactions are mediated by T cells, monocytes, and macrophages.", "questions": [{"question": "What is the name for a response of the immune system that damages the body's native tissues?", "is_impossible": false}, {"question": "How many classes of immune hypersensitivity are there?", "is_impossible": false}, {"question": "What type of hypersensitivity is associated with allergies?", "is_impossible": false}, {"question": "What is the chemical that mediates Type 1 hypersensitivity?", "is_impossible": false}, {"question": "Antibody-dependent hypersensitivity belongs to what class of hypersensitivity?", "is_impossible": false}, {"question": "What is an immune response that heals the body's own tissues?", "is_impossible": true}, {"question": "What is divided into five classes?", "is_impossible": true}, {"question": "What is not a symptom of type I hypersensitivity?", "is_impossible": true}, {"question": "What type of hypersensitivity takes between two and three weeks to develop?", "is_impossible": true}, {"question": "What occurs when antibodies will not bind to the patient's cells?", "is_impossible": true}]}, {"id": "26_43", "context": "An evasion strategy used by several pathogens to avoid the innate immune system is to hide within the cells of their host (also called intracellular pathogenesis). Here, a pathogen spends most of its life-cycle inside host cells, where it is shielded from direct contact with immune cells, antibodies and complement. Some examples of intracellular pathogens include viruses, the food poisoning bacterium Salmonella and the eukaryotic parasites that cause malaria (Plasmodium falciparum) and leishmaniasis (Leishmania spp.). Other bacteria, such as Mycobacterium tuberculosis, live inside a protective capsule that prevents lysis by complement. Many pathogens secrete compounds that diminish or misdirect the host's immune response. Some bacteria form biofilms to protect themselves from the cells and proteins of the immune system. Such biofilms are present in many successful infections, e.g., the chronic Pseudomonas aeruginosa and Burkholderia cenocepacia infections characteristic of cystic fibrosis. Other bacteria generate surface proteins that bind to antibodies, rendering them ineffective; examples include Streptococcus (protein G), Staphylococcus aureus (protein A), and Peptostreptococcus magnus (protein L).", "questions": [{"question": "What is the process by which pathogens evade the immune system by hiding inside the host cells called?", "is_impossible": false}, {"question": "What food bacteria is an example of intracellular pathogenesis?", "is_impossible": false}, {"question": "What is the eukaryotic parasite responsible for malaria known as?", "is_impossible": false}, {"question": "What bacteria lives inside a protective capsule that serves to prevent cell lysis?", "is_impossible": false}, {"question": "What protein does Staphylococcus aureus produce to make antibodies ineffective?", "is_impossible": false}, {"question": "What strategy is used by pathogens to encounter the innate immune system?", "is_impossible": true}, {"question": "What is it called when a pathogen spends most of its lifecycle outside of host cells? ", "is_impossible": true}, {"question": "Where does a pathogen come in direct contact with immune cells, antibodies and complement?", "is_impossible": true}, {"question": "What secretes pathogens that enhance the host's immune response?", "is_impossible": true}, {"question": "What do bacterial surface proteins not bind to?", "is_impossible": true}]}, {"id": "26_44", "context": "The mechanisms used to evade the adaptive immune system are more complicated. The simplest approach is to rapidly change non-essential epitopes (amino acids and/or sugars) on the surface of the pathogen, while keeping essential epitopes concealed. This is called antigenic variation. An example is HIV, which mutates rapidly, so the proteins on its viral envelope that are essential for entry into its host target cell are constantly changing. These frequent changes in antigens may explain the failures of vaccines directed at this virus. The parasite Trypanosoma brucei uses a similar strategy, constantly switching one type of surface protein for another, allowing it to stay one step ahead of the antibody response. Masking antigens with host molecules is another common strategy for avoiding detection by the immune system. In HIV, the envelope that covers the virion is formed from the outermost membrane of the host cell; such \"self-cloaked\" viruses make it difficult for the immune system to identify them as \"non-self\" structures.", "questions": [{"question": "What is the process by which the adaptive immune system is evaded by the chainging of non-essential epitopes called?", "is_impossible": false}, {"question": "What is an example of a virus that uses antigenic variation?", "is_impossible": false}, {"question": "What is an example of a parasite that used the antigenic variation strategy to evade destruction?", "is_impossible": false}, {"question": "What compounds can be masked with the molecules of the host cell in order for a virus to evade detection?", "is_impossible": false}, {"question": "What are the less complex mechanisms used to do?", "is_impossible": true}, {"question": "What is the most complex way to avoid the adaptive immune system?", "is_impossible": true}, {"question": "What is a pathogen that does not use antigenic variation?", "is_impossible": true}, {"question": "What does not explain the failure of vaccines directed at the HIV virus?", "is_impossible": true}, {"question": "What is a parasite that always uses the same surface protein?", "is_impossible": true}]}, {"id": "26_45", "context": "Another important role of the immune system is to identify and eliminate tumors. This is called immune surveillance. The transformed cells of tumors express antigens that are not found on normal cells. To the immune system, these antigens appear foreign, and their presence causes immune cells to attack the transformed tumor cells. The antigens expressed by tumors have several sources; some are derived from oncogenic viruses like human papillomavirus, which causes cervical cancer, while others are the organism's own proteins that occur at low levels in normal cells but reach high levels in tumor cells. One example is an enzyme called tyrosinase that, when expressed at high levels, transforms certain skin cells (e.g. melanocytes) into tumors called melanomas. A third possible source of tumor antigens are proteins normally important for regulating cell growth and survival, that commonly mutate into cancer inducing molecules called oncogenes.", "questions": [{"question": "What is the process by which the immune system identifies tumors called?", "is_impossible": false}, {"question": "What is the virus in humans that causes cervical cancer?", "is_impossible": false}, {"question": "What is an example of an enzyme that can transform skin cells into tumors when expressed at high levels?", "is_impossible": false}, {"question": "What are cancerous tumors of the skin known as?", "is_impossible": false}, {"question": "What are the skin cells that can be transformed into tumors known as?", "is_impossible": false}, {"question": "What is not an important role of the immune system?", "is_impossible": true}, {"question": "What do tumors express that are also found on normal cells?", "is_impossible": true}, {"question": "What is not a cause of tumor antigens?", "is_impossible": true}, {"question": "What happens when tyrosinase is expressed at low levels?", "is_impossible": true}, {"question": "What is a fourth possible source for tumor antigens?", "is_impossible": true}]}, {"id": "26_46", "context": "Larger drugs (>500 Da) can provoke a neutralizing immune response, particularly if the drugs are administered repeatedly, or in larger doses. This limits the effectiveness of drugs based on larger peptides and proteins (which are typically larger than 6000 Da). In some cases, the drug itself is not immunogenic, but may be co-administered with an immunogenic compound, as is sometimes the case for Taxol. Computational methods have been developed to predict the immunogenicity of peptides and proteins, which are particularly useful in designing therapeutic antibodies, assessing likely virulence of mutations in viral coat particles, and validation of proposed peptide-based drug treatments. Early techniques relied mainly on the observation that hydrophilic amino acids are overrepresented in epitope regions than hydrophobic amino acids; however, more recent developments rely on machine learning techniques using databases of existing known epitopes, usually on well-studied virus proteins, as a training set. A publicly accessible database has been established for the cataloguing of epitopes from pathogens known to be recognizable by B cells. The emerging field of bioinformatics-based studies of immunogenicity is referred to as immunoinformatics. Immunoproteomics is the study of large sets of proteins (proteomics) involved in the immune response.", "questions": [{"question": "At what size and larger can drugs elicit a neutralizing immune response?", "is_impossible": false}, {"question": "What kind of amino acids are overrepresented in epitope regions?", "is_impossible": false}, {"question": "What is the study of proteins involved in immune response known as?", "is_impossible": false}, {"question": "There is a public database of epitopes for pathogens known to be recognizable by what cells?", "is_impossible": false}, {"question": "What is the field of studying immunogenicity through bioinformatics known as?", "is_impossible": false}, {"question": "What kind of immune response do smaller drugs provoke?", "is_impossible": true}, {"question": "What does the neutralizing immune response mean for drugs based on smaller peptides and proteins?", "is_impossible": true}, {"question": "What is not a way that is used to predict the immunogenicity of peptides and proteins?", "is_impossible": true}, {"question": "What is underrepresented in epitope regions?", "is_impossible": true}, {"question": "What is the study of small sets of proteins?", "is_impossible": true}]}, {"id": "26_47", "context": "In addition to the negative consequences of sleep deprivation, sleep and the intertwined circadian system have been shown to have strong regulatory effects on immunological functions affecting both the innate and the adaptive immunity. First, during the early slow-wave-sleep stage, a sudden drop in blood levels of cortisol, epinephrine, and norepinephrine induce increased blood levels of the hormones leptin, pituitary growth hormone, and prolactin. These signals induce a pro-inflammatory state through the production of the pro-inflammatory cytokines interleukin-1, interleukin-12, TNF-alpha and IFN-gamma. These cytokines then stimulate immune functions such as immune cells activation, proliferation, and differentiation. It is during this time that undifferentiated, or less differentiated, like naïve and central memory T cells, peak (i.e. during a time of a slowly evolving adaptive immune response). In addition to these effects, the milieu of hormones produced at this time (leptin, pituitary growth hormone, and prolactin) support the interactions between APCs and T-cells, a shift of the Th1/Th2 cytokine balance towards one that supports Th1, an increase in overall Th cell proliferation, and naïve T cell migration to lymph nodes. This milieu is also thought to support the formation of long-lasting immune memory through the initiation of Th1 immune responses.", "questions": [{"question": "Drop in the blood levels of cortisol and epinephrine results in increase levels of what hormones?", "is_impossible": false}, {"question": "Hormones released during sleep support the interaction of T-cells and what species?", "is_impossible": false}, {"question": "Sleep hormones shift the cytokine balance to which cytokine?", "is_impossible": false}, {"question": "Sleep hormone release supports formation of immune memory by initiating what immune response?", "is_impossible": false}, {"question": "What does sleep have no effect on?", "is_impossible": true}, {"question": "What rises during early slow-wave-sleep stage?", "is_impossible": true}, {"question": "What slows down immune functions during sleep?", "is_impossible": true}, {"question": "What hormones are produced mostly when awake?", "is_impossible": true}, {"question": "What do hormones produced during this time stop from interacting?", "is_impossible": true}]}, {"id": "26_48", "context": "Pathogens can rapidly evolve and adapt, and thereby avoid detection and neutralization by the immune system; however, multiple defense mechanisms have also evolved to recognize and neutralize pathogens. Even simple unicellular organisms such as bacteria possess a rudimentary immune system, in the form of enzymes that protect against bacteriophage infections. Other basic immune mechanisms evolved in ancient eukaryotes and remain in their modern descendants, such as plants and invertebrates. These mechanisms include phagocytosis, antimicrobial peptides called defensins, and the complement system. Jawed vertebrates, including humans, have even more sophisticated defense mechanisms, including the ability to adapt over time to recognize specific pathogens more efficiently. Adaptive (or acquired) immunity creates immunological memory after an initial response to a specific pathogen, leading to an enhanced response to subsequent encounters with that same pathogen. This process of acquired immunity is the basis of vaccination.", "questions": [{"question": "The immune systems of bacteria have enzymes that protect against infection by what kind of cells?", "is_impossible": false}, {"question": "What are antimicrobial peptides that evolved as immune defense in eukaryotes called?", "is_impossible": false}, {"question": "The idea of acquired immunity in jawed vertebrates is the basis of what medical treatment?", "is_impossible": false}, {"question": "What is the ability to recognize and adapt to new specific pathogens called?", "is_impossible": false}, {"question": "What is known for adapting and evolving slowly?", "is_impossible": true}, {"question": "What do simple unicellular organisms lack?", "is_impossible": true}, {"question": "What is an example of a less sophisticated defense mechanism that jawed vertebrates have?", "is_impossible": true}, {"question": "What creates immunological memory before the initial responds to a pathogen?", "is_impossible": true}, {"question": "What medical treatment is completely different from acquired immunity?", "is_impossible": true}]}, {"id": "26_49", "context": "In humans, this response is activated by complement binding to antibodies that have attached to these microbes or the binding of complement proteins to carbohydrates on the surfaces of microbes. This recognition signal triggers a rapid killing response. The speed of the response is a result of signal amplification that occurs following sequential proteolytic activation of complement molecules, which are also proteases. After complement proteins initially bind to the microbe, they activate their protease activity, which in turn activates other complement proteases, and so on. This produces a catalytic cascade that amplifies the initial signal by controlled positive feedback. The cascade results in the production of peptides that attract immune cells, increase vascular permeability, and opsonize (coat) the surface of a pathogen, marking it for destruction. This deposition of complement can also kill cells directly by disrupting their plasma membrane.", "questions": [{"question": "Complement proteins bind to what kind of molecules on the surface of microbes in order to elicit an immune response?", "is_impossible": false}, {"question": "The speed of the killing response of the human immune system is a product of what process?", "is_impossible": false}, {"question": "What type of cascade results when complement proteins bind to microbes and activate their protease activity?", "is_impossible": false}, {"question": "How can the deposition of compliment kill invader cells directly?", "is_impossible": false}, {"question": "What is this kind of response activated by plants?", "is_impossible": true}, {"question": "What triggers a slow killing response?", "is_impossible": true}, {"question": "What has nothing to do with the speed of the response?", "is_impossible": true}, {"question": "What do complement proteins activate before they bind to the microbe?", "is_impossible": true}, {"question": "What repels immune cells?", "is_impossible": true}]}]}
