{"data": [{"id": "29_1", "context": "One of its earliest massive implementations was brought about by Egyptians against the British occupation in the 1919 Revolution. Civil disobedience is one of the many ways people have rebelled against what they deem to be unfair laws. It has been used in many nonviolent resistance movements in India (Gandhi's campaigns for independence from the British Empire), in Czechoslovakia's Velvet Revolution and in East Germany to oust their communist governments, In South Africa in the fight against apartheid, in the American Civil Rights Movement, in the Singing Revolution to bring independence to the Baltic countries from the Soviet Union, recently with the 2003 Rose Revolution in Georgia and the 2004 Orange Revolution in Ukraine, among other various movements worldwide.", "questions": ["What is it called when people in society rebel against laws they think are unfair?", "What is an example of major civil disobedience in South Africa?", "What was the the movement called that brought Baltic countries independence from the Soviet Union?", "In 2004 the Orange revolution occurred in what country?", "Where was the location of the 2003 Rose revolution?", "Which people brought forward one of the earliest examples of Civil Disobedience?", "Who was one of the earliest examples of Civil Disobedience against?", "Why do people chose civil disobedience to protest?", "What does civil disobedience protest against?", "What civil rights movement in the US was known for it's disobedience?"]}, {"id": "29_2", "context": "One of the oldest depictions of civil disobedience is in Sophocles' play Antigone, in which Antigone, one of the daughters of former King of Thebes, Oedipus, defies Creon, the current King of Thebes, who is trying to stop her from giving her brother Polynices a proper burial. She gives a stirring speech in which she tells him that she must obey her conscience rather than human law. She is not at all afraid of the death he threatens her with (and eventually carries out), but she is afraid of how her conscience will smite her if she does not do this.", "questions": ["Sophocles demonstrated civil disobedience in a play that was called?", "Who is Antigone's father in the play?", "What is the name of the current King of Thebes in the play?", "What character in the play portrays civil disobedience?", "What is Creon trying to stop Antigone from doing in the play? ", "What play showed an early depiction of civil disobedience?", "Antigone was a play made by whom?", "In Antigone, who was the target of civil disobedience?", "What was the protest in Antigone about?", "How was the civil disobedience shown in Antigone?"]}, {"id": "29_3", "context": "Following the Peterloo massacre of 1819, poet Percy Shelley wrote the political poem The Mask of Anarchy later that year, that begins with the images of what he thought to be the unjust forms of authority of his time—and then imagines the stirrings of a new form of social action. It is perhaps the first modern[vague] statement of the principle of nonviolent protest. A version was taken up by the author Henry David Thoreau in his essay Civil Disobedience, and later by Gandhi in his doctrine of Satyagraha. Gandhi's Satyagraha was partially influenced and inspired by Shelley's nonviolence in protest and political action. In particular, it is known that Gandhi would often quote Shelley's Masque of Anarchy to vast audiences during the campaign for a free India.", "questions": ["After the Peterloo massacre what poet wrote The Massacre of Anarchy?", "His poem is considered the first kind of what type of protest?", "Inspired by Shelley what was the name of Gandhi's doctrine?", "Gandhi often referenced Shelley's poem in his efforts to do what? ", "What famous author used similarity and likeness of Percy Shelly in his writing?", "Who wrote the poem The Mark of Anarchy?", "The Mark of Anarchy was written to protest against what?", "What was the principle shown in The Mark of Anarchy?", "What was Ghandi's work called?", "Which famous Indian practiced civil disobedience?"]}, {"id": "29_4", "context": "It has been argued that the term \"civil disobedience\" has always suffered from ambiguity and in modern times, become utterly debased. Marshall Cohen notes, \"It has been used to describe everything from bringing a test-case in the federal courts to taking aim at a federal official. Indeed, for Vice President Agnew it has become a code-word describing the activities of muggers, arsonists, draft evaders, campaign hecklers, campus militants, anti-war demonstrators, juvenile delinquents and political assassins.\"", "questions": ["Vice President Agnew describes Civil disobedience in what activities?", "What person argues that civil disobedience is used to describe everything?", "Civil disobedience has been argued in more recent times to have suffered from what?", "More in the present prevalence of civil disobedience has turned and said to be?", "In modern times, what is said about civil disobedience?", "Who noted the different current uses of civil disobedience?", "How has civil disobedience evolved in current times?", "Who gave a negative connotation to civil disobedience in recent history?", "What issue has been plaguing the civil disobedience movement."]}, {"id": "29_5", "context": "LeGrande writes that \"the formulation of a single all-encompassing definition of the term is extremely difficult, if not impossible. In reviewing the voluminous literature on the subject, the student of civil disobedience rapidly finds himself surrounded by a maze of semantical problems and grammatical niceties. Like Alice in Wonderland, he often finds that specific terminology has no more (or no less) meaning than the individual orator intends it to have.\" He encourages a distinction between lawful protest demonstration, nonviolent civil disobedience, and violent civil disobedience.", "questions": ["Who wrote that it is difficult to produce an all inclusive definition of civil disobedience?", "Le Grande also wrote that defining the term civil disobedience so difficult it could be described as? ", "Le grand asks for a variance of what three terms?", "Le grand states that students studying civil disobedience will often run into grammatical niceties and what other problem? ", "Le grand concludes that an author's words offer only what they intended for them to imply regarding this type of terminology?", "Who said that writing a good description of civil disobedience is hard?", "How much literature has been written regarding civil disobedience?", "What issue plagues the literature about civil disobedience?", "What type of protest falls under civil disobedience without aggression?", "What type of civil disobedience is accompanied by aggression?"]}, {"id": "29_6", "context": "Civil disobedience is usually defined as pertaining to a citizen's relation to the state and its laws, as distinguished from a constitutional impasse in which two public agencies, especially two equally sovereign branches of government, conflict. For instance, if the head of government of a country were to refuse to enforce a decision of that country's highest court, it would not be civil disobedience, since the head of government would be acting in her or his capacity as public official rather than private citizen.", "questions": ["If the head of government refuses to enforce a decision of the highest court what terminology could be used?", "Constitutional impasse is different from civil disobedience because does not include what type of person?", "How is civil disobedience typically defined in connection of the citizen's?", "When would a person be considered to be excising a constitutional impasse?", "Constitutional impasse is distinct from what key term? ", "What does civil disobedience relate to?", "What does not constitute as civil disobedience?", "What type of person can not be attributed civil disobedience?", "Civil Disobedience is mainly performed by what population group?", "What group of people cannot be part of civil disobedience?"]}, {"id": "29_7", "context": "However, this definition is disputed by Thoreau's political philosophy pitching the conscience vs. the collective. The individual is the final judge of right and wrong. More than this, since only individuals act, only individuals can act unjustly. When the government knocks on the door, it is an individual in the form of a postman or tax collector whose hand hits the wood. Before Thoreau’s imprisonment, when a confused taxman had wondered aloud about how to handle his refusal to pay, Thoreau had advised, “Resign.” If a man chose to be an agent of injustice, then Thoreau insisted on confronting him with the fact that he was making a choice. But if government is “the voice of the people,” as it is often called, shouldn’t that voice be heeded? Thoreau admits that government may express the will of the majority but it may also express nothing more than the will of elite politicians. Even a good form of government is “liable to be abused and perverted before the people can act through it.” Moreover, even if a government did express the voice of the people, this fact would not compel the obedience of individuals who disagree with what is being said. The majority may be powerful but it is not necessarily right. What, then, is the proper relationship between the individual and the government?", "questions": ["What author argues pitching the conscience versus the collective?", "What was Thoreau's punishment for not paying his taxes?", "Thoreau argues that usually majority rules but their views collectively are sometimes?", "What did Thoreau ask a public figure the taxman to do?", "Thoreau mentions what type of person could corrupt a government system?", "Who is the final judge of right and wrong?", "Who is to blame for acting unjustly?", "Who was famous for disobedience against a tax collector?", "What advise did Thoreau give the tax collector when unable to perform his duty?", "What did Thoreau claim about the majority?"]}, {"id": "29_8", "context": "Some theories of civil disobedience hold that civil disobedience is only justified against governmental entities. Brownlee argues that disobedience in opposition to the decisions of non-governmental agencies such as trade unions, banks, and private universities can be justified if it reflects \"a larger challenge to the legal system that permits those decisions to be taken\". The same principle, she argues, applies to breaches of law in protest against international organizations and foreign governments.", "questions": ["Some theories argue that civil disobedience is justified in regard to?", "Brownlee argues disobedience can be justified toward what institutions?", "Brownlee justifies civil disobedience toward what branch of the government?", "Browlee also applies that civil disobedience is okay regarding?", "Who claims that public companies can also be part of civil disobedience?", "What reason is given that you should also protest public companies?", "What do some theories claim about civil disobedience?", "What public entity of learning is often target of civil disobedience?"]}, {"id": "29_9", "context": "It is usually recognized that lawbreaking, if it is not done publicly, at least must be publicly announced in order to constitute civil disobedience. But Stephen Eilmann argues that if it is necessary to disobey rules that conflict with morality, we might ask why disobedience should take the form of public civil disobedience rather than simply covert lawbreaking. If a lawyer wishes to help a client overcome legal obstacles to securing her or his natural rights, he might, for instance, find that assisting in fabricating evidence or committing perjury is more effective than open disobedience. This assumes that common morality does not have a prohibition on deceit in such situations. The Fully Informed Jury Association's publication \"A Primer for Prospective Jurors\" notes, \"Think of the dilemma faced by German citizens when Hitler's secret police demanded to know if they were hiding a Jew in their house.\" By this definition, civil disobedience could be traced back to the Book of Exodus, where Shiphrah and Puah refused a direct order of Pharaoh but misrepresented how they did it. (Exodus 1: 15-19)", "questions": ["If law breaking is not done in a public manor it is not considered what term?", "Stephen Eilmann asks why show public civil disobedience instead what is a better idea?", "Stephen Eilmann demonstrates covert law breaking in Nazi Germany.   Citizen's illegally had been doing what? ", "Stephen Eildmann cites the oldest known example of civil disobedience in what part of the bible? ", "What two women were defying the pharaoh in the story from the book of Exodus? ", "What must be done to make non public lawbreaking acknowledged as civil disobedience?", "What is necessary to disobey?", "What is sometimes more effective than civil disobedience at times?", "What dilemma is a good example of moral civil disobedience?", "What book of the Bible discusses civil disobedience?"]}, {"id": "29_10", "context": "There have been debates as to whether civil disobedience must necessarily be non-violent. Black's Law Dictionary includes non-violence in its definition of civil disobedience. Christian Bay's encyclopedia article states that civil disobedience requires \"carefully chosen and legitimate means,\" but holds that they do not have to be non-violent. It has been argued that, while both civil disobedience and civil rebellion are justified by appeal to constitutional defects, rebellion is much more destructive; therefore, the defects justifying rebellion must be much more serious than those justifying disobedience, and if one cannot justify civil rebellion, then one cannot justify a civil disobedients' use of force and violence and refusal to submit to arrest. Civil disobedients' refraining from violence is also said to help preserve society's tolerance of civil disobedience.", "questions": ["Cristian Bay's encyclopedia concludes that civil disobedience does not only include what behavior?", "What dictionary contains a non- violent definition?", "What other terminology is considered much more destructive?", "People behaving with civil disobedience that is not-violent is said to make society have more of what?", "Debates about civil disobedience include or exclude what major practice? ", "What type of civil disobedience is commonly accepted?", "When violence is used, what is civil disobedience sometimes called?", "What is one result of civil rebellion?", "Why is it preferred that civil disobedience is non violent?"]}, {"id": "29_11", "context": "Non-revolutionary civil disobedience is a simple disobedience of laws on the grounds that they are judged \"wrong\" by an individual conscience, or as part of an effort to render certain laws ineffective, to cause their repeal, or to exert pressure to get one's political wishes on some other issue. Revolutionary civil disobedience is more of an active attempt to overthrow a government (or to change cultural traditions, social customs, religious beliefs, etc...revolution doesn't have to be political, i.e. \"cultural revolution\", it simply implies sweeping and widespread change to a section of the social fabric). Gandhi's acts have been described as revolutionary civil disobedience. It has been claimed that the Hungarians under Ferenc Deák directed revolutionary civil disobedience against the Austrian government. Thoreau also wrote of civil disobedience accomplishing \"peaceable revolution.\" Howard Zinn, Harvey Wheeler, and others have identified the right espoused in The Declaration of Independence to \"alter or abolish\" an unjust government to be a principle of civil disobedience. ", "questions": ["What is it called when there is an active attempt to overthrow a government or belief system?", "What group of people performed revolutionary civil disobedience toward the Austrian government?", "The Hungarians performed this civil disobedience under the direction of what person?", "Revolutionary civil disobedience towards culture is highlighted by example of who? ", "What other topics can Civil disobedience pertain to?", "What is a simple form of civil disobedience?", "Why would a person chose civil disobedience against specific laws?", "What is the goal of individual civil disobedience?", "What type of civil disobedience is larger scale?", "What famous Indian's actions were considered civil disobedience?"]}, {"id": "29_12", "context": "The earliest recorded incidents of collective civil disobedience took place during the Roman Empire[citation needed]. Unarmed Jews gathered in the streets to prevent the installation of pagan images in the Temple in Jerusalem.[citation needed][original research?] In modern times, some activists who commit civil disobedience as a group collectively refuse to sign bail until certain demands are met, such as favorable bail conditions, or the release of all the activists. This is a form of jail solidarity.[page needed] There have also been many instances of solitary civil disobedience, such as that committed by Thoreau, but these sometimes go unnoticed. Thoreau, at the time of his arrest, was not yet a well-known author, and his arrest was not covered in any newspapers in the days, weeks and months after it happened. The tax collector who arrested him rose to higher political office, and Thoreau's essay was not published until after the end of the Mexican War.", "questions": ["When did the earliest examples of civil disobedience as a whole occur?", "What did the Jewish people do so pagan items wouldn't be in the temple of Jerusalem?", "Since Thoreau was not a well known writer what happened when he was arrested?", "What position did the tax collector that arrested Thoreau get?", "When was Thoreau's essay published?", "When is the oldest recorded incident of civil disobedience?", "What was the goal of this Roman disobedience?", "What is a recent civil disobedience done in a group form?", "What is the civil disobedience called where people refuse to be released?", "How long did it take for Thoreau's disobedience to be known?"]}, {"id": "29_13", "context": "Civil disobedients have chosen a variety of different illegal acts. Bedau writes, \"There is a whole class of acts, undertaken in the name of civil disobedience, which, even if they were widely practiced, would in themselves constitute hardly more than a nuisance (e.g. trespassing at a nuclear-missile installation)...Such acts are often just a harassment and, at least to the bystander, somewhat inane...The remoteness of the connection between the disobedient act and the objectionable law lays such acts open to the charge of ineffectiveness and absurdity.\" Bedau also notes, though, that the very harmlessness of such entirely symbolic illegal protests toward public policy goals may serve a propaganda purpose. Some civil disobedients, such as the proprietors of illegal medical cannabis dispensaries and Voice in the Wilderness, which brought medicine to Iraq without the permission of the U.S. Government, directly achieve a desired social goal (such as the provision of medication to the sick) while openly breaking the law. Julia Butterfly Hill lived in Luna, a 180-foot (55 m)-tall, 600-year-old California Redwood tree for 738 days, successfully preventing it from being cut down.", "questions": ["Civil disobedients have chosen many different kinds of what type of behaviors?", "Bedau notes that illegal protests towards public policy may serve as what purpose?", "What group of civil disobedients brought medicine to Iraq without the permission of the government?", "How long did Julia Butterfly Hill live in a tree?", "What was the outcome of living in the California Redwood tree?", "What type of actions are taken sometimes in civil disobedience?", "What is an example of illegal disobedience?", "Such protests are usually considered to be what type?", "What type of goals are usually done skirting the law?", "Who lived in a tree to prevent it from being cut down as a form of civil disobedience?"]}, {"id": "29_14", "context": "In cases where the criminalized behavior is pure speech, civil disobedience can consist simply of engaging in the forbidden speech. An example would be WBAI's broadcasting the track \"Filthy Words\" from a George Carlin comedy album, which eventually led to the 1978 Supreme Court case of FCC v. Pacifica Foundation. Threatening government officials is another classic way of expressing defiance toward the government and unwillingness to stand for its policies. For example, Joseph Haas was arrested for allegedly sending an email to the Lebanon, New Hampshire city councilors stating, \"Wise up or die.\"", "questions": ["What was Joseph Haas arrested for?", "What did Joseph Haas say in his email?", "Civil disobedience can occur when people speak about a certain topic that is deemed as?", "WBAI's broadcasting Some of George Carlin's comedy eventually led to what?", "What year did the the case go before the supreme court?", "What is one criminal behavior that is hard to stop by authorities?", "What is one way to use pure speech to reach as much people as possible to protest?", "How can you protest against the government in an individual way?", "What is one way of digital civil disobedience that can have far reaching consequences?"]}, {"id": "29_15", "context": "Some forms of civil disobedience, such as illegal boycotts, refusals to pay taxes, draft dodging, distributed denial-of-service attacks, and sit-ins, make it more difficult for a system to function. In this way, they might be considered coercive. Brownlee notes that \"although civil disobedients are constrained in their use of coercion by their conscientious aim to engage in moral dialogue, nevertheless they may find it necessary to employ limited coercion in order to get their issue onto the table.\" The Plowshares organization temporarily closed GCSB Waihopai by padlocking the gates and using sickles to deflate one of the large domes covering two satellite dishes.", "questions": ["Boycotting, refusing to pay taxes, sit ins, and draft dodging all make what harder?", "Name one way the Plowshares organization temporarily close GCSB Waihopai?", "Name the other way that the Plowshares organization temporarily closed?", "Brownlee argues that sometimes people behave in what way to have their issue heard?", "When large groups of people all boycott a system or don't pay taxes it can be considered?", "What is a type of disobedience against the federal government?", "What side effect of these type of protests is unfortunate?", "What goal do many of these protests have?", "How can you protest against big companies in a non violent way?"]}, {"id": "29_16", "context": "Many of the same decisions and principles that apply in other criminal investigations and arrests arise also in civil disobedience cases. For example, the suspect may need to decide whether or not to grant a consent search of his property, and whether or not to talk to police officers. It is generally agreed within the legal community, and is often believed within the activist community, that a suspect's talking to criminal investigators can serve no useful purpose, and may be harmful. However, some civil disobedients have nonetheless found it hard to resist responding to investigators' questions, sometimes due to a lack of understanding of the legal ramifications, or due to a fear of seeming rude. Also, some civil disobedients seek to use the arrest as an opportunity to make an impression on the officers. Thoreau wrote, \"My civil neighbor, the tax-gatherer, is the very man I have to deal with--for it is, after all, with men and not with parchment that I quarrel--and he has voluntarily chosen to be an agent of the government. How shall he ever know well that he is and does as an officer of the government, or as a man, until he is obliged to consider whether he will treat me, his neighbor, for whom he has respect, as a neighbor and well-disposed man, or as a maniac and disturber of the peace, and see if he can get over this obstruction to his neighborliness without a ruder and more impetuous thought or speech corresponding with his action.\"", "questions": ["What type of government investigations apply to civil disobedience?", "What is a way you can show police officers civil disobedience ?", "What should be avoided when talking to authorities?", "What reasons cause failure of the disobedience with authorities?", "Why do some people purposely resist officers of the law?"]}, {"id": "29_17", "context": "Some civil disobedients feel it is incumbent upon them to accept punishment because of their belief in the validity of the social contract, which is held to bind all to obey the laws that a government meeting certain standards of legitimacy has established, or else suffer the penalties set out in the law. Other civil disobedients who favor the existence of government still don't believe in the legitimacy of their particular government, or don't believe in the legitimacy of a particular law it has enacted. And still other civil disobedients, being anarchists, don't believe in the legitimacy of any government, and therefore see no need to accept punishment for a violation of criminal law that does not infringe the rights of others.", "questions": ["What do some civil disobedient people feel the need to acknowledge.", "Why is the need for acceptance of punishment needed?", "What do some people protest against?", "What is the group called that does not agree with government at all?", "Anarchists do not want to accept punishment for what reason?"]}, {"id": "29_18", "context": "An important decision for civil disobedients is whether or not to plead guilty. There is much debate on this point, as some believe that it is a civil disobedient's duty to submit to the punishment prescribed by law, while others believe that defending oneself in court will increase the possibility of changing the unjust law. It has also been argued that either choice is compatible with the spirit of civil disobedience. ACT-UP's Civil Disobedience Training handbook states that a civil disobedient who pleads guilty is essentially stating, \"Yes, I committed the act of which you accuse me. I don't deny it; in fact, I am proud of it. I feel I did the right thing by violating this particular law; I am guilty as charged,\" but that pleading not guilty sends a message of, \"Guilt implies wrong-doing. I feel I have done no wrong. I may have violated some specific laws, but I am guilty of doing no wrong. I therefore plead not guilty.\" A plea of no contest is sometimes regarded as a compromise between the two. One defendant accused of illegally protesting nuclear power, when asked to enter his plea, stated, \"I plead for the beauty that surrounds us\"; this is known as a \"creative plea,\" and will usually be interpreted as a plea of not guilty.", "questions": ["What is an important personal decision for civil disobedients?", "Which duty do some people believe civil disobedients have?", "Why would one plead guilty to a crime involving civil disobedience?", "Which reason is given sometimes to plead not guilty involving these matters?", "What third type of plea uses creative words?"]}, {"id": "29_19", "context": "When the Committee for Non-Violent Action sponsored a protest in August 1957, at the Camp Mercury nuclear test site near Las Vegas, Nevada, 13 of the protesters attempted to enter the test site knowing that they faced arrest. At a pre-arranged announced time, one at a time they stepped across the \"line\" and were immediately arrested. They were put on a bus and taken to the Nye County seat of Tonopah, Nevada, and arraigned for trial before the local Justice of the Peace, that afternoon. A well known civil rights attorney, Francis Heisler, had volunteered to defend the arrested persons, advising them to plead \"nolo contendere\", as an alternative to pleading either guilty or not-guilty. The arrested persons were found \"guilty,\" nevertheless, and given suspended sentences, conditional on their not reentering the test site grounds.[citation needed]", "questions": ["Where in Las Vegas did a famous protest take place?", "What was the civil disobedience performed at the test site?", "What was the result of the disobedience protesting the nuclear site?", "How did their lawyer suggest they would plea?", "What type of sentences were the protesters given?"]}, {"id": "29_20", "context": "Howard Zinn writes, \"There may be many times when protesters choose to go to jail, as a way of continuing their protest, as a way of reminding their countrymen of injustice. But that is different than the notion that they must go to jail as part of a rule connected with civil disobedience. The key point is that the spirit of protest should be maintained all the way, whether it is done by remaining in jail, or by evading it. To accept jail penitently as an accession to 'the rules' is to switch suddenly to a spirit of subservience, to demean the seriousness of the protest...In particular, the neo-conservative insistence on a guilty plea should be eliminated.\"", "questions": ["Why do some people chose to go to jail for their disobedience?", "Going to jail accomplished what goal of civil disobedience?", "What is the most important item for civil disobedience to follow through?", "Why should one not go to jail?"]}, {"id": "29_21", "context": "Sometimes the prosecution proposes a plea bargain to civil disobedients, as in the case of the Camden 28, in which the defendants were offered an opportunity to plead guilty to one misdemeanor count and receive no jail time. In some mass arrest situations, the activists decide to use solidarity tactics to secure the same plea bargain for everyone. But some activists have opted to enter a blind plea, pleading guilty without any plea agreement in place. Mohandas Gandhi pleaded guilty and told the court, \"I am here to . . . submit cheerfully to the highest penalty that can be inflicted upon me for what in law is a deliberate crime and what appears to me to be the highest duty of a citizen.\"", "questions": ["What type of punishment is sometimes offered to civil disobedients?", "What is usually the goal of taking a plea bargain?", "When many people are arrested, what is a common tactic negotiating?", "What type of plea is sometimes taken as an act of disobedience?", "Which famous Indian took a plea and put himself at the mercy of the courts?"]}, {"id": "29_22", "context": "Some civil disobedience defendants choose to make a defiant speech, or a speech explaining their actions, in allocution. In U.S. v. Burgos-Andujar, a defendant who was involved in a movement to stop military exercises by trespassing on U.S. Navy property argued to the court in allocution that \"the ones who are violating the greater law are the members of the Navy\". As a result, the judge increased her sentence from 40 to 60 days. This action was upheld because, according to the U.S. Court of Appeals for the First Circuit, her statement suggested a lack of remorse, an attempt to avoid responsibility for her actions, and even a likelihood of repeating her illegal actions. Some of the other allocution speeches given by the protesters complained about mistreatment from government officials.", "questions": ["What way do some people perform civil disobedience in a constructive way?", "Why would one want to give a speech?", "Why is giving a defiant speech sometimes more harmful for the individual?", "Why would one want to give more punishment?", "What type of treatment do civil disobedients usually receive?"]}, {"id": "29_23", "context": "Steven Barkan writes that if defendants plead not guilty, \"they must decide whether their primary goal will be to win an acquittal and avoid imprisonment or a fine, or to use the proceedings as a forum to inform the jury and the public of the political circumstances surrounding the case and their reasons for breaking the law via civil disobedience.\" A technical defense may enhance the chances for acquittal but make for more boring proceedings and reduced press coverage. During the Vietnam War era, the Chicago Eight used a political defense, while Benjamin Spock used a technical defense. In countries such as the United States whose laws guarantee the right to a jury trial but do not excuse lawbreaking for political purposes, some civil disobedients seek jury nullification. Over the years, this has been made more difficult by court decisions such as Sparf v. United States, which held that the judge need not inform jurors of their nullification prerogative, and United States v. Dougherty, which held that the judge need not allow defendants to openly seek jury nullification.", "questions": ["What is the primary goal of pleading not guilty when arrested for Civil Disobedience?", "What is a secondary goal of pleading not guilty?", "What would someone who is civilly disobedient do in court?", "What US war has a large amount of Civil Disobedients?", "What can sympathetic Jurors in cases with civil disobedients?"]}, {"id": "29_24", "context": "One theory is that, while disobedience may be helpful, any great amount of it would undermine the law by encouraging general disobedience which is neither conscientious nor of social benefit. Therefore, conscientious lawbreakers must be punished. Michael Bayles argues that if a person violates a law in order to create a test case as to the constitutionality of a law, and then wins his case, then that act did not constitute civil disobedience. It has also been argued that breaking the law for self-gratification, as in the case of a homosexual or cannabis user who does not direct his act at securing the repeal of amendment of the law, is not civil disobedience. Likewise, a protestor who attempts to escape punishment by committing the crime covertly and avoiding attribution, or by denying having committed the crime, or by fleeing the jurisdiction, is generally viewed as not being a civil disobedient.", "questions": ["What needs to be avoided with civil disobedience?", "Why should disobedience by the general public be avoided?", "What is one main reason that civil disobedience is not recognized?", "Why should someone not commit a crime when they are protesting?", "For what reason would someone avoid crimes while protesting?"]}, {"id": "29_25", "context": "Courts have distinguished between two types of civil disobedience: \"Indirect civil disobedience involves violating a law which is not, itself, the object of protest, whereas direct civil disobedience involves protesting the existence of a particular law by breaking that law.\" During the Vietnam War, courts typically refused to excuse the perpetrators of illegal protests from punishment on the basis of their challenging the legality of the Vietnam War; the courts ruled it was a political question. The necessity defense has sometimes been used as a shadow defense by civil disobedients to deny guilt without denouncing their politically motivated acts, and to present their political beliefs in the courtroom. However, court cases such as U.S. v. Schoon have greatly curtailed the availability of the political necessity defense. Likewise, when Carter Wentworth was charged for his role in the Clamshell Alliance's 1977 illegal occupation of the Seabrook Station Nuclear Power Plant, the judge instructed the jury to disregard his competing harms defense, and he was found guilty. Fully Informed Jury Association activists have sometimes handed out educational leaflets inside courthouses despite admonitions not to; according to FIJA, many of them have escaped prosecution because \"prosecutors have reasoned (correctly) that if they arrest fully informed jury leafleters, the leaflets will have to be given to the leafleter's own jury as evidence.\"", "questions": ["What is violating a law which is not the goal of the protest called?", "When the law is a direct target of the protest, what is this called?", "What US war caused a high amount of civil disobedience?", "What type of defense is sometimes used in court by protestors?", "Why are people who distribute leaflets inside courthouses not been arrested?"]}, {"id": "29_26", "context": "Along with giving the offender his \"just deserts\", achieving crime control via incapacitation and deterrence is a major goal of criminal punishment. Brownlee argues, \"Bringing in deterrence at the level of justification detracts from the law’s engagement in a moral dialogue with the offender as a rational person because it focuses attention on the threat of punishment and not the moral reasons to follow this law.\" Leonard Hubert Hoffmann writes, \"In deciding whether or not to impose punishment, the most important consideration would be whether it would do more harm than good. This means that the objector has no right not to be punished. It is a matter for the state (including the judges) to decide on utilitarian grounds whether to do so or not.\"", "questions": ["What is the main goal of criminal punishment of civil disobedients?", "What should be the main goal of not using punishment in a just system?", "Who decides the fate of protesters most of the time?", "What should the punishment rely on instead in a just society?"]}]}
