{"data": [{"id": "29_1", "context": "The Rhine (Romansh: Rein, German: Rhein, French: le Rhin, Dutch: Rijn) is a European river that begins in the Swiss canton of Graubünden in the southeastern Swiss Alps, forms part of the Swiss-Austrian, Swiss-Liechtenstein border, Swiss-German and then the Franco-German border, then flows through the Rhineland and eventually empties into the North Sea in the Netherlands. The biggest city on the river Rhine is Cologne, Germany with a population of more than 1,050,000 people. It is the second-longest river in Central and Western Europe (after the Danube), at about 1,230 km (760 mi),[note 2][note 1] with an average discharge of about 2,900 m3/s (100,000 cu ft/s).", "questions": [{"question": "Where does the Rhine empty?", "is_impossible": false}, {"question": "What is the largest city the Rhine runs through? ", "is_impossible": false}, {"question": "What river is larger than the Rhine?", "is_impossible": false}, {"question": "How long is the Rhine?", "is_impossible": false}, {"question": "Where is the Rhine? ", "is_impossible": false}, {"question": "What country does the Rhine empty?", "is_impossible": false}, {"question": "How long is the Rhine? ", "is_impossible": false}, {"question": "What is the smallest nation that the Rhine runs through?", "is_impossible": true}, {"question": "How long is the Netherlands?", "is_impossible": true}, {"question": "In what country does the Danube empty?", "is_impossible": true}, {"question": "What is the population of the Netherlands?", "is_impossible": true}, {"question": "How long is the Germany?", "is_impossible": true}]}, {"id": "29_2", "context": "The variant forms of the name of the Rhine in modern languages are all derived from the Gaulish name Rēnos, which was adapted in Roman-era geography (1st century BC) as Greek Ῥῆνος (Rhēnos), Latin Rhenus.[note 3] The spelling with Rh- in English Rhine as well as in German Rhein and French Rhin is due to the influence of Greek orthography, while the vocalisation -i- is due to the Proto-Germanic adoption of the Gaulish name as *Rīnaz, via Old Frankish giving Old English Rín, Old High German Rīn, Dutch Rijn (formerly also spelled Rhijn)). The diphthong in modern German Rhein (also adopted in Romansh Rein, Rain) is a Central German development of the early modern period, the Alemannic name Rī(n) retaining the older vocalism,[note 4] as does Ripuarian Rhing, while Palatine has diphthongized Rhei, Rhoi. Spanish is with French in adopting the Germanic vocalism Rin-, while Italian, Occitan and Portuguese retain the Latin Ren-.", "questions": [{"question": "Where does the name Rhine derive from? ", "is_impossible": false}, {"question": "What is the French name for the Rhine? ", "is_impossible": false}, {"question": "What is the Proto-Germanic adaptation of the name of the Rhine?", "is_impossible": false}, {"question": "What century did the name of the Rhine come from?", "is_impossible": false}, {"question": "What does the name The Rhine come from? ", "is_impossible": false}, {"question": "What is the Rhine called in French?", "is_impossible": false}, {"question": "What is the Proto-Germanic adoption of the Gaulish name of the Rhine?", "is_impossible": false}, {"question": "What is the Rhine called in Dutch?", "is_impossible": false}, {"question": "How was the Dutch name for the Rhine originally spelled? ", "is_impossible": false}, {"question": "Where are the variant forms of the name of the Rhine in ancient languages derived from?", "is_impossible": true}, {"question": "What century did the Germanic vocalism Rin come from?", "is_impossible": true}, {"question": "What century did the spelling with Rh- in English Rhine come from?", "is_impossible": true}, {"question": "What century did the French adopt the Germanic vocalism Rin-?", "is_impossible": true}]}, {"id": "29_3", "context": "The length of the Rhine is conventionally measured in \"Rhine-kilometers\" (Rheinkilometer), a scale introduced in 1939 which runs from the Old Rhine Bridge at Constance (0 km) to Hoek van Holland (1036.20 km). The river length is significantly shortened from the river's natural course due to number of canalisation projects completed in the 19th and 20th century.[note 7] The \"total length of the Rhine\", to the inclusion of Lake Constance and the Alpine Rhine is more difficult to measure objectively; it was cited as 1,232 kilometres (766 miles) by the Dutch Rijkswaterstaat in 2010.[note 1]", "questions": [{"question": "What is the conventional method to measure the Rhine? ", "is_impossible": false}, {"question": "When was the scale to measure the Rhine introduced? ", "is_impossible": false}, {"question": "Where does the Rhine river's measurement begin?", "is_impossible": false}, {"question": "Where does the Rhine river's measurement end?", "is_impossible": false}, {"question": "What has shortened the Rhine river? ", "is_impossible": false}, {"question": "What is the conventional measurement of the Rhine? ", "is_impossible": false}, {"question": "When was the measurement of the Rhine introduced? ", "is_impossible": false}, {"question": "Where does the Rhine begin? ", "is_impossible": false}, {"question": "Where does the Rhine end?", "is_impossible": false}, {"question": "Why has the Rhine been shortened?", "is_impossible": false}, {"question": "What is the length of the Old Rhine Bridge at Constance?", "is_impossible": true}, {"question": "What is the length of Hoek van Holland conventionally measured in?", "is_impossible": true}, {"question": "In what year was the Old Rhine Bridge shortened?", "is_impossible": true}, {"question": "In what year did Hoek van Holland begin canalization projects?", "is_impossible": true}, {"question": "How long is Lake Constance?", "is_impossible": true}]}, {"id": "29_4", "context": "Near Tamins-Reichenau the Anterior Rhine and the Posterior Rhine join and form the Rhine. The river makes a distinctive turn to the north near Chur. This section is nearly 86 km long, and descends from a height of 599 m to 396 m. It flows through a wide glacial alpine valley known as the Rhine Valley (German: Rheintal). Near Sargans a natural dam, only a few metres high, prevents it from flowing into the open Seeztal valley and then through Lake Walen and Lake Zurich into the river Aare. The Alpine Rhine begins in the most western part of the Swiss canton of Graubünden, and later forms the border between Switzerland to the West and Liechtenstein and later Austria to the East.", "questions": [{"question": "Near Chur, which direction does the Rhine turn? ", "is_impossible": false}, {"question": "How long is the section of the Rhine near Chur?", "is_impossible": false}, {"question": "What is the alpine valley that the Rhine flows through?", "is_impossible": false}, {"question": "What is the natural dam that the Rhine flows through?", "is_impossible": false}, {"question": "What is the other country the Rhine separates Switzerland to? ", "is_impossible": false}, {"question": "Where does the Rhine make a distinctive turn to the north? ", "is_impossible": false}, {"question": "How long is the section that turns north? ", "is_impossible": false}, {"question": "What is the height of the section that turns north? ", "is_impossible": false}, {"question": "What is the glacial alpine valley known as?", "is_impossible": false}, {"question": "The Rhine forms the border between Austria and what other country? ", "is_impossible": false}, {"question": "Where does the Rhine make a distinctive turn to the south?", "is_impossible": true}, {"question": "How wide is the glacial alpine valley known as the Rhine Valley?", "is_impossible": true}, {"question": "What is the name of natural dam that connects the Rhine Valley?", "is_impossible": true}, {"question": "How long is Austria?", "is_impossible": true}, {"question": "What is the height of the Swiss canton?", "is_impossible": true}]}, {"id": "29_5", "context": "The mouth of the Rhine into Lake Constance forms an inland delta. The delta is delimited in the West by the Alter Rhein (\"Old Rhine\") and in the East by a modern canalized section. Most of the delta is a nature reserve and bird sanctuary. It includes the Austrian towns of Gaißau, Höchst and Fußach. The natural Rhine originally branched into at least two arms and formed small islands by precipitating sediments. In the local Alemannic dialect, the singular is pronounced \"Isel\" and this is also the local pronunciation of Esel (\"Donkey\"). Many local fields have an official name containing this element.", "questions": [{"question": "The Rhine forms an inland delta into which lake?", "is_impossible": false}, {"question": "What is the delta in the Rhine delimited in the west by?", "is_impossible": false}, {"question": "What is the delta in the Rhine delimited in the east by?", "is_impossible": false}, {"question": "In local Alemannic dialect, what is the the singular form of the names of the islands formed by the Rhine?", "is_impossible": false}, {"question": "What is the animal that the Rhine's islands are named after?", "is_impossible": false}, {"question": "The inland delta at the mouth of the Rhine is with what Lake?", "is_impossible": false}, {"question": "What delimits the delta of the Rhine in the East?", "is_impossible": false}, {"question": "What delimits the delta of the Rhine in the west?", "is_impossible": false}, {"question": "What did the Rhine branch off to form in Austria?", "is_impossible": false}, {"question": "What is the Almannic dialect to describe the islands outside in Austria?", "is_impossible": false}, {"question": "What forms Lake Constance into an inland delta?", "is_impossible": true}, {"question": "What is the delta delimited in the South by?", "is_impossible": true}, {"question": "What is the delta delimited in the North by?", "is_impossible": true}, {"question": "What is one of the mammal animals that lives in the nature reserve and bird sanctuary?", "is_impossible": true}, {"question": "What animal sometimes swims in the Rhine?", "is_impossible": true}]}, {"id": "29_6", "context": "A regulation of the Rhine was called for, with an upper canal near Diepoldsau and a lower canal at Fußach, in order to counteract the constant flooding and strong sedimentation in the western Rhine Delta. The Dornbirner Ach had to be diverted, too, and it now flows parallel to the canalized Rhine into the lake. Its water has a darker color than the Rhine; the latter's lighter suspended load comes from higher up the mountains. It is expected that the continuous input of sediment into the lake will silt up the lake. This has already happened to the former Lake Tuggenersee.", "questions": [{"question": "Where is the upper canal regulation of the Rhine?", "is_impossible": false}, {"question": "What is the lower canal regulation of the Rhine?", "is_impossible": false}, {"question": "Besides constant flooding, why else was there regulation of the Rhine?", "is_impossible": false}, {"question": "After the Dornbirner Ach was diverted, where does the Rhine flow now?", "is_impossible": false}, {"question": "What is expected with the continuous input of sediment into the Dornbirner Ach?", "is_impossible": false}, {"question": "Where was the Rhine regulated with a lower canal?", "is_impossible": false}, {"question": "Where was the Rhine regulated with an upper canal?", "is_impossible": false}, {"question": "Why was the Rhine regulated? ", "is_impossible": false}, {"question": "What was diverted and now flows parallel to the Rhine?", "is_impossible": false}, {"question": "What will cause the lake near the Rhine to silt up?", "is_impossible": false}, {"question": "Where is the western canal regulation of the Rhine?", "is_impossible": true}, {"question": "Where is the eastern canal regulation of the Rhine?", "is_impossible": true}, {"question": "What has water that is a lighter color than the Rhine?", "is_impossible": true}, {"question": "Why was Lake Tuggenersee regulated?", "is_impossible": true}, {"question": "What lake no longer has any silt?", "is_impossible": true}]}, {"id": "29_7", "context": "Lake Constance consists of three bodies of water: the Obersee (\"upper lake\"), the Untersee (\"lower lake\"), and a connecting stretch of the Rhine, called the Seerhein (\"Lake Rhine\"). The lake is situated in Germany, Switzerland and Austria near the Alps. Specifically, its shorelines lie in the German states of Bavaria and Baden-Württemberg, the Austrian state of Vorarlberg, and the Swiss cantons of Thurgau and St. Gallen. The Rhine flows into it from the south following the Swiss-Austrian border. It is located at approximately 47°39′N 9°19′E﻿ / ﻿47.650°N 9.317°E﻿ / 47.650; 9.317.", "questions": [{"question": "How many bodies of water makes up Lake Constance? ", "is_impossible": false}, {"question": "What lake connects the Rhine to Lake Constance? ", "is_impossible": false}, {"question": "What does Obersee mean?", "is_impossible": false}, {"question": "What does Untersee mean?", "is_impossible": false}, {"question": "Which border does the Rhine flow from the south?", "is_impossible": false}, {"question": "How many bodies of water makes up Lake Constance?", "is_impossible": false}, {"question": "Besides Germany and Switzerland, where else is Lake Constance?", "is_impossible": false}, {"question": "What mountainous region is Lake Constance by?", "is_impossible": false}, {"question": "Where is the border of Swiss and Austria?", "is_impossible": false}, {"question": "Lake Constance separates the German state Bavaria from what other one?", "is_impossible": false}, {"question": "How many bodies of water make up the Rhine?", "is_impossible": true}, {"question": "Where is the border of Bavaria?", "is_impossible": true}, {"question": "Where is the border of Germany?", "is_impossible": true}, {"question": "Which border does the Rhine flow from the north?", "is_impossible": true}, {"question": "How many bodies of water make up the Obersee?", "is_impossible": true}]}, {"id": "29_8", "context": "The flow of cold, gray mountain water continues for some distance into the lake. The cold water flows near the surface and at first doesn't mix with the warmer, green waters of Upper Lake. But then, at the so-called Rheinbrech, the Rhine water abruptly falls into the depths because of the greater density of cold water. The flow reappears on the surface at the northern (German) shore of the lake, off the island of Lindau. The water then follows the northern shore until Hagnau am Bodensee. A small fraction of the flow is diverted off the island of Mainau into Lake Überlingen. Most of the water flows via the Constance hopper into the Rheinrinne (\"Rhine Gutter\") and Seerhein. Depending on the water level, this flow of the Rhine water is clearly visible along the entire length of the lake.", "questions": [{"question": "Why does the Rhine water fall into depths at the Rheinbrech?", "is_impossible": false}, {"question": "Where does the cold and warm water meet the warm water?", "is_impossible": false}, {"question": "What is the Island off of the German shore of the Rhine that this warm and cold water meet?", "is_impossible": false}, {"question": "What Lake in a German island Mainau receives a fraction of the Rhine's flow?", "is_impossible": false}, {"question": "How much of the lake connecting with the Rhine can you see from the German islands?", "is_impossible": false}, {"question": "Where does the cold water mix with Lake Constance?", "is_impossible": false}, {"question": "What island does the cold water flow of the Rhine and Lake Constance flow to?", "is_impossible": false}, {"question": "A small fraction of the cold water flow from Lake Constance goes to what other lake?", "is_impossible": false}, {"question": "What does the word Rheinrinne translate to?", "is_impossible": false}, {"question": "What does the flow of the Rhine being visible depend on?", "is_impossible": false}, {"question": "What water abruptly falls into the depths due to the greater density of warmer water?", "is_impossible": true}, {"question": "What does the word Seerhein translate to?", "is_impossible": true}, {"question": "What water is constantly visible along the entire length of the lake?", "is_impossible": true}, {"question": "A large part of the flow is diverted off the island of Mainau into where?", "is_impossible": true}, {"question": "What water has cold green waters?", "is_impossible": true}]}, {"id": "29_9", "context": "The Rhine emerges from Lake Constance, flows generally westward, as the Hochrhein, passes the Rhine Falls, and is joined by its major tributary, the river Aare. The Aare more than doubles the Rhine's water discharge, to an average of nearly 1,000 m3/s (35,000 cu ft/s), and provides more than a fifth of the discharge at the Dutch border. The Aare also contains the waters from the 4,274 m (14,022 ft) summit of Finsteraarhorn, the highest point of the Rhine basin. The Rhine roughly forms the German-Swiss border from Lake Constance with the exceptions of the canton of Schaffhausen and parts of the cantons of Zürich and Basel-Stadt, until it turns north at the so-called Rhine knee at Basel, leaving Switzerland.", "questions": [{"question": "After the Rhine emerges from Lake Constance, what direction does it flow?", "is_impossible": false}, {"question": "What is the major tributary of the Rhine?", "is_impossible": false}, {"question": "How much water does the Aare give to the Rhine?", "is_impossible": false}, {"question": "Where is the highest point of the Rhine basin?", "is_impossible": false}, {"question": "Where is the so-called Rhine Knee?", "is_impossible": false}, {"question": "When the Rhine emerges from Lake Constance which way does it flow?", "is_impossible": false}, {"question": "What is the major tributary for the Rhine? ", "is_impossible": false}, {"question": "The Rhine gets how much water from the Aare?", "is_impossible": false}, {"question": "What is the highest point of the Rhine basin called?", "is_impossible": false}, {"question": "There's a rough border between Switzerland and what other country formed by the Rhine?", "is_impossible": false}, {"question": "What is the major tributary of Lake Constance?", "is_impossible": true}, {"question": "The Hochrhein more than doubles the Rhine's water discharge to what amount?", "is_impossible": true}, {"question": "Where does Lake Constance emerge from?", "is_impossible": true}, {"question": "What lake contains part of the Rhine Falls?", "is_impossible": true}, {"question": "What is the lowest point of the Rhine basin called?", "is_impossible": true}]}, {"id": "29_10", "context": "In the centre of Basel, the first major city in the course of the stream, is located the \"Rhine knee\"; this is a major bend, where the overall direction of the Rhine changes from West to North. Here the High Rhine ends. Legally, the Central Bridge is the boundary between High and Upper Rhine. The river now flows North as Upper Rhine through the Upper Rhine Plain, which is about 300 km long and up to 40 km wide. The most important tributaries in this area are the Ill below of Strasbourg, the Neckar in Mannheim and the Main across from Mainz. In Mainz, the Rhine leaves the Upper Rhine Valley and flows through the Mainz Basin.", "questions": [{"question": "What is the first major city in the stream of the Rhine?", "is_impossible": false}, {"question": "What is the bend of Rhine in Basel called? ", "is_impossible": false}, {"question": "What is the boundary between the High and Upper Rhine? ", "is_impossible": false}, {"question": "How long is the Upper Rhine Plain?", "is_impossible": false}, {"question": "How wide is the Upper Rhine Plain? ", "is_impossible": false}, {"question": "What is the first major city in the course of the Rhine?", "is_impossible": false}, {"question": "What is the first major bend in the Rhine called?", "is_impossible": false}, {"question": "The bend on the Rhine goes from the West to what direction?", "is_impossible": false}, {"question": "What ends at this bend in the Rhine?", "is_impossible": false}, {"question": "What is the legal boundary behind the High and Upper Rind?", "is_impossible": false}, {"question": "What is the bend called where the overall direction of the Rhine changes from East to North?", "is_impossible": true}, {"question": "What is the last major bend in the Rhine called?", "is_impossible": true}, {"question": "What is the last major city in the stream of the Rhine called?", "is_impossible": true}, {"question": "How long is the Central Bridge?", "is_impossible": true}, {"question": "How wide is the Mainz Basin?", "is_impossible": true}]}, {"id": "29_11", "context": "The Upper Rhine region was changed significantly by a Rhine straightening program in the 19th Century. The rate of flow was increased and the ground water level fell significantly. Dead branches dried up and the amount of forests on the flood plains decreased sharply. On the French side, the Grand Canal d'Alsace was dug, which carries a significant part of the river water, and all of the traffic. In some places, there are large compensation pools, for example the huge Bassin de compensation de Plobsheim in Alsace.", "questions": [{"question": "Which century was there a program to straighten the Rhine? ", "is_impossible": false}, {"question": "What happened to the rate of flow in the Rhine during the Rhine straightening program?", "is_impossible": false}, {"question": "What happened to the ground water in the Rhine during the Rhine straightening program?", "is_impossible": false}, {"question": "Which canal was dug in France to carry Rhine's water?", "is_impossible": false}, {"question": "What is the Bassin de compensation de Plobsheim in Alsace? ", "is_impossible": false}, {"question": "What region of the Rhine was changed by the Rhine Straightening program?", "is_impossible": false}, {"question": "When did the Rhine Straightening program begin?", "is_impossible": false}, {"question": "What happened with the rate of flow in the Rhine with the straightening program?", "is_impossible": false}, {"question": "What happened with the ground water level with the Rhine straightening program?", "is_impossible": false}, {"question": "What carries a significant amount of the Rhine flow through France?", "is_impossible": false}, {"question": "In which century was the Grand Canal d'Alsace ended?", "is_impossible": true}, {"question": "What decreased the rate of flow and caused the ground water level to rise?", "is_impossible": true}, {"question": "What caused the Lower Rhine region to be changed significantly?", "is_impossible": true}, {"question": "In what century did all of the dead branches dry up?", "is_impossible": true}, {"question": "In what century did the amount of forests on the flood plain increase?", "is_impossible": true}]}, {"id": "29_12", "context": "The Rhine is the longest river in Germany. It is here that the Rhine encounters some more of its main tributaries, such as the Neckar, the Main and, later, the Moselle, which contributes an average discharge of more than 300 m3/s (11,000 cu ft/s). Northeastern France drains to the Rhine via the Moselle; smaller rivers drain the Vosges and Jura Mountains uplands. Most of Luxembourg and a very small part of Belgium also drain to the Rhine via the Moselle. As it approaches the Dutch border, the Rhine has an annual mean discharge of 2,290 m3/s (81,000 cu ft/s) and an average width of 400 m (1,300 ft).", "questions": [{"question": "What is the longest river in Germany?", "is_impossible": false}, {"question": "Where does the Rhine encounter it's tributary the Neckar? ", "is_impossible": false}, {"question": "What is the average discharge of the Moselle to the Rhine?", "is_impossible": false}, {"question": "What is a main tributary to the Rhine that goes through Northeastern France and part of Belgium?", "is_impossible": false}, {"question": "What is the average width of the Rhine?", "is_impossible": false}, {"question": "The Rhine is the longest river in what country?", "is_impossible": false}, {"question": "Which country does the Rhine encounter it's main tributaries?", "is_impossible": false}, {"question": "Which of the tributaries in Germany contributes most? ", "is_impossible": false}, {"question": "What country does the Moselle take the Rhine to?", "is_impossible": false}, {"question": "How much does the Rhine discharge at the Dutch border?", "is_impossible": false}, {"question": "What is the shortest river in Germany?", "is_impossible": true}, {"question": "What is the average discharge of the Moselle to the Neckar?", "is_impossible": true}, {"question": "How wide are the Jura Mountains?", "is_impossible": true}, {"question": "How much water does the Rhine discharge at the French border?", "is_impossible": true}, {"question": "How wide is the Moselle?", "is_impossible": true}]}, {"id": "29_13", "context": "Between Bingen and Bonn, the Middle Rhine flows through the Rhine Gorge, a formation which was created by erosion. The rate of erosion equaled the uplift in the region, such that the river was left at about its original level while the surrounding lands raised. The gorge is quite deep and is the stretch of the river which is known for its many castles and vineyards. It is a UNESCO World Heritage Site (2002) and known as \"the Romantic Rhine\", with more than 40 castles and fortresses from the Middle Ages and many quaint and lovely country villages.", "questions": [{"question": "What flows between the Bingen and Bonn?", "is_impossible": false}, {"question": "What gorge is between the Bingen and Bonn?", "is_impossible": false}, {"question": "How was the Rhine Gorge formed?", "is_impossible": false}, {"question": "What is the area called near the Rhine Gorge with castles from the middle ages?", "is_impossible": false}, {"question": "What flows between Bingen and Bonn?", "is_impossible": false}, {"question": "Where does the Middle Rhine flow between Bingen and Bonn?", "is_impossible": false}, {"question": "What is the Rhine Gorge known for?", "is_impossible": false}, {"question": "What is the section of the Rhine Gorge recognized by UNESCO called?", "is_impossible": false}, {"question": "In what year was \"the Romantic Rhine\" site built?", "is_impossible": true}, {"question": "How many country villages can be found at the UNESCO World Heritage Site?", "is_impossible": true}, {"question": "What formation was created because the erosion ceased?", "is_impossible": true}, {"question": "How many vineyards are located in the \"the Romantic Rhine\"?", "is_impossible": true}, {"question": "What flows after Bingen and Bonn?", "is_impossible": true}]}, {"id": "29_14", "context": "Until the early 1980s, industry was a major source of water pollution. Although many plants and factories can be found along the Rhine up into Switzerland, it is along the Lower Rhine that the bulk of them are concentrated, as the river passes the major cities of Cologne, Düsseldorf and Duisburg. Duisburg is the home of Europe's largest inland port and functions as a hub to the sea ports of Rotterdam, Antwerp and Amsterdam. The Ruhr, which joins the Rhine in Duisburg, is nowadays a clean river, thanks to a combination of stricter environmental controls, a transition from heavy industry to light industry and cleanup measures, such as the reforestation of Slag and brownfields. The Ruhr currently provides the region with drinking water. It contributes 70 m3/s (2,500 cu ft/s) to the Rhine. Other rivers in the Ruhr Area, above all, the Emscher, still carry a considerable degree of pollution.", "questions": [{"question": "What contributed to water pollution in the Rhine? ", "is_impossible": false}, {"question": "Where are a bulk of factories concentrated along the Rhine?", "is_impossible": false}, {"question": "What is Europe's largest inland port?", "is_impossible": false}, {"question": "What rive joins the Rhine in Duisburg? ", "is_impossible": false}, {"question": "What does the Ruhr provide to it's community?", "is_impossible": false}, {"question": "What did industry do to the Rhine until the 1980s?", "is_impossible": false}, {"question": "Which section of the Rhine is most factories found?", "is_impossible": false}, {"question": "What country has the most factories that pollute the Rhine?", "is_impossible": false}, {"question": "What city has the largest inland port in Europe?", "is_impossible": false}, {"question": "Which river joins the Rhine in Duisburg?", "is_impossible": false}, {"question": "What was a major source of water pollution after the early 1980s?", "is_impossible": true}, {"question": "Where are the least amount of the factories found?", "is_impossible": true}, {"question": "What is Europe's smallest inland port?", "is_impossible": true}, {"question": "What river separates the Rhine from Duisburg?", "is_impossible": true}, {"question": "What river is considered to be not so clean nowadays?", "is_impossible": true}]}, {"id": "29_15", "context": "The dominant economic sectors in the Middle Rhine area are viniculture and tourism. The Rhine Gorge between Rüdesheim am Rhein and Koblenz is listed as a UNESCO World Heritage Site. Near Sankt Goarshausen, the Rhine flows around the famous rock Lorelei. With its outstanding architectural monuments, the slopes full of vines, settlements crowded on the narrow river banks and scores of castles lined up along the top of the steep slopes, the Middle Rhine Valley can be considered the epitome of the Rhine romanticism.", "questions": [{"question": "Besides viniculture, what's a dominant economic sector of the Middle Rhine?", "is_impossible": false}, {"question": "There's a UNESCO World Heritage site in the Rhine Gorge between the Koblenz and what?", "is_impossible": false}, {"question": "What is the famous rock near Sanke Goarshausen?", "is_impossible": false}, {"question": "What is considered the epitome of the Rhine romanticism? ", "is_impossible": false}, {"question": "Besides viniculture, what is the other dominate economic sector in the middle rhine?", "is_impossible": false}, {"question": "What is the Rhine Gorge listed as?", "is_impossible": false}, {"question": "The Rhine Gorge is between Koblenz and what other city?", "is_impossible": false}, {"question": "What is the famous rock called that the Rhine flows around?", "is_impossible": false}, {"question": "Where is the famous rock the Rhine flows around?", "is_impossible": false}, {"question": "What the least dominant economic sectors in the Middle Rhine area?", "is_impossible": true}, {"question": "What is located after Rüdesheim am Rhein and Koblenz?", "is_impossible": true}, {"question": "What was removed from the list of the UNESCO World Heritage Sites?", "is_impossible": true}, {"question": "What is the name of the famous rock that the Rhine flows into?", "is_impossible": true}, {"question": "Where are the most settlements located?", "is_impossible": true}]}, {"id": "29_16", "context": "The Lower Rhine flows through North Rhine-Westphalia. Its banks are usually heavily populated and industrialized, in particular the agglomerations Cologne, Düsseldorf and Ruhr area. Here the Rhine flows through the largest conurbation in Germany, the Rhine-Ruhr region. One of the most important cities in this region is Duisburg with the largest river port in Europe (Duisport). The region downstream of Duisburg is more agricultural. In Wesel, 30 km downstream of Duisburg, is located the western end of the second east-west shipping route, the Wesel-Datteln Canal, which runs parallel to the Lippe. Between Emmerich and Cleves the Emmerich Rhine Bridge, the longest suspension bridge in Germany, crosses the 400 m wide river. Near Krefeld, the river crosses the Uerdingen line, the line which separates the areas where Low German and High German are spoken.", "questions": [{"question": "What city has the biggest port in Germany?", "is_impossible": false}, {"question": "What is the Canal in Wesel? ", "is_impossible": false}, {"question": "What does the Wessel-Datteln canal run parallel to?", "is_impossible": false}, {"question": "What is the largest suspension bridge in Germany?", "is_impossible": false}, {"question": "How wide is the Rhine in Germany between Emmrich and Cleves?", "is_impossible": false}, {"question": "What part of the Rhine flows through North Rhine-Westphalia?", "is_impossible": false}, {"question": "What is the region called that is the largest conurbation of the Rhine?", "is_impossible": false}, {"question": "What is the largest port in Europe called?", "is_impossible": false}, {"question": "What is the name of the longest bridge in Germany?", "is_impossible": false}, {"question": "How wide is the Rhine in Germany?", "is_impossible": false}, {"question": "Where does the Upper Rhine flow through?", "is_impossible": true}, {"question": "What banks are usually sparsely populated and lack industrialization?", "is_impossible": true}, {"question": "What city has one of the smallest ports in Germany?", "is_impossible": true}, {"question": "What is the name of the shortest suspension bridge in Germany?", "is_impossible": true}, {"question": "How wide is the second east-west shipping route?", "is_impossible": true}]}, {"id": "29_17", "context": "From here, the situation becomes more complicated, as the Dutch name Rijn no longer coincides with the main flow of water. Two thirds of the water flow volume of the Rhine flows farther west, through the Waal and then, via the Merwede and Nieuwe Merwede (De Biesbosch), merging with the Meuse, through the Hollands Diep and Haringvliet estuaries, into the North Sea. The Beneden Merwede branches off, near Hardinxveld-Giessendam and continues as the Noord, to join the Lek, near the village of Kinderdijk, to form the Nieuwe Maas; then flows past Rotterdam and continues via Het Scheur and the Nieuwe Waterweg, to the North Sea. The Oude Maas branches off, near Dordrecht, farther down rejoining the Nieuwe Maas to form Het Scheur.", "questions": [{"question": "What is the Dutch name for the Rhine?", "is_impossible": false}, {"question": "What does the water flow of the Rhine merge with after flowing through Merwede?", "is_impossible": false}, {"question": "How much of the water flow does the Waal get from the Rhine?", "is_impossible": false}, {"question": "Which direction does two thirds of the Rhine flow outside of Germany?", "is_impossible": false}, {"question": "Where does two thirds of the Rhine flow outside of Germany?", "is_impossible": false}, {"question": "What does the Rhine merge with outside of Germany?", "is_impossible": false}, {"question": "What's the name of where the Rhine branches off near Dordrecht?", "is_impossible": false}, {"question": "How much of the of the water flow volume of the Rhine flows farther east?", "is_impossible": true}, {"question": "Where do two thirds of the Rhine flow inside of Germany?", "is_impossible": true}, {"question": "What sea does the Rhine flow out of?", "is_impossible": true}, {"question": "What branches off away from Dordrecht?", "is_impossible": true}]}, {"id": "29_18", "context": "The other third of the water flows through the Pannerdens Kanaal and redistributes in the IJssel and Nederrijn. The IJssel branch carries one ninth of the water flow of the Rhine north into the IJsselmeer (a former bay), while the Nederrijn carries approximately two ninths of the flow west along a route parallel to the Waal. However, at Wijk bij Duurstede, the Nederrijn changes its name and becomes the Lek. It flows farther west, to rejoin the Noord River into the Nieuwe Maas and to the North Sea.", "questions": [{"question": "If two thirds of the Rhine flows through the Maas, where doe the other one third flow through?", "is_impossible": false}, {"question": "The Rhine redistributes into the Ijssel and what other body?", "is_impossible": false}, {"question": "What does the Nederrikn's name change into?", "is_impossible": false}, {"question": "Where does the Lek join? ", "is_impossible": false}, {"question": "If two thirds of the Rhine flows through Waal, where does the other third flow through?", "is_impossible": false}, {"question": "Other than the Ijssel, where does the water from the Pannerdens Kanaal redsitrubute?", "is_impossible": false}, {"question": "How much of the Rhine flow does Ijssel carry?", "is_impossible": false}, {"question": "What does the Nederrijn change it's name to?", "is_impossible": false}, {"question": "Where does the Nederrijn change it's name?", "is_impossible": false}, {"question": "How much water flows out of the Pannerdens Kanaal?", "is_impossible": true}, {"question": "Where does the IJssel and Nederrijn redistribute into?", "is_impossible": true}, {"question": "Where does the Lek separate?", "is_impossible": true}, {"question": "How much of the Noord River flows into the North Sea?", "is_impossible": true}, {"question": "What does the Lek change its name to?", "is_impossible": true}]}, {"id": "29_19", "context": "The name Rijn, from here on, is used only for smaller streams farther to the north, which together formed the main river Rhine in Roman times. Though they retained the name, these streams no longer carry water from the Rhine, but are used for draining the surrounding land and polders. From Wijk bij Duurstede, the old north branch of the Rhine is called Kromme Rijn (\"Bent Rhine\") past Utrecht, first Leidse Rijn (\"Rhine of Leiden\") and then, Oude Rijn (\"Old Rhine\"). The latter flows west into a sluice at Katwijk, where its waters can be discharged into the North Sea. This branch once formed the line along which the Limes Germanicus were built. During periods of lower sea levels within the various ice ages, the Rhine took a left turn, creating the Channel River, the course of which now lies below the English Channel.", "questions": [{"question": "What is the name for the smaller streams along the region northern Germany?", "is_impossible": false}, {"question": "The smaller streams are used for what?", "is_impossible": false}, {"question": "What is the name of the old north branch of the Rhine?", "is_impossible": false}, {"question": "What is the translation of the old north branch of rhe Rhine?", "is_impossible": false}, {"question": "What part of the Rhine flows west at Katwijk?", "is_impossible": false}, {"question": "What name is used only for larger streams farther to the north?", "is_impossible": true}, {"question": "What streams continue to carry water from the Rhine?", "is_impossible": true}, {"question": "What is the the old south branch of the Rhine called?", "is_impossible": true}, {"question": "When the Rhine took a right turn what did it create?", "is_impossible": true}, {"question": "During what ages were the Limes Germanicus built?", "is_impossible": true}]}, {"id": "29_20", "context": "The Rhine-Meuse Delta, the most important natural region of the Netherlands begins near Millingen aan de Rijn, close to the Dutch-German border with the division of the Rhine into Waal and Nederrijn. Since the Rhine contributes most of the water, the shorter term Rhine Delta is commonly used. However, this name is also used for the river delta where the Rhine flows into Lake Constance, so it is clearer to call the larger one Rhine-Meuse delta, or even Rhine–Meuse–Scheldt delta, as the Scheldt ends in the same delta.", "questions": [{"question": "What is the name of the Delta in the Netherlands? ", "is_impossible": false}, {"question": "Where does the Delta in the Netherlands begin?", "is_impossible": false}, {"question": "What is the nickname for the Delta in the Netherlands?", "is_impossible": false}, {"question": "What is the least important natural region of the Netherlands?", "is_impossible": true}, {"question": "What ends near the Millingen aan de Rijn?", "is_impossible": true}, {"question": "What contributes the least amount of water to the area?", "is_impossible": true}, {"question": "What is another name for Lake Constance?", "is_impossible": true}, {"question": "What ends in the same delta?", "is_impossible": true}]}, {"id": "29_21", "context": "The shape of the Rhine delta is determined by two bifurcations: first, at Millingen aan de Rijn, the Rhine splits into Waal and Pannerdens Kanaal, which changes its name to Nederrijn at Angeren, and second near Arnhem, the IJssel branches off from the Nederrijn. This creates three main flows, two of which change names rather often. The largest and southern main branch begins as Waal and continues as Boven Merwede (\"Upper Merwede\"), Beneden Merwede (\"Lower Merwede\"), Noord River (\"North River\"), Nieuwe Maas (\"New Meuse\"), Het Scheur (\"the Rip\") and Nieuwe Waterweg (\"New Waterway\"). The middle flow begins as Nederrijn, then changes into Lek, then joins the Noord, thereby forming Nieuwe Maas. The northern flow keeps the name IJssel until it flows into Lake IJsselmeer. Three more flows carry significant amounts of water: the Nieuwe Merwede (\"New Merwede\"), which branches off from the southern branch where it changes from Boven to Beneden Merwede; the Oude Maas (\"Old Meuse\"), which branches off from the southern branch where it changes from Beneden Merwede into Noord, and Dordtse Kil, which branches off from Oude Maas.", "questions": [{"question": "At Millingen aan de Rijn where the Rhine splits, what does it change it's name to?", "is_impossible": false}, {"question": "How many main flows are branched off from the Nederrijn?", "is_impossible": false}, {"question": "What is the largest main branch of the Rhine?", "is_impossible": false}, {"question": "What is the English translation of Het Scheur?", "is_impossible": false}, {"question": "What is the translation of Oude Maas?", "is_impossible": false}, {"question": "The southern flow retains the name IJssel until it flows into what?", "is_impossible": true}, {"question": "The Beneden Merwede branches off from the northern branch into what?", "is_impossible": true}, {"question": "What does the smallest and northern main branch begins as?", "is_impossible": true}, {"question": "How many more flows carry insignificant amounts of water?", "is_impossible": true}]}, {"id": "29_22", "context": "Before the St. Elizabeth's flood (1421), the Meuse flowed just south of today's line Merwede-Oude Maas to the North Sea and formed an archipelago-like estuary with Waal and Lek. This system of numerous bays, estuary-like extended rivers, many islands and constant changes of the coastline, is hard to imagine today. From 1421 to 1904, the Meuse and Waal merged further upstream at Gorinchem to form Merwede. For flood protection reasons, the Meuse was separated from the Waal through a lock and diverted into a new outlet called \"Bergse Maas\", then Amer and then flows into the former bay Hollands Diep.", "questions": [{"question": "What flood impacted the Meuse?", "is_impossible": false}, {"question": "What year did the flood that impacted the Meuse take place?", "is_impossible": false}, {"question": "Where did the Meuse flow before the flood? ", "is_impossible": false}, {"question": "What did the Merwede-Oude Maas form with Waal and Lek?", "is_impossible": false}, {"question": "When did the Meuse and Waal merge?", "is_impossible": false}, {"question": "When did the Meuse and Waal diverge further upstream at Gorinchem?", "is_impossible": true}, {"question": "What year was St. Elizabeth born?", "is_impossible": true}, {"question": "What year was it when St. Elizabeth flooded part of the North Sea?", "is_impossible": true}, {"question": "What flows out of the former bay Hollands Diep?", "is_impossible": true}, {"question": "From what years did St. Elizabeth live in the Hollands Diep bay?", "is_impossible": true}]}, {"id": "29_23", "context": "The hydrography of the current delta is characterized by the delta's main arms, disconnected arms (Hollandse IJssel, Linge, Vecht, etc.) and smaller rivers and streams. Many rivers have been closed (\"dammed\") and now serve as drainage channels for the numerous polders. The construction of Delta Works changed the Delta in the second half of the 20th Century fundamentally. Currently Rhine water runs into the sea, or into former marine bays now separated from the sea, in five places, namely at the mouths of the Nieuwe Merwede, Nieuwe Waterway (Nieuwe Maas), Dordtse Kil, Spui and IJssel.", "questions": [{"question": "What is the term for closing off rivers that are no longer connected?", "is_impossible": false}, {"question": "What do closed rivers serve as after they close?", "is_impossible": false}, {"question": "What changed the Rhine's Delta?", "is_impossible": false}, {"question": "When was the construction that changed the Rhine's Delta?", "is_impossible": false}, {"question": "What is one aspect of the hydrography of the former delta characterized by?", "is_impossible": true}, {"question": "What changed the Delta in the first half of the 20th Century?", "is_impossible": true}, {"question": "In what century did the marine bays join the sea?", "is_impossible": true}, {"question": "What water runs out of the sea and out of the former marine bay?", "is_impossible": true}]}, {"id": "29_24", "context": "The Rhine-Meuse Delta is a tidal delta, shaped not only by the sedimentation of the rivers, but also by tidal currents. This meant that high tide formed a serious risk because strong tidal currents could tear huge areas of land into the sea. Before the construction of the Delta Works, tidal influence was palpable up to Nijmegen, and even today, after the regulatory action of the Delta Works, the tide acts far inland. At the Waal, for example, the most landward tidal influence can be detected between Brakel and Zaltbommel.", "questions": [{"question": "What type of Delta is the Rhine-Meuse?", "is_impossible": false}, {"question": "Besides rivers, what shapes the sedimentation of the rivers?", "is_impossible": false}, {"question": "What does a high tide risk near lands? ", "is_impossible": false}, {"question": "Between Brakel and what other city can the most landward tidal influence be detected?", "is_impossible": false}, {"question": "What was not shaped by sedimentation of the rivers and tidal currents?", "is_impossible": true}, {"question": "What area was the Delta Works constructed between?", "is_impossible": true}, {"question": "What can weak tidal currents do?", "is_impossible": true}, {"question": "What produces a lot of sedimentation that flows into the surrounding rivers?", "is_impossible": true}]}, {"id": "29_25", "context": "In southern Europe, the stage was set in the Triassic Period of the Mesozoic Era, with the opening of the Tethys Ocean, between the Eurasian and African tectonic plates, between about 240 MBP and 220 MBP (million years before present). The present Mediterranean Sea descends from this somewhat larger Tethys sea. At about 180 MBP, in the Jurassic Period, the two plates reversed direction and began to compress the Tethys floor, causing it to be subducted under Eurasia and pushing up the edge of the latter plate in the Alpine Orogeny of the Oligocene and Miocene Periods. Several microplates were caught in the squeeze and rotated or were pushed laterally, generating the individual features of Mediterranean geography: Iberia pushed up the Pyrenees; Italy, the Alps, and Anatolia, moving west, the mountains of Greece and the islands. The compression and orogeny continue today, as shown by the ongoing raising of the mountains a small amount each year and the active volcanoes.", "questions": [{"question": "The present Mediterranean Sea descends from what sea?", "is_impossible": false}, {"question": "What period opened the Tethys Ocean?", "is_impossible": false}, {"question": "What period did plates reverse directions to compress the Tethys floor?", "is_impossible": false}, {"question": "Microplates squeezing and rotating created the features of what?", "is_impossible": false}, {"question": "What pushed up the Pyrenees?", "is_impossible": false}, {"question": "What period closed up the Tethys Ocean?", "is_impossible": true}, {"question": "During what period was southern Europe discovered?", "is_impossible": true}, {"question": "When did the Jurassic Period end?", "is_impossible": true}, {"question": "During what period was the Tethys floor discovered?", "is_impossible": true}, {"question": "Between which years did the Mediterranean Sea flow into the Tethys sea?", "is_impossible": true}]}, {"id": "29_26", "context": "From the Eocene onwards, the ongoing Alpine orogeny caused a N–S rift system to develop in this zone. The main elements of this rift are the Upper Rhine Graben, in southwest Germany and eastern France and the Lower Rhine Embayment, in northwest Germany and the southeastern Netherlands. By the time of the Miocene, a river system had developed in the Upper Rhine Graben, that continued northward and is considered the first Rhine river. At that time, it did not yet carry discharge from the Alps; instead, the watersheds of the Rhone and Danube drained the northern flanks of the Alps.", "questions": [{"question": "What rift system developed in the Alpine orogeny?", "is_impossible": false}, {"question": "What elements from the rift system in the Alpine orogeny in Southwest Germany?", "is_impossible": false}, {"question": "What time did a river system develop in the Upper Rhine Graben?", "is_impossible": false}, {"question": "The Rhine and what other river drained the northern flanks of the alps?", "is_impossible": false}, {"question": "What drained the southern flanks of the Alps?", "is_impossible": true}, {"question": "What continued southward and is also considered the first Rhine river?", "is_impossible": true}, {"question": "What did the ongoing Alpine orogeny cause before the Eocene?", "is_impossible": true}, {"question": "During what period did the Alpine orogeny end?", "is_impossible": true}]}, {"id": "29_27", "context": "Through stream capture, the Rhine extended its watershed southward. By the Pliocene period, the Rhine had captured streams down to the Vosges Mountains, including the Mosel, the Main and the Neckar. The northern Alps were then drained by the Rhone. By the early Pleistocene period, the Rhine had captured most of its current Alpine watershed from the Rhône, including the Aar. Since that time, the Rhine has added the watershed above Lake Constance (Vorderrhein, Hinterrhein, Alpenrhein; captured from the Rhône), the upper reaches of the Main, beyond Schweinfurt and the Vosges Mountains, captured from the Meuse, to its watershed.", "questions": [{"question": "How did the Rhine extend watershed southward? ", "is_impossible": false}, {"question": "What period did the Rhine capture streams?", "is_impossible": false}, {"question": "Where are the streams the Rhine captured?", "is_impossible": false}, {"question": "What caused the Rhine to extend its watershed northward?", "is_impossible": true}, {"question": "When were the Vosges Mountains captured by the Rhine?", "is_impossible": true}, {"question": "What were the northern Alps flooded by?", "is_impossible": true}, {"question": "What captured the Vosges Mountains?", "is_impossible": true}, {"question": "What mountain range contains Lake Constance?", "is_impossible": true}]}, {"id": "29_28", "context": "Around 2.5 million years ago (ending 11,600 years ago) was the geological period of the Ice Ages. Since approximately 600,000 years ago, six major Ice Ages have occurred, in which sea level dropped 120 m (390 ft) and much of the continental margins became exposed. In the Early Pleistocene, the Rhine followed a course to the northwest, through the present North Sea. During the so-called Anglian glaciation (~450,000 yr BP, marine oxygen isotope stage 12), the northern part of the present North Sea was blocked by the ice and a large lake developed, that overflowed through the English Channel. This caused the Rhine's course to be diverted through the English Channel. Since then, during glacial times, the river mouth was located offshore of Brest, France and rivers, like the Thames and the Seine, became tributaries to the Rhine. During interglacials, when sea level rose to approximately the present level, the Rhine built deltas, in what is now the Netherlands.", "questions": [{"question": "What period was 2.5 million years ago?", "is_impossible": false}, {"question": "How many major ice ages have occurred? ", "is_impossible": false}, {"question": "How far did the sea level drop in the ice ages?", "is_impossible": false}, {"question": "In early Pleistocene, what direction did the Rhine flow?", "is_impossible": false}, {"question": "During glacial times, where was the mouth of the Rhine located?", "is_impossible": false}, {"question": "How long did the Ice Ages last?", "is_impossible": true}, {"question": "How high did the sea level rise during the ice ages?", "is_impossible": true}, {"question": "When did the Rhine travel southwest into the North Sea?", "is_impossible": true}, {"question": "What country is the English Channel located in?", "is_impossible": true}]}, {"id": "29_29", "context": "The last glacial ran from ~74,000 (BP = Before Present), until the end of the Pleistocene (~11,600 BP). In northwest Europe, it saw two very cold phases, peaking around 70,000 BP and around 29,000–24,000 BP. The last phase slightly predates the global last ice age maximum (Last Glacial Maximum). During this time, the lower Rhine flowed roughly west through the Netherlands and extended to the southwest, through the English Channel and finally, to the Atlantic Ocean. The English Channel, the Irish Channel and most of the North Sea were dry land, mainly because sea level was approximately 120 m (390 ft) lower than today.", "questions": [{"question": "When did the last glacial start?", "is_impossible": false}, {"question": "When did the last glacial end?", "is_impossible": false}, {"question": "Which direction did the Rhine flow during the last cold phase?", "is_impossible": false}, {"question": "How much lower was the North Sea in the last cold phase than it is today?", "is_impossible": false}, {"question": "Besides the North Sea and the Irish Channel, what else was lowered in the last cold phase?", "is_impossible": false}, {"question": "When did the the Pleistocene begin?", "is_impossible": true}, {"question": "When did the Last Glacial Maximum peak?", "is_impossible": true}, {"question": "What does the Atlantic Ocean flow into?", "is_impossible": true}, {"question": "What is the sea level of the Irish Channel?", "is_impossible": true}, {"question": "What is the sea level of the English Channel?", "is_impossible": true}]}, {"id": "29_30", "context": "Most of the Rhine's current course was not under the ice during the last Ice Age; although, its source must still have been a glacier. A tundra, with Ice Age flora and fauna, stretched across middle Europe, from Asia to the Atlantic Ocean. Such was the case during the Last Glacial Maximum, ca. 22,000–14,000 yr BP, when ice-sheets covered Scandinavia, the Baltics, Scotland and the Alps, but left the space between as open tundra. The loess or wind-blown dust over that tundra, settled in and around the Rhine Valley, contributing to its current agricultural usefulness.", "questions": [{"question": "What was the source of the Rhine in the last Ice Age?", "is_impossible": false}, {"question": "What stretched across middle Europe in the last ice age?", "is_impossible": false}, {"question": "When was the Last Glacial Maximum?", "is_impossible": false}, {"question": "What covered Scandinavia, the Baltics, Scotland, and the Alps in the last Ice Age?", "is_impossible": false}, {"question": "What is the term for wind-blown dust in a tundra?", "is_impossible": false}, {"question": "What was the source of the Rhine during the current last Ice Age?", "is_impossible": true}, {"question": "What flowed through the tundra?", "is_impossible": true}, {"question": "When did ice-sheets cover Asia?", "is_impossible": true}, {"question": "When were the Alps formed?", "is_impossible": true}]}, {"id": "29_31", "context": "As northwest Europe slowly began to warm up from 22,000 years ago onward, frozen subsoil and expanded alpine glaciers began to thaw and fall-winter snow covers melted in spring. Much of the discharge was routed to the Rhine and its downstream extension. Rapid warming and changes of vegetation, to open forest, began about 13,000 BP. By 9000 BP, Europe was fully forested. With globally shrinking ice-cover, ocean water levels rose and the English Channel and North Sea re-inundated. Meltwater, adding to the ocean and land subsidence, drowned the former coasts of Europe transgressionally.", "questions": [{"question": "When did Europe slowly begin to warm up from the last Ice Age?", "is_impossible": false}, {"question": "What did frozen subsoil and expanded alpine glaciers begin to do?", "is_impossible": false}, {"question": "Where did the discharge from glaciers go in Europe in the last Ice Age?", "is_impossible": false}, {"question": "When did rapid warming begin and help vegetation?", "is_impossible": false}, {"question": "When was Europe fully forested and recovered from the last Ice Age?", "is_impossible": false}, {"question": "How many years did it take for the frozen subsoil to warm up?", "is_impossible": true}, {"question": "How many years did it take for the Spring snow covers to melt?", "is_impossible": true}, {"question": "What did the Rhine help to expand?", "is_impossible": true}, {"question": "What exposed the former coasts of Europe?", "is_impossible": true}]}, {"id": "29_32", "context": "Since 7500 yr ago, a situation with tides and currents, very similar to present has existed. Rates of sea-level rise had dropped so far, that natural sedimentation by the Rhine and coastal processes together, could compensate the transgression by the sea; in the last 7000 years, the coast line was roughly at the same location. In the southern North Sea, due to ongoing tectonic subsidence, the sea level is still rising, at the rate of about 1–3 cm (0.39–1.18 in) per century (1 metre or 39 inches in last 3000 years).", "questions": [{"question": "When did tides and currents similar to our current system begin?", "is_impossible": false}, {"question": "Why did natural sedimentation by the Rhine compensate the transgression bby the sea?", "is_impossible": false}, {"question": "How long has the Rhine coastline been in the same location?", "is_impossible": false}, {"question": "Why is the current sea level rising?", "is_impossible": false}, {"question": "How quickly is the sea level rising?", "is_impossible": false}, {"question": "When did tides and currents reach the highest sea-level rise?", "is_impossible": true}, {"question": "How quickly is the sea level dropping?", "is_impossible": true}, {"question": "How long has the ongoing tectonic subsidence in the southern North Sea been happening for?", "is_impossible": true}, {"question": "How high is the natural sedimentation by the Rhine?", "is_impossible": true}, {"question": "How old is the North Sea?", "is_impossible": true}]}, {"id": "29_33", "context": "At the begin of the Holocene (~11,700 years ago), the Rhine occupied its Late-Glacial valley. As a meandering river, it reworked its ice-age braidplain. As sea-level continued to rise in the Netherlands, the formation of the Holocene Rhine-Meuse delta began (~8,000 years ago). Coeval absolute sea-level rise and tectonic subsidence have strongly influenced delta evolution. Other factors of importance to the shape of the delta are the local tectonic activities of the Peel Boundary Fault, the substrate and geomorphology, as inherited from the Last Glacial and the coastal-marine dynamics, such as barrier and tidal inlet formations.", "questions": [{"question": "When was the Holocene?", "is_impossible": false}, {"question": "Where did the Rhine occupy during the Holocene?", "is_impossible": false}, {"question": "What country did the Rhine continue to rise during the holocene?", "is_impossible": false}, {"question": "When did the formation of the Holocene Rhine-Meuse delta begin?", "is_impossible": false}, {"question": "When did the Holocene end?", "is_impossible": true}, {"question": "When did the Holocene Rhine-Meuse delta stop forming?", "is_impossible": true}, {"question": "When was the Peel Boundary Fault discovered?", "is_impossible": true}, {"question": "When did the Netherlands begin to occupy the Late-Glacial valley?", "is_impossible": true}]}, {"id": "29_34", "context": "Since ~3000 yr BP (= years Before Present), human impact is seen in the delta. As a result of increasing land clearance (Bronze Age agriculture), in the upland areas (central Germany), the sediment load of the Rhine has strongly increased and delta growth has sped up. This caused increased flooding and sedimentation, ending peat formation in the delta. The shifting of river channels to new locations, on the floodplain (termed avulsion), was the main process distributing sediment across the subrecent delta. Over the past 6000 years, approximately 80 avulsions have occurred. Direct human impact in the delta started with peat mining, for salt and fuel, from Roman times onward. This was followed by embankment, of the major distributaries and damming of minor distributaries, which took place in the 11–13th century AD. Thereafter, canals were dug, bends were short cut and groynes were built, to prevent the river's channels from migrating or silting up.", "questions": [{"question": "When have humans started impacting the delta?", "is_impossible": false}, {"question": "What increased in the Rhine because of the land clearance in the upland areas?", "is_impossible": false}, {"question": "What has increased sediment and delta growth also produced in the Rhine?", "is_impossible": false}, {"question": "How many avulsions have occurred in the past 6000 yeas?", "is_impossible": false}, {"question": "When did embankment of the major Rhine distributaries take palce?", "is_impossible": false}, {"question": "How long have humans been impacting the delta for?", "is_impossible": true}, {"question": "How many years has Bronze Age agriculture gone on for?", "is_impossible": true}, {"question": "How many upland areas are in central Germany?", "is_impossible": true}, {"question": "How long did peat mining from the Roman times last for?", "is_impossible": true}, {"question": "What centuries did the Roman times take place within?", "is_impossible": true}]}, {"id": "29_35", "context": "At present, the branches Waal and Nederrijn-Lek discharge to the North Sea, through the former Meuse estuary, near Rotterdam. The river IJssel branch flows to the north and enters the IJsselmeer, formerly the Zuider Zee brackish lagoon; however, since 1932, a freshwater lake. The discharge of the Rhine is divided among three branches: the River Waal (6/9 of total discharge), the River Nederrijn – Lek (2/9 of total discharge) and the River IJssel (1/9 of total discharge). This discharge distribution has been maintained since 1709, by river engineering works, including the digging of the Pannerdens canal and since the 20th century, with the help of weirs in the Nederrijn river.", "questions": [{"question": "Where do the branches Waal and Nederrijn-Lek discharge to?", "is_impossible": false}, {"question": "What do the Waal and the Nederrijn-Lek discharge throguh?", "is_impossible": false}, {"question": "Where does the Ijssel branch flow?", "is_impossible": false}, {"question": "What did the Zuider Zee brackish lagoon change into?", "is_impossible": false}, {"question": "How many branches does the Rhine branch into?", "is_impossible": false}, {"question": "Where does the North Sea discharge into?", "is_impossible": true}, {"question": "When was the Zuider Zee brackish lagoon discovered?", "is_impossible": true}, {"question": "What year did they stop digging the Pannerdens canal?", "is_impossible": true}, {"question": "How many branches does the Zuider Zee brackish lagoon have?", "is_impossible": true}, {"question": "In what century did the North Sea discharge into the Nederrijn river?", "is_impossible": true}]}, {"id": "29_36", "context": "The Rhine was not known to Herodotus and first enters the historical period in the 1st century BC in Roman-era geography. At that time, it formed the boundary between Gaul and Germania. The Upper Rhine had been part of the areal of the late Hallstatt culture since the 6th century BC, and by the 1st century BC, the areal of the La Tène culture covered almost its entire length, forming a contact zone with the Jastorf culture, i.e. the locus of early Celtic-Germanic cultural contact. In Roman geography, the Rhine formed the boundary between Gallia and Germania by definition; e.g. Maurus Servius Honoratus, Commentary on the Aeneid of Vergil (8.727) (Rhenus) fluvius Galliae, qui Germanos a Gallia dividit \"(The Rhine is a) river of Gaul, which divides the Germanic people from Gaul.\"", "questions": [{"question": "When was the Rhine first discovered?", "is_impossible": false}, {"question": "The Rhine first formed a boundary between Gaul and what else?", "is_impossible": false}, {"question": "Since when was the Rhine part of the areal of Hallstatt culture?", "is_impossible": false}, {"question": "Who first wrote about the Rhine's discovery and border?", "is_impossible": false}, {"question": "When did Herodotus discover the Rhine?", "is_impossible": true}, {"question": "Herodotus traveled between what boundary?", "is_impossible": true}, {"question": "What century was the Hallstatt culture discovered?", "is_impossible": true}, {"question": "What century did Maurus Servius Honoratus give his Commentary on the Aeneid of Vergil to Herodotus?", "is_impossible": true}]}, {"id": "29_37", "context": "From the death of Augustus in AD 14 until after AD 70, Rome accepted as her Germanic frontier the water-boundary of the Rhine and upper Danube. Beyond these rivers she held only the fertile plain of Frankfurt, opposite the Roman border fortress of Moguntiacum (Mainz), the southernmost slopes of the Black Forest and a few scattered bridge-heads. The northern section of this frontier, where the Rhine is deep and broad, remained the Roman boundary until the empire fell. The southern part was different. The upper Rhine and upper Danube are easily crossed. The frontier which they form is inconveniently long, enclosing an acute-angled wedge of foreign territory between the modern Baden and Württemberg. The Germanic populations of these lands seem in Roman times to have been scanty, and Roman subjects from the modern Alsace-Lorraine had drifted across the river eastwards.", "questions": [{"question": "When did Augustus die?", "is_impossible": false}, {"question": "The Rhine and what other river were accepted as the Germanic frontier?", "is_impossible": false}, {"question": "When did the Rhine stop being the Roman boundary?", "is_impossible": false}, {"question": "Where are the upper Rhine and upper Danube crossed?", "is_impossible": false}, {"question": "Which direction did Romans use to drift through the Rhine?", "is_impossible": false}, {"question": "When did Augustus find Rome?", "is_impossible": true}, {"question": "What did the people of Rome accept as the only fertile plain?", "is_impossible": true}, {"question": "When was the Black Forest discovered?", "is_impossible": true}, {"question": "When did the Roman empire fall?", "is_impossible": true}, {"question": "What populations occupied the foreign territory between the modern Baden and Württemberg?", "is_impossible": true}]}, {"id": "29_38", "context": "The Romans kept eight legions in five bases along the Rhine. The actual number of legions present at any base or in all, depended on whether a state or threat of war existed. Between about AD 14 and 180, the assignment of legions was as follows: for the army of Germania Inferior, two legions at Vetera (Xanten), I Germanica and XX Valeria (Pannonian troops); two legions at oppidum Ubiorum (\"town of the Ubii\"), which was renamed to Colonia Agrippina, descending to Cologne, V Alaudae, a Celtic legion recruited from Gallia Narbonensis and XXI, possibly a Galatian legion from the other side of the empire.", "questions": [{"question": "How many legions in five bases were along the Rhine by the Romans?", "is_impossible": false}, {"question": "What did the number of legions in Roman times depend on?", "is_impossible": false}, {"question": "Vetra and I Germanica and XX Valeria were the two legions for what?", "is_impossible": false}, {"question": "What was the Colonia Agrippina's original name?", "is_impossible": false}, {"question": "What does Colonia Agrippina's original name translate into?", "is_impossible": false}, {"question": "How many wars did the Romans have along the Rhine?", "is_impossible": true}, {"question": "When was the first Roman war?", "is_impossible": true}, {"question": "How many legions for the Germania Inferior existed?", "is_impossible": true}, {"question": "What legion did the Romans enter from the other side of the empire?", "is_impossible": true}, {"question": "Who were the Pannonian troops allies with?", "is_impossible": true}]}, {"id": "29_39", "context": "Germanic tribes crossed the Rhine in the Migration period, by the 5th century establishing the kingdoms of Francia on the Lower Rhine, Burgundy on the Upper Rhine and Alemannia on the High Rhine. This \"Germanic Heroic Age\" is reflected in medieval legend, such as the Nibelungenlied which tells of the hero Siegfried killing a dragon on the Drachenfels (Siebengebirge) (\"dragons rock\"), near Bonn at the Rhine and of the Burgundians and their court at Worms, at the Rhine and Kriemhild's golden treasure, which was thrown into the Rhine by Hagen.", "questions": [{"question": "When did Germanic tribes cross the Rhine to migrate?", "is_impossible": false}, {"question": "What did Germanic tribes establish with help from the Rhine?", "is_impossible": false}, {"question": "What is the translation of Siebengebirge?", "is_impossible": false}, {"question": "Who is the hero who killed a dragon on the Drachenfels?", "is_impossible": false}, {"question": "Who threw gold into the Rhine, according to legend?", "is_impossible": false}, {"question": "When did the \"Germanic Heroic Age\" end?", "is_impossible": true}, {"question": "What did Hagen find after he was thrown into the river?", "is_impossible": true}, {"question": "What kind of rock did the hero Siegfried discover?", "is_impossible": true}, {"question": "Where did the hero Siegfried discover the rock?", "is_impossible": true}, {"question": "Who threw Hagen into the river?", "is_impossible": true}]}, {"id": "29_40", "context": "By the 6th century, the Rhine was within the borders of Francia. In the 9th, it formed part of the border between Middle and Western Francia, but in the 10th century, it was fully within the Holy Roman Empire, flowing through Swabia, Franconia and Lower Lorraine. The mouths of the Rhine, in the county of Holland, fell to the Burgundian Netherlands in the 15th century; Holland remained contentious territory throughout the European wars of religion and the eventual collapse of the Holy Roman Empire, when the length of the Rhine fell to the First French Empire and its client states. The Alsace on the left banks of the Upper Rhine was sold to Burgundy by Archduke Sigismund of Austria in 1469 and eventually fell to France in the Thirty Years' War. The numerous historic castles in Rhineland-Palatinate attest to the importance of the river as a commercial route.", "questions": [{"question": "When did the Rhine become borders with Francia?", "is_impossible": false}, {"question": "When was the Rhine fully within the Holy Roman Empire?", "is_impossible": false}, {"question": "The Rhine flowed through Swabia, Franconia and what other location in the 10th Century?", "is_impossible": false}, {"question": "Who sold the Upper Rhine to Burgundy?", "is_impossible": false}, {"question": "When was the Upper Rhine sold to Burgundy?", "is_impossible": false}, {"question": "When did Francia discover that the Rhine entered had entered their borders?", "is_impossible": true}, {"question": "When was Middle and Western Francia formed?", "is_impossible": true}, {"question": "When was the Holland empire formed?", "is_impossible": true}, {"question": "When did the Archduke Sigismund of Austria die?", "is_impossible": true}, {"question": "What was the name of the war that the Archduke Sigismund of Austria started?", "is_impossible": true}]}, {"id": "29_41", "context": "Since the Peace of Westphalia, the Upper Rhine formed a contentious border between France and Germany. Establishing \"natural borders\" on the Rhine was a long-term goal of French foreign policy, since the Middle Ages, though the language border was – and is – far more to the west. French leaders, such as Louis XIV and Napoleon Bonaparte, tried with varying degrees of success to annex lands west of the Rhine. The Confederation of the Rhine was established by Napoleon, as a French client state, in 1806 and lasted until 1814, during which time it served as a significant source of resources and military manpower for the First French Empire. In 1840, the Rhine crisis, prompted by French prime minister Adolphe Thiers's desire to reinstate the Rhine as a natural border, led to a diplomatic crisis and a wave of nationalism in Germany.", "questions": [{"question": "What was the name of the time the Upper Rhine form a border between France and Germany?", "is_impossible": false}, {"question": "What was a long term goal of French foreign policy along the Rhine?", "is_impossible": false}, {"question": "Who established the Confederation of the Rhine?", "is_impossible": false}, {"question": "When was the confederation of the Rhine?", "is_impossible": false}, {"question": "When was the Rhine crisis?", "is_impossible": false}, {"question": "What was the name of the peaceful era between France and Germany?", "is_impossible": true}, {"question": "What borders did the French complete during the Middle Ages?", "is_impossible": true}, {"question": "When was the Peace of Westphalia established?", "is_impossible": true}, {"question": "When did the Peace of Westphalia last until?", "is_impossible": true}, {"question": "When did Napoleon die?", "is_impossible": true}]}, {"id": "29_42", "context": "At the end of World War I, the Rhineland was subject to the Treaty of Versailles. This decreed that it would be occupied by the allies, until 1935 and after that, it would be a demilitarised zone, with the German army forbidden to enter. The Treaty of Versailles and this particular provision, in general, caused much resentment in Germany and is often cited as helping Adolf Hitler's rise to power. The allies left the Rhineland, in 1930 and the German army re-occupied it in 1936, which was enormously popular in Germany. Although the allies could probably have prevented the re-occupation, Britain and France were not inclined to do so, a feature of their policy of appeasement to Hitler.", "questions": [{"question": "When was Rhineland subject to the Treaty of Versailles?", "is_impossible": false}, {"question": "When would the occupation of allies leave Rhineland?", "is_impossible": false}, {"question": "After 1935, who would be forbidden to enter Rhineland?", "is_impossible": false}, {"question": "What do some believe the Treaty of Versailles assisted in?", "is_impossible": false}, {"question": "When did the German army reoccupy Rhineland?", "is_impossible": false}, {"question": "When was the Treaty of Versailles written?", "is_impossible": true}, {"question": "When did the Germany army enter Rhineland?", "is_impossible": true}, {"question": "What year did Adolf Hitler's rise to power?", "is_impossible": true}, {"question": "When did the the German army re-occupy Britain and France?", "is_impossible": true}]}, {"id": "29_43", "context": "In World War II, it was recognised that the Rhine would present a formidable natural obstacle to the invasion of Germany, by the Western Allies. The Rhine bridge at Arnhem, immortalized in the book, A Bridge Too Far and the film, was a central focus of the battle for Arnhem, during the failed Operation Market Garden of September 1944. The bridges at Nijmegen, over the Waal distributary of the Rhine, were also an objective of Operation Market Garden. In a separate operation, the Ludendorff Bridge, crossing the Rhine at Remagen, became famous, when U.S. forces were able to capture it intact – much to their own surprise – after the Germans failed to demolish it. This also became the subject of a film, The Bridge at Remagen. Seven Days to the River Rhine was a Warsaw Pact war plan for an invasion of Western Europe during the Cold War.", "questions": [{"question": "Where is the Rhine Bridge?", "is_impossible": false}, {"question": "What was the Rhine considered to invaders in WWII?", "is_impossible": false}, {"question": "When was Operation Market Garden?", "is_impossible": false}, {"question": "What bridge did the Germans fail to demolish?", "is_impossible": false}, {"question": "What was the Warsaw Pact war plan?", "is_impossible": false}, {"question": "During what war did the Western Allies cross the Rhine bridge at Arnhem?", "is_impossible": true}, {"question": "When did the Operation Market Garden of September end?", "is_impossible": true}, {"question": "When did the Cold War begin?", "is_impossible": true}, {"question": "How long did the Cold War last?", "is_impossible": true}, {"question": "How many days did the U.S. forces participate in the Cold War?", "is_impossible": true}]}, {"id": "29_44", "context": "Until 1932 the generally accepted length of the Rhine was 1,230 kilometres (764 miles). In 1932 the German encyclopedia Knaurs Lexikon stated the length as 1,320 kilometres (820 miles), presumably a typographical error. After this number was placed into the authoritative Brockhaus Enzyklopädie, it became generally accepted and found its way into numerous textbooks and official publications. The error was discovered in 2010, and the Dutch Rijkswaterstaat confirms the length at 1,232 kilometres (766 miles).[note 1]", "questions": [{"question": "What was the accepted length of the Rhine prior to 1932?", "is_impossible": false}, {"question": "Who stated a change of the length of the Rhine?", "is_impossible": false}, {"question": "in 1932 what was the Rhine measurement changed to?", "is_impossible": false}, {"question": "Why was the Rhine measurement changed? ", "is_impossible": false}, {"question": "When was the Rhine measurement corrected back to the original?", "is_impossible": false}, {"question": "What year was the German encyclopedia Knaurs Lexikon written?", "is_impossible": true}, {"question": "What year was the typographical error first corrected?", "is_impossible": true}, {"question": "What year was the Dutch Rijkswaterstaat found?", "is_impossible": true}, {"question": "When was the authoritative Brockhaus Enzyklopädie written?", "is_impossible": true}, {"question": "How wide is the Rhine?", "is_impossible": true}]}]}
