{"data": [{"id": "31_1", "context": "Islamism, also known as Political Islam (Arabic: إسلام سياسي‎ islām siyāsī), is an Islamic revival movement often characterized by moral conservatism, literalism, and the attempt \"to implement Islamic values in all spheres of life.\" Islamism favors the reordering of government and society in accordance with the Shari'a. The different Islamist movements have been described as \"oscillating between two poles\": at one end is a strategy of Islamization of society through state power seized by revolution or invasion; at the other \"reformist\" pole Islamists work to Islamize society gradually \"from the bottom up\". The movements have \"arguably altered the Middle East more than any trend since the modern states gained independence\", redefining \"politics and even borders\" according to one journalist (Robin Wright).", "questions": [{"question": "What is an Islamic revival movement?", "is_impossible": false}, {"question": "What aspects of life does Islamism seek to integrate itself into?", "is_impossible": false}, {"question": "What goal does Islamism have when it comes to society and government?", "is_impossible": false}, {"question": "What have the two different Islamist movements been described as oscillating between?", "is_impossible": false}, {"question": "One strategy of Islamization is to seize power by what methods?", "is_impossible": false}, {"question": "What is a non-Islamic revival movement?", "is_impossible": true}, {"question": " What aspects of life does Islamism not seek to integrate itself into?", "is_impossible": true}, {"question": " What goal does Islamism not have when it comes to society and government?", "is_impossible": true}, {"question": " One strategy of Islamization is to not seize power by what methods?", "is_impossible": true}]}, {"id": "31_2", "context": "Moderate and reformist Islamists who accept and work within the democratic process include parties like the Tunisian Ennahda Movement. Jamaat-e-Islami of Pakistan is basically a socio-political and democratic Vanguard party but has also gained political influence through military coup d'état in past. The Islamist groups like Hezbollah in Lebanon and Hamas in Palestine participate in democratic and political process as well as armed attacks, seeking to abolish the state of Israel. Radical Islamist organizations like al-Qaeda and the Egyptian Islamic Jihad, and groups such as the Taliban, entirely reject democracy, often declaring as kuffar those Muslims who support it (see takfirism), as well as calling for violent/offensive jihad or urging and conducting attacks on a religious basis.", "questions": [{"question": "What process do moderate and reformist Islamists work within the boundaries of?", "is_impossible": false}, {"question": "Where does Hamas originate?", "is_impossible": false}, {"question": "What is the goal of Islamist groups like Hezbollah and Hamas?", "is_impossible": false}, {"question": "What do radical Islamist organizations reject entirely?", "is_impossible": false}, {"question": "On what basis do the radical Islamist organizations conduct their attacks?", "is_impossible": false}, {"question": "What process do moderate and reformist Islamists not work within the boundaries of?", "is_impossible": true}, {"question": " Where does Pamas originate?", "is_impossible": true}, {"question": " What is the goal of non-Islamist groups like Hezbollah and Hamas?", "is_impossible": true}, {"question": " What do radical Islamist organizations accept entirely?", "is_impossible": true}, {"question": "On what basis do the radical non-Islamist organizations conduct their attacks?", "is_impossible": true}]}, {"id": "31_3", "context": "Another major division within Islamism is between what Graham E. Fuller has described as the fundamentalist \"guardians of the tradition\" (Salafis, such as those in the Wahhabi movement) and the \"vanguard of change and Islamic reform\" centered around the Muslim Brotherhood. Olivier Roy argues that \"Sunni pan-Islamism underwent a remarkable shift in the second half of the 20th century\" when the Muslim Brotherhood movement and its focus on Islamisation of pan-Arabism was eclipsed by the Salafi movement with its emphasis on \"sharia rather than the building of Islamic institutions,\" and rejection of Shia Islam. Following the Arab Spring, Roy has described Islamism as \"increasingly interdependent\" with democracy in much of the Arab Muslim world, such that \"neither can now survive without the other.\" While Islamist political culture itself may not be democratic, Islamists need democratic elections to maintain their legitimacy. At the same time, their popularity is such that no government can call itself democratic that excludes mainstream Islamist groups.", "questions": [{"question": "What exists between fundamentalist Islamism and reformist Islamism?", "is_impossible": false}, {"question": "What did Olivier Roy state underwent a remarkable shift in the second half of the 20th century?", "is_impossible": false}, {"question": "What did the Salafi movement put emphasis on?", "is_impossible": false}, {"question": "What has Islamism been increasingly interdependent with following the Arab Spring?", "is_impossible": false}, {"question": "Why do Islamists need democratic elections?", "is_impossible": false}, {"question": "What exists between fundamentalist Islamism and non-reformist Islamism?", "is_impossible": true}, {"question": "What did Olivier Roy state underwent a remarkable shift in the second half of the 21st century?", "is_impossible": true}, {"question": " What did the non-Salafi movement put emphasis on?", "is_impossible": true}, {"question": "What has Islamism been increasingly interdependent with following the non-Arab Spring?", "is_impossible": true}, {"question": " Why don't Islamists need democratic elections?", "is_impossible": true}]}, {"id": "31_4", "context": "Islamism is a controversial concept not just because it posits a political role for Islam but also because its supporters believe their views merely reflect Islam, while the contrary idea that Islam is, or can be, apolitical is an error. Scholars and observers who do not believe that Islam is merely a political ideology include Fred Halliday, John Esposito and Muslim intellectuals like Javed Ahmad Ghamidi. Hayri Abaza argues the failure to distinguish between Islam and Islamism leads many in the West to support illiberal Islamic regimes, to the detriment of progressive moderates who seek to separate religion from politics.", "questions": [{"question": "What type of role that Islamism seeks makes it a somewhat controversial concept?", "is_impossible": false}, {"question": "What do supporters of Islamism believe their views reflect?", "is_impossible": false}, {"question": "The idea that Islam can be apolitical isn't able to be embraced by whom?", "is_impossible": false}, {"question": "What does the inability to separate Islam from Islamism lead many in the West to support?", "is_impossible": false}, {"question": "What do progressive moderates of Islam seek to separate?", "is_impossible": false}, {"question": "What type of role that Islamism seeks makes it not a controversial concept?", "is_impossible": true}, {"question": " What don't supporters of Islamism believe their views reflect?", "is_impossible": true}, {"question": "The idea that Islam can't be apolitical isn't able to be embraced by whom?", "is_impossible": true}, {"question": "What does the inability to separate Islam from Islamism lead many in the Eest to support?", "is_impossible": true}, {"question": " What don't progressive moderates of Islam seek to separate?", "is_impossible": true}]}, {"id": "31_5", "context": "Islamists have asked the question, \"If Islam is a way of life, how can we say that those who want to live by its principles in legal, social, political, economic, and political spheres of life are not Muslims, but Islamists and believe in Islamism, not [just] Islam?\" Similarly, a writer for the International Crisis Group maintains that \"the conception of 'political Islam'\" is a creation of Americans to explain the Iranian Islamic Revolution and apolitical Islam was a historical fluke of the \"short-lived era of the heyday of secular Arab nationalism between 1945 and 1970\", and it is quietist/non-political Islam, not Islamism, that requires explanation.", "questions": [{"question": "What term do Islamists think should be applied to them?", "is_impossible": false}, {"question": "What does a writer for the International Crisis Group think the concept of political Islam is a creation of?", "is_impossible": false}, {"question": "What was apolitical Islam?", "is_impossible": false}, {"question": "When was the heyday of secular Arab nationalism?", "is_impossible": false}, {"question": "What, rather than Islamism, requires explanation?", "is_impossible": false}, {"question": "What term don't Islamists think should be applied to them?", "is_impossible": true}, {"question": " What does a writer for the International Crisis Group think the concept of political Islam is not a creation of?", "is_impossible": true}, {"question": " What wasn't apolitical Islam?", "is_impossible": true}, {"question": " When was the heyday of secular non-Arab nationalism?", "is_impossible": true}, {"question": "What, rather than Islamism, requires no explanation?", "is_impossible": true}]}, {"id": "31_6", "context": "During the 1970s and sometimes later, Western and pro-Western governments often supported sometimes fledgling Islamists and Islamist groups that later came to be seen as dangerous enemies. Islamists were considered by Western governments bulwarks against—what were thought to be at the time—more dangerous leftist/communist/nationalist insurgents/opposition, which Islamists were correctly seen as opposing. The US spent billions of dollars to aid the mujahideen Muslim Afghanistan enemies of the Soviet Union, and non-Afghan veterans of the war returned home with their prestige, \"experience, ideology, and weapons\", and had considerable impact.", "questions": [{"question": "When did Western governments support fledgling Islamists?", "is_impossible": false}, {"question": "What did some of the Islamist groups supported by the West later become to be seen as?", "is_impossible": false}, {"question": "Western governments considered Islamists to be the lesser of two evils when compared to whom?", "is_impossible": false}, {"question": "Who did the US provide aid to, to fight against the Soviet Union?", "is_impossible": false}, {"question": "What did the non-Afghan veterans returning home have in addition to their prestige?", "is_impossible": false}, {"question": "When did Eastern governments support fledgling Islamists?", "is_impossible": true}, {"question": "What did some of the Islamist groups supported by the East later become to be seen as?", "is_impossible": true}, {"question": "Western governments considered Islamists to be the worse of two evils when compared to whom?", "is_impossible": true}, {"question": " Who did the US refuse aid to, to fight against the Soviet Union?", "is_impossible": true}, {"question": "What did the non-Afghan veterans returning home not have in addition to their prestige?", "is_impossible": true}]}, {"id": "31_7", "context": "Egyptian President Anwar Sadat – whose policies included opening Egypt to Western investment (infitah); transferring Egypt's allegiance from the Soviet Union to the United States; and making peace with Israel – released Islamists from prison and welcomed home exiles in tacit exchange for political support in his struggle against leftists. His \"encouraging of the emergence of the Islamist movement\" was said to have been \"imitated by many other Muslim leaders in the years that followed.\"  This \"gentlemen's agreement\" between Sadat and Islamists broke down in 1975 but not before Islamists came to completely dominate university student unions. Sadat was later assassinated and a formidable insurgency was formed in Egypt in the 1990s. The French government has also been reported to have promoted Islamist preachers \"in the hope of channeling Muslim energies into zones of piety and charity.\"", "questions": [{"question": "Who is the President of Egypt?", "is_impossible": false}, {"question": "What relationship with Israel is Sadat for?", "is_impossible": false}, {"question": "What was Sadat seeking by releasing Islamists from prison?", "is_impossible": false}, {"question": "When did the so called gentlemen's agreement between Sadat and the Islamists break down?", "is_impossible": false}, {"question": "How was Sadat rewarded by the Islamists for his attempts to bring Egypt into modern times and civilization?", "is_impossible": false}, {"question": "Who is the President of Afghanistan?", "is_impossible": true}, {"question": " What relationship with Israel is Sadat against?", "is_impossible": true}, {"question": " What was Sadat not seeking by releasing Islamists from prison?", "is_impossible": true}, {"question": " When did the so called gentlemen's agreement between Sadat and the Islamists not break down?", "is_impossible": true}, {"question": "How was Sadat rewarded by the Islamists for his attempts to keep Egypt from being in modern times and civilization?", "is_impossible": true}]}, {"id": "31_8", "context": "The interpretation of Islam promoted by this funding was the strict, conservative Saudi-based Wahhabism or Salafism. In its harshest form it preached that Muslims should not only \"always oppose\" infidels \"in every way,\" but \"hate them for their religion ... for Allah's sake,\" that democracy \"is responsible for all the horrible wars of the 20th century,\" that Shia and other non-Wahhabi Muslims were infidels, etc. While this effort has by no means converted all, or even most Muslims to the Wahhabist interpretation of Islam, it has done much to overwhelm more moderate local interpretations, and has set the Saudi-interpretation of Islam as the \"gold standard\" of religion in minds of some or many Muslims.", "questions": [{"question": "What type of interpretation of Islam does Salafism promote?", "is_impossible": false}, {"question": "What does Salafism in its harshest form encourage its followers to view the religion of others with?", "is_impossible": false}, {"question": "Salafism posits that democracy is responsible for what type of horrible events of the 20th century?", "is_impossible": false}, {"question": "Conservative Islam classifies Muslims who follow Shia interpretation as what?", "is_impossible": false}, {"question": "What interpretation of Islam is, for many of the adherents, the \"gold standard\" of their religion?", "is_impossible": false}, {"question": " What type of interpretation of Islam does Salafism discourage?", "is_impossible": true}, {"question": "What does Salafism in its harshest form discourage its followers to view the religion of others with?", "is_impossible": true}, {"question": "Salafism posits that democracy is responsible for what type of horrible events of the 21st century?", "is_impossible": true}, {"question": "Conservative Islam classifies non-Muslims who follow Shia interpretation as what?", "is_impossible": true}, {"question": "What interpretation of Islam is, for many of the adherents, not the \"gold standard\" of their religion?", "is_impossible": true}]}, {"id": "31_9", "context": "Islamist movements such as the Muslim Brotherhood, \"are well known for providing shelters, educational assistance, free or low cost medical clinics, housing assistance to students from out of town, student advisory groups, facilitation of inexpensive mass marriage ceremonies to avoid prohibitively costly dowry demands, legal assistance, sports facilities, and women's groups.\" All this compares very favourably against incompetent, inefficient, or neglectful governments whose commitment to social justice is limited to rhetoric.", "questions": [{"question": "What type of movement is the Muslim Brotherhood?", "is_impossible": false}, {"question": "What type of assistance to out of town students is the Muslim Brotherhood known for?", "is_impossible": false}, {"question": "Why has the Muslim Brotherhood facilitated inexpensive mass marriage ceremonies?", "is_impossible": false}, {"question": "The Muslim Brotherhood's competence compares well against what type of local governments?", "is_impossible": false}, {"question": "What are incompetent government's commitment to social justice limited to?", "is_impossible": false}, {"question": " What type of movement is the non-Muslim Brotherhood?", "is_impossible": true}, {"question": "What type of assistance to out of town students is the non-Muslim Brotherhood known for?", "is_impossible": true}, {"question": "Why has the Muslim Brotherhood not facilitated inexpensive mass marriage ceremonies?", "is_impossible": true}, {"question": "The Muslim Brotherhood's competence does not compare against what type of local governments?", "is_impossible": true}, {"question": "What are incompetent government's commitment to social justice not limited to?", "is_impossible": true}]}, {"id": "31_10", "context": "While studying law and philosophy in England and Germany, Iqbal became a member of the London branch of the All India Muslim League. He came back to Lahore in 1908. While dividing his time between law practice and philosophical poetry, Iqbal had remained active in the Muslim League. He did not support Indian involvement in World War I and remained in close touch with Muslim political leaders such as Muhammad Ali Johar and Muhammad Ali Jinnah. He was a critic of the mainstream Indian nationalist and secularist Indian National Congress. Iqbal's seven English lectures were published by Oxford University press in 1934 in a book titled The Reconstruction of Religious Thought in Islam. These lectures dwell on the role of Islam as a religion as well as a political and legal philosophy in the modern age.", "questions": [{"question": "What was Iqbal studying in England and Germany?", "is_impossible": false}, {"question": "What organization did Iqbal join in London?", "is_impossible": false}, {"question": "What year did Iqbal return to Lahore?", "is_impossible": false}, {"question": "Who was Iqbal a critic of?", "is_impossible": false}, {"question": "What book was Iqbal's seven English lectures published as?", "is_impossible": false}, {"question": " What was Iqbal studying in Ireland?", "is_impossible": true}, {"question": " What organization did Iqbal join in France?", "is_impossible": true}, {"question": " What year did Iqbal leave Lahore?", "is_impossible": true}, {"question": " Who was Iqbal a supporter of?", "is_impossible": true}, {"question": " What book was Iqbal's eight English lectures published as?", "is_impossible": true}]}, {"id": "31_11", "context": "Iqbal expressed fears that not only would secularism and secular nationalism weaken the spiritual foundations of Islam and Muslim society, but that India's Hindu-majority population would crowd out Muslim heritage, culture and political influence. In his travels to Egypt, Afghanistan, Palestine and Syria, he promoted ideas of greater Islamic political co-operation and unity, calling for the shedding of nationalist differences. Sir Muhammad Iqbal was elected president of the Muslim League in 1930 at its session in Allahabad as well as for the session in Lahore in 1932. In his Allahabad Address on 29 December 1930, Iqbal outlined a vision of an independent state for Muslim-majority provinces in northwestern India. This address later inspired the Pakistan movement.", "questions": [{"question": "What did Iqbal fear would weaken the spiritual foundations of Islam and Muslim society?", "is_impossible": false}, {"question": "Iqbal worried that India's mostly Hindu population would do what to Muslim heritage and culture?", "is_impossible": false}, {"question": "When Iqbal promoted ideas of greater Islamic political unity, what did he encourage ending?", "is_impossible": false}, {"question": "When was Iqbal elected president of the Muslim League?", "is_impossible": false}, {"question": "What did Iqbal's Allahabad address inspire?", "is_impossible": false}, {"question": "What did Iqbal fear would strengthen the spiritual foundations of Islam and Muslim society?", "is_impossible": true}, {"question": " Iqbal worried that India's mostly Hindu population would not do what to Muslim heritage and culture?", "is_impossible": true}, {"question": " When Iqbal promoted ideas of greater Islamic political unity, what did he discourage ending?", "is_impossible": true}, {"question": " When was Iqbal elected vice president of the Muslim League?", "is_impossible": true}, {"question": " What did Iqbal's Allahabad address not inspire?", "is_impossible": true}]}, {"id": "31_12", "context": "Sayyid Abul Ala Maududi was an important early twentieth-century figure in the Islamic revival in India, and then after independence from Britain, in Pakistan. Trained as a lawyer he chose the profession of journalism, and wrote about contemporary issues and most importantly about Islam and Islamic law. Maududi founded the Jamaat-e-Islami party in 1941 and remained its leader until 1972. However, Maududi had much more impact through his writing than through his political organising. His extremely influential books (translated into many languages) placed Islam in a modern context, and influenced not only conservative ulema but liberal modernizer Islamists such as al-Faruqi, whose \"Islamization of Knowledge\" carried forward some of Maududi's key principles.", "questions": [{"question": "Who was an important figure in the twentieth-century Islamic revival in India?", "is_impossible": false}, {"question": "Maududi was trained as a lawyer, but chose what professional for himself instead?", "is_impossible": false}, {"question": "When did Maududi found the Jamaat-e-Islami party?", "is_impossible": false}, {"question": "Who was an important early figure in the Islamic revival in India?", "is_impossible": false}, {"question": "Though trained as a lawyer, what profession did Maududi pursue instead?", "is_impossible": false}, {"question": "Where did Maududi exert the most impact?", "is_impossible": false}, {"question": "Where did Maududi's books place Islam?", "is_impossible": false}, {"question": "Who was not an important figure in the twentieth-century Islamic revival in India?", "is_impossible": true}, {"question": " Maududi was trained as a lawyer, but chose what religion for himself instead?", "is_impossible": true}, {"question": "When did Maududi leave the Jamaat-e-Islami party?", "is_impossible": true}, {"question": " Where did Maududi exert the least impact?", "is_impossible": true}, {"question": " Where did Maududi's books not place Islam?", "is_impossible": true}]}, {"id": "31_13", "context": "Maududi also believed that Muslim society could not be Islamic without Sharia, and Islam required the establishment of an Islamic state. This state should be a \"theo-democracy,\" based on the principles of: tawhid (unity of God), risala (prophethood) and khilafa (caliphate). Although Maududi talked about Islamic revolution, by \"revolution\" he meant not the violence or populist policies of the Iranian Revolution, but the gradual changing the hearts and minds of individuals from the top of society downward through an educational process or da'wah.", "questions": [{"question": "What did Maududi believe Muslim society could not be Islamic in the absence of?", "is_impossible": false}, {"question": "Maududi believed that Islam needed what to be established?", "is_impossible": false}, {"question": "What is the English translation of tawhid?", "is_impossible": false}, {"question": "What type of revolution did Maududi advocate?", "is_impossible": false}, {"question": "By what method did Maududi want to change the hearts and minds of individuals?", "is_impossible": false}, {"question": "What did Maududi believe Muslim society could be Islamic in the absence of?", "is_impossible": true}, {"question": " Maududi believed that Islam needed what to not be established?", "is_impossible": true}, {"question": " What is the French translation of tawhid?", "is_impossible": true}, {"question": " What type of revolution did Maududi not advocate?", "is_impossible": true}, {"question": "By what method did Maududi not want to change the hearts and minds of individuals?", "is_impossible": true}]}, {"id": "31_14", "context": "Roughly contemporaneous with Maududi was the founding of the Muslim Brotherhood in Ismailiyah, Egypt in 1928 by Hassan al Banna. His was arguably the first, largest and most influential modern Islamic political/religious organization. Under the motto \"the Qur'an is our constitution,\" it sought Islamic revival through preaching and also by providing basic community services including schools, mosques, and workshops. Like Maududi, Al Banna believed in the necessity of government rule based on Shariah law implemented gradually and by persuasion, and of eliminating all imperialist influence in the Muslim world.", "questions": [{"question": "When was the Muslim Brotherhood founded?", "is_impossible": false}, {"question": "Where was the Muslim Brotherhood founded?", "is_impossible": false}, {"question": "Who founded the Muslim Brotherhood?", "is_impossible": false}, {"question": "The motto of the Muslim Brotherhood specifies what as being their constitution?", "is_impossible": false}, {"question": "What influence did Al Banna wish to eliminate from the Muslim world?", "is_impossible": false}, {"question": "When was the non-Muslim Brotherhood founded?", "is_impossible": true}, {"question": " Where was the non-Muslim Brotherhood founded?", "is_impossible": true}]}, {"id": "31_15", "context": "Some elements of the Brotherhood, though perhaps against orders, did engage in violence against the government, and its founder Al-Banna was assassinated in 1949 in retaliation for the assassination of Egypt's premier Mahmud Fami Naqrashi three months earlier. The Brotherhood has suffered periodic repression in Egypt and has been banned several times, in 1948 and several years later following confrontations with Egyptian president Gamal Abdul Nasser, who jailed thousands of members for several years.", "questions": [{"question": "Some elements of the Brotherhood directed what action against the government?", "is_impossible": false}, {"question": "When was Al-Banna assassinated?", "is_impossible": false}, {"question": "Who was Al-Banna's assassination a retaliation for the prior assassination of?", "is_impossible": false}, {"question": "When was the Brotherhood first banned in Egypt?", "is_impossible": false}, {"question": "What Egyptian president jailed thousands of members of the Brotherhood?", "is_impossible": false}, {"question": "Some elements of the Brotherhood did not direct what action against the government?", "is_impossible": true}, {"question": " When was Al-Banna born?", "is_impossible": true}, {"question": "Who wasn't Al-Banna's assassination a retaliation for the prior assassination of?", "is_impossible": true}, {"question": " When was the Brotherhood first accepted in Egypt?", "is_impossible": true}, {"question": "What Egyptian president jailed hundreds of members of the Brotherhood?", "is_impossible": true}]}, {"id": "31_16", "context": "Despite periodic repression, the Brotherhood has become one of the most influential movements in the Islamic world, particularly in the Arab world. For many years it was described as \"semi-legal\" and was the only opposition group in Egypt able to field candidates during elections. In the Egyptian parliamentary election, 2011–2012, the political parties identified as \"Islamist\" (the Brotherhood's Freedom and Justice Party, Salafi Al-Nour Party and liberal Islamist Al-Wasat Party) won 75% of the total seats. Mohamed Morsi, an Islamist democrat of Muslim Brotherhood, was the first democratically elected president of Egypt. He was deposed during the 2013 Egyptian coup d'état.", "questions": [{"question": "What status has the Brotherhood obtained in the Islamic world?", "is_impossible": false}, {"question": "For many years, what was the Brotherhood described as?", "is_impossible": false}, {"question": "The Brotherhood was the only opposition group in Egypt able to do what during elections?", "is_impossible": false}, {"question": "What percentage of seats did political parties identifying as Islamist win in the Egyptian parliamentary election of 2011-2012?", "is_impossible": false}, {"question": "Who was the first democratically elected president of Egypt?", "is_impossible": false}, {"question": " What status has the Brotherhood obtained in the non-Islamic world?", "is_impossible": true}, {"question": " For many centuries, what was the Brotherhood described as?", "is_impossible": true}, {"question": "The Brotherhood was the only opposition group outside of Egypt able to do what during elections?", "is_impossible": true}, {"question": "What percentage of seats did political parties identifying as Islamist win in the Egyptian parliamentary election of 2012-2013?", "is_impossible": true}, {"question": " Who was the first democratically elected president outside of Egypt?", "is_impossible": true}]}, {"id": "31_17", "context": "The quick and decisive defeat of the Arab troops during the Six-Day War by Israeli troops constituted a pivotal event in the Arab Muslim world. The defeat along with economic stagnation in the defeated countries, was blamed on the secular Arab nationalism of the ruling regimes. A steep and steady decline in the popularity and credibility of secular, socialist and nationalist politics ensued. Ba'athism, Arab socialism, and Arab nationalism suffered, and different democratic and anti-democratic Islamist movements inspired by Maududi and Sayyid Qutb gained ground.", "questions": [{"question": "What was the defeat of the Arab troops at the hand of the Israeli troops during the Six-Day War?", "is_impossible": false}, {"question": "The defeat of the Arab troops in the Six-Day War constituted what for the Arab Muslim world?", "is_impossible": false}, {"question": "Secular Arab nationalism was blamed for both the defeat of Arab troops as well as what type of stagnation?", "is_impossible": false}, {"question": "What happened to the credibility of secular politics as a result of the Six-Day War?", "is_impossible": false}, {"question": "What gained ground when Arab nationalism suffered?", "is_impossible": false}, {"question": "What was the defeat of the Arab troops at the hand of the Israeli troops during the Seven-Day War?", "is_impossible": true}, {"question": "The defeat of the Arab troops in the Seven-Day War constituted what for the Arab Muslim world?", "is_impossible": true}, {"question": "Secular Arab nationalism was blamed for both the success of Arab troops as well as what type of stagnation?", "is_impossible": true}, {"question": " What happened to the credibility of secular politics as a result of the Eight-Day War?", "is_impossible": true}, {"question": " What declined when Arab nationalism suffered?", "is_impossible": true}]}, {"id": "31_18", "context": "The views of Ali Shariati, ideologue of the Iranian Revolution, had resemblance with Mohammad Iqbal, ideological father of the State of Pakistan, but Khomeini's beliefs is perceived to be placed somewhere between beliefs of Sunni Islamic thinkers like Mawdudi and Qutb. He believed that complete imitation of the Prophet Mohammad and his successors such as Ali for restoration of Sharia law was essential to Islam, that many secular, Westernizing Muslims were actually agents of the West serving Western interests, and that the acts such as \"plundering\" of Muslim lands was part of a long-term conspiracy against Islam by the Western governments.", "questions": [{"question": "Who was the ideologue of the Iranian Revolution?", "is_impossible": false}, {"question": "Mohammad Iqbal was what type of father to the State of Pakistan?", "is_impossible": false}, {"question": "Where does Khomeini's beliefs fall as compared to Mawdudi and Qutb?", "is_impossible": false}, {"question": "Who was it essential to Islam to imitate?", "is_impossible": false}, {"question": "What long term agenda was the acts of plundering Muslim lands by the West?", "is_impossible": false}, {"question": "Who was not the ideologue of the Iranian Revolution?", "is_impossible": true}, {"question": " Mohammad Iqbal was what type of enemy to the State of Pakistan?", "is_impossible": true}, {"question": " Who was it essential for Islam to not imitate?", "is_impossible": true}, {"question": "hat long term agenda was the acts of plundering Muslim lands by the East?", "is_impossible": true}]}, {"id": "31_19", "context": "The Islamic Republic has also maintained its hold on power in Iran in spite of US economic sanctions, and has created or assisted like-minded Shia terrorist groups in Iraq, Egypt, Syria, Jordan (SCIRI) and Lebanon (Hezbollah) (two Muslim countries that also have large Shiite populations). During the 2006 Israel-Lebanon conflict, the Iranian government enjoyed something of a resurgence in popularity amongst the predominantly Sunni \"Arab street,\" due to its support for Hezbollah and to President Mahmoud Ahmadinejad's vehement opposition to the United States and his call that Israel shall vanish.", "questions": [{"question": "What Republic has maintained its control of Iran?", "is_impossible": false}, {"question": "What type of sanctions has the US directed at Iran?", "is_impossible": false}, {"question": "Iran has assisted what type of groups in Iraq?", "is_impossible": false}, {"question": "When did the Iranian government enjoy something of a resurgence?", "is_impossible": false}, {"question": "Who stated he wanted Israel to vanish?", "is_impossible": false}, {"question": "What Republic has maintained its control of Afghanistan?", "is_impossible": true}, {"question": " What type of sanctions has Canada directed at Iran?", "is_impossible": true}, {"question": "Iran has assisted what type of groups in China?", "is_impossible": true}, {"question": "When did the Iranian government not get a resurgence?", "is_impossible": true}, {"question": " Who stated he did not want Israel to vanish?", "is_impossible": true}]}, {"id": "31_20", "context": "In 1979, the Soviet Union deployed its 40th Army into Afghanistan, attempting to suppress an Islamic rebellion against an allied Marxist regime in the Afghan Civil War. The conflict, pitting indigenous impoverished Muslims (mujahideen) against an anti-religious superpower, galvanized thousands of Muslims around the world to send aid and sometimes to go themselves to fight for their faith. Leading this pan-Islamic effort was Palestinian sheikh Abdullah Yusuf Azzam. While the military effectiveness of these \"Afghan Arabs\" was marginal, an estimated 16,000 to 35,000 Muslim volunteers came from around the world came to fight in Afghanistan.", "questions": [{"question": "Who deployed its army into Afghanistan in 1979?", "is_impossible": false}, {"question": "What was the Soviet Union trying to suppress with its army?", "is_impossible": false}, {"question": "What did the conflict galvanize Muslims around the world to do?", "is_impossible": false}, {"question": "How effective was the military use of the \"Afghan Arabs\"?", "is_impossible": false}, {"question": "How many Muslims came from around the world to fight in Afghanistan?", "is_impossible": false}, {"question": "Who deployed its army into Iraq in 1979?", "is_impossible": true}, {"question": " What was the Soviet Union trying to motivate with its army?", "is_impossible": true}, {"question": " What did the conflict galvanize non-Muslims around the world to do?", "is_impossible": true}, {"question": " How ineffective was the military use of the \"Afghan Arabs\"?", "is_impossible": true}, {"question": "How many Muslims came from Iraq to fight in Afghanistan?", "is_impossible": true}]}, {"id": "31_21", "context": "Another factor in the early 1990s that worked to radicalize the Islamist movement was the Gulf War, which brought several hundred thousand US and allied non-Muslim military personnel to Saudi Arabian soil to put an end to Saddam Hussein's occupation of Kuwait. Prior to 1990 Saudi Arabia played an important role in restraining the many Islamist groups that received its aid. But when Saddam, secularist and Ba'athist dictator of neighboring Iraq, attacked Saudi Arabia (his enemy in the war), western troops came to protect the Saudi monarchy. Islamists accused the Saudi regime of being a puppet of the west.", "questions": [{"question": "What did the Gulf War inadvertently do in the early 1990s?", "is_impossible": false}, {"question": "Whose occupation of Kuwait did the US military personal seek to put an end to?", "is_impossible": false}, {"question": "Up until 1990, Saudi Arabia played an important role in restraining what groups?", "is_impossible": false}, {"question": "What monarchy did western troops protect?", "is_impossible": false}, {"question": "Whose puppet did Islamists accuse the Saudi regime of being?", "is_impossible": false}, {"question": " What did the Gulf War do on purpose in the early 1990s?", "is_impossible": true}, {"question": " Whose occupation of Kuwait did Iraq military personal seek to put an end to?", "is_impossible": true}, {"question": "Up until 1990, Saudi Arabia played an unimportant role in restraining what groups?", "is_impossible": true}, {"question": " What monarchy did Eastern troops protect?", "is_impossible": true}, {"question": " Whose puppet did Islamists support the Saudi regime of being?", "is_impossible": true}]}, {"id": "31_22", "context": "These attacks resonated with conservative Muslims and the problem did not go away with Saddam's defeat either, since American troops remained stationed in the kingdom, and a de facto cooperation with the Palestinian-Israeli peace process developed. Saudi Arabia attempted to compensate for its loss of prestige among these groups by repressing those domestic Islamists who attacked it (bin Laden being a prime example), and increasing aid to Islamic groups (Islamist madrassas around the world and even aiding some violent Islamist groups) that did not, but its pre-war influence on behalf of moderation was greatly reduced. One result of this was a campaign of attacks on government officials and tourists in Egypt, a bloody civil war in Algeria and Osama bin Laden's terror attacks climaxing in the 9/11 attack.", "questions": [{"question": "Who did the attacks resonate most with?", "is_impossible": false}, {"question": "Where did American troops remain stationed after Saddam's defeat?", "is_impossible": false}, {"question": "What did Saudi Arabia try to repress to compensate for its loss of stature? ", "is_impossible": false}, {"question": "Where did a bloody civil war break out?", "is_impossible": false}, {"question": "Who masterminded many terror attacks?", "is_impossible": false}, {"question": "Who did the attacks resonate least with?", "is_impossible": true}, {"question": "Where did American troops remain stationed after Saddam's win?", "is_impossible": true}, {"question": "What did Saudi Arabia not try to repress to compensate for its loss of stature?", "is_impossible": true}, {"question": " Where did a not-bloody civil war break out?", "is_impossible": true}, {"question": " Who did not mastermind many terror attacks?", "is_impossible": true}]}, {"id": "31_23", "context": "While Qutb's ideas became increasingly radical during his imprisonment prior to his execution in 1966, the leadership of the Brotherhood, led by Hasan al-Hudaybi, remained moderate and interested in political negotiation and activism. Fringe or splinter movements inspired by the final writings of Qutb in the mid-1960s (particularly the manifesto Milestones, a.k.a. Ma'alim fi-l-Tariq) did, however, develop and they pursued a more radical direction. By the 1970s, the Brotherhood had renounced violence as a means of achieving its goals.", "questions": [{"question": "Whose ideas became increasingly radical during his imprisonment? ", "is_impossible": false}, {"question": "When was Qutb executed?", "is_impossible": false}, {"question": "What organization was led by Hasan al-Hudaybi?", "is_impossible": false}, {"question": "What movements pursued a more radical direction?", "is_impossible": false}, {"question": "When had the Brotherhood renounced violence as a means of achieving its goals?", "is_impossible": false}, {"question": "Whose ideas did not become increasingly radical during his imprisonment?", "is_impossible": true}, {"question": " When was Qutb born?", "is_impossible": true}, {"question": " What organization was defeated by Hasan al-Hudaybi?", "is_impossible": true}, {"question": " What movements did not pursue a more radical direction?", "is_impossible": true}, {"question": "When did the Brotherhood support violence as a means of achieving its goals?", "is_impossible": true}]}, {"id": "31_24", "context": "The path of violence and military struggle was then taken up by the Egyptian Islamic Jihad organization responsible for the assassination of Anwar Sadat in 1981. Unlike earlier anti-colonial movements the extremist group directed its attacks against what it believed were \"apostate\" leaders of Muslim states, leaders who held secular leanings or who had introduced or promoted Western/foreign ideas and practices into Islamic societies. Its views were outlined in a pamphlet written by Muhammad Abd al-Salaam Farag, in which he states:", "questions": [{"question": "Who took up the path of violence?", "is_impossible": false}, {"question": "When did the Egyptian Islamic Jihad assassinate Anwar Sadat?", "is_impossible": false}, {"question": "Which leaders did the Islamic extremists attack?", "is_impossible": false}, {"question": "What sin were the leaders the extremists attacked guilty of?", "is_impossible": false}, {"question": "Who wrote a pamphlet outlining the radical ideas of the extremists?", "is_impossible": false}, {"question": "Who rejected the path of violence?", "is_impossible": true}, {"question": " When did the Egyptian Islamic Jihad support Anwar Sadat?", "is_impossible": true}, {"question": " Which leaders did the Islamic extremists not attack?", "is_impossible": true}, {"question": " What sin were the leaders the extremists attacked innocent of?", "is_impossible": true}, {"question": "Who wrote a pamphlet outlining the non-radical ideas of the extremists?", "is_impossible": true}]}, {"id": "31_25", "context": "Another of the Egyptian groups which employed violence in their struggle for Islamic order was al-Gama'a al-Islamiyya (Islamic Group). Victims of their campaign against the Egyptian state in the 1990s included the head of the counter-terrorism police (Major General Raouf Khayrat), a parliamentary speaker (Rifaat al-Mahgoub), dozens of European tourists and Egyptian bystanders, and over 100 Egyptian police. Ultimately the campaign to overthrow the government was unsuccessful, and the major jihadi group, Jamaa Islamiya (or al-Gama'a al-Islamiyya), renounced violence in 2003. Other lesser known groups include the Islamic Liberation Party, Salvation from Hell and Takfir wal-Hijra, and these groups have variously been involved in activities such as attempted assassinations of political figures, arson of video shops and attempted takeovers of government buildings.", "questions": [{"question": "What did al-Gama'a al-Islamiyya use to get its way?", "is_impossible": false}, {"question": "Over 100 Egyptian police were victims of what group's campaign of terror?", "is_impossible": false}, {"question": "How did the Islamic Group's campaign to overthrow the government turn out?", "is_impossible": false}, {"question": "When did Jamaa Islamiya renounce violence?", "is_impossible": false}, {"question": "Who has the Islamic Liberation Party attempted to assassinate? ", "is_impossible": false}, {"question": " What did al-Gama'a al-Islamiyya use to not get its way?", "is_impossible": true}, {"question": "Over 300 Egyptian police were victims of what group's campaign of terror?", "is_impossible": true}, {"question": "How did the Islamic Group's campaign to support the government turn out?", "is_impossible": true}, {"question": " When did Jamaa Islamiya accept violence?", "is_impossible": true}, {"question": " Who has the Islamic Liberation Party never attempted to assassinate?", "is_impossible": true}]}, {"id": "31_26", "context": "For some decades prior to the First Palestine Intifada in 1987, the Muslim Brotherhood in Palestine took a \"quiescent\" stance towards Israel, focusing on preaching, education and social services, and benefiting from Israel's \"indulgence\" to build up a network of mosques and charitable organizations. As the First Intifada gathered momentum and Palestinian shopkeepers closed their shops in support of the uprising, the Brotherhood announced the formation of HAMAS (\"zeal\"), devoted to Jihad against Israel. Rather than being more moderate than the PLO, the 1988 Hamas charter took a more uncompromising stand, calling for the destruction of Israel and the establishment of an Islamic state in Palestine. It was soon competing with and then overtaking the PLO for control of the intifada. The Brotherhood's base of devout middle class found common cause with the impoverished youth of the intifada in their cultural conservatism and antipathy for activities of the secular middle class such as drinking alcohol and going about without hijab.", "questions": [{"question": "Until 1987, what stance did the Muslim Brotherhood in Palestine take towards Israel?", "is_impossible": false}, {"question": "What organization is devoted to Jihad against Israel?", "is_impossible": false}, {"question": "What did the Hamas charter uncompromisingly encourage?", "is_impossible": false}, {"question": "Where does HAMAS want to establish an Islamic state?", "is_impossible": false}, {"question": "The Brotherhood's members are against consuming what beverage?", "is_impossible": false}, {"question": "Until 1987, what stance did the Muslim Brotherhood in Iraq take towards Israel?", "is_impossible": true}, {"question": " What organization is devoted to Jihad against Iraq?", "is_impossible": true}, {"question": " What did the Hamas charter compromisingly encourage?", "is_impossible": true}, {"question": " Where does HAMAS not want to establish an Islamic state?", "is_impossible": true}, {"question": "The Brotherhood's members are in support of consuming what beverage?", "is_impossible": true}]}, {"id": "31_27", "context": "Hamas has continued to be a major player in Palestine. From 2000 to 2007 it killed 542 people in 140 suicide bombing or \"martyrdom operations\". In the January 2006 legislative election—its first foray into the political process—it won the majority of the seats, and in 2007 it drove the PLO out of Gaza. Hamas has been praised by Muslims for driving Israel out of the Gaza Strip, but criticized for failure to achieve its demands in the 2008-9 and 2014 Gaza Wars despite heavy destruction and significant loss of life.", "questions": [{"question": "What organization has continued to be a major disruptive force in Palestine?", "is_impossible": false}, {"question": "How many people did Hamas kill between 2000 to 2007?", "is_impossible": false}, {"question": "What did Hamas win in the January 2006 legislative election?", "is_impossible": false}, {"question": "When did Hamas drive the PLO out of Gaza?", "is_impossible": false}, {"question": "What have Muslims praised Hamas for doing?", "is_impossible": false}, {"question": "What organization has stopped being a major disruptive force in Palestine?", "is_impossible": true}, {"question": "How many people did Hamas kill between 2010 to 2017?", "is_impossible": true}, {"question": " What did Hamas lose in the January 2006 legislative election?", "is_impossible": true}, {"question": " When did Hamas keep the PLO in Gaza?", "is_impossible": true}, {"question": " What have Muslims rejected Hamas for doing?", "is_impossible": true}]}, {"id": "31_28", "context": "For many years, Sudan had an Islamist regime under the leadership of Hassan al-Turabi. His National Islamic Front first gained influence when strongman General Gaafar al-Nimeiry invited members to serve in his government in 1979. Turabi built a powerful economic base with money from foreign Islamist banking systems, especially those linked with Saudi Arabia. He also recruited and built a cadre of influential loyalists by placing sympathetic students in the university and military academy while serving as minister of education.", "questions": [{"question": "What type of regime ruled over Sudan for many years?", "is_impossible": false}, {"question": "Who was the leader of the Islamist regime in Sudan?", "is_impossible": false}, {"question": "What organization did General Gaafar al-Nimeiry invite members of to serve in his government?", "is_impossible": false}, {"question": "How did Turabi build a strong economic base?", "is_impossible": false}, {"question": "Where did Turabi place students sympathetic to his views?", "is_impossible": false}, {"question": " What type of regime ruled over Sudan for many decades?", "is_impossible": true}, {"question": "What organization did General Gaafar al-Nimeiry discourage members of to serve in his government?", "is_impossible": true}, {"question": " How did Turabi build a weak economic base?", "is_impossible": true}, {"question": " Where did Turabi place students apathetic to his views?", "is_impossible": true}]}, {"id": "31_29", "context": "After al-Nimeiry was overthrown in 1985 the party did poorly in national elections, but in 1989 it was able to overthrow the elected post-al-Nimeiry government with the help of the military. Turabi was noted for proclaiming his support for the democratic process and a liberal government before coming to power, but strict application of sharia law, torture and mass imprisonment of the opposition, and an intensification of the long-running war in southern Sudan, once in power. The NIF regime also harbored Osama bin Laden for a time (before 9/11), and worked to unify Islamist opposition to the American attack on Iraq in the 1991 Gulf War.", "questions": [{"question": "When was al-Nimeiry overthrown?", "is_impossible": false}, {"question": "How did the party overthrow the elected government in 1989?", "is_impossible": false}, {"question": "Though Turabi proclaimed his support for the democratic process, he strictly applied what after coming into power?", "is_impossible": false}, {"question": "Who did the NIF regime harbor prior to 9/11?", "is_impossible": false}, {"question": "What did the NIF try to unify Islamist opposition against?", "is_impossible": false}, {"question": "When was al-Nimeiry accepted?", "is_impossible": true}, {"question": " How did the party overthrow the elected government in 1929?", "is_impossible": true}, {"question": "Though Turabi proclaimed his rejection for the democratic process, he strictly applied what after coming into power?", "is_impossible": true}, {"question": " Who did the NIF regime not harbor prior to 9/11?", "is_impossible": true}]}, {"id": "31_30", "context": "An Islamist movement influenced by Salafism and the jihad in Afghanistan, as well as the Muslim Brotherhood, was the FIS or Front Islamique de Salut (the Islamic Salvation Front) in Algeria. Founded as a broad Islamist coalition in 1989 it was led by Abbassi Madani, and a charismatic Islamist young preacher, Ali Belhadj. Taking advantage of economic failure and unpopular social liberalization and secularization by the ruling leftist-nationalist FLN government, it used its preaching to advocate the establishment of a legal system following Sharia law, economic liberalization and development program, education in Arabic rather than French, and gender segregation, with women staying home to alleviate the high rate of unemployment among young Algerian men. The FIS won sweeping victories in local elections and it was going to win national elections in 1991 when voting was canceled by a military coup d'état.", "questions": [{"question": "What does the acronym FIS stand for?", "is_impossible": false}, {"question": "Where was the FIS formed?", "is_impossible": false}, {"question": "When was the FIS founded?", "is_impossible": false}, {"question": "One of FIS' agenda items was to force women to start doing what?", "is_impossible": false}, {"question": "What were the national elections in 1991 canceled by?", "is_impossible": false}, {"question": "What does the acronym FISS stand for?", "is_impossible": true}, {"question": " Where was the FLIS formed?", "is_impossible": true}, {"question": " When was the FLIS founded?", "is_impossible": true}, {"question": " One of FIS' agenda items was to force men to start doing what?", "is_impossible": true}, {"question": "What were the national elections in 1994 canceled by?", "is_impossible": true}]}, {"id": "31_31", "context": "In Afghanistan, the mujahideen's victory against the Soviet Union in the 1980s did not lead to justice and prosperity, due to a vicious and destructive civil war between political and tribal warlords, making Afghanistan one of the poorest countries on earth. In 1992, the Democratic Republic of Afghanistan ruled by communist forces collapsed, and democratic Islamist elements of mujahdeen founded the Islamic State of Afghanistan. In 1996, a more conservative and anti-democratic Islamist movement known as the Taliban rose to power, defeated most of the warlords and took over roughly 80% of Afghanistan.", "questions": [{"question": "Unsurprisingly, the mujahideen's victory against the Soviets in the 1980s failed to produce what?", "is_impossible": false}, {"question": "What type of civil war was fought between political and tribal warlords?", "is_impossible": false}, {"question": "What did the civil war leave the state of Afghanistan's economy in?", "is_impossible": false}, {"question": "When did the Democratic Republic of Afghanistan collapse?", "is_impossible": false}, {"question": "How much of Afghanistan did the Taliban take over?", "is_impossible": false}, {"question": "Unsurprisingly, the mujahideen's victory with the Soviets in the 1980s succeeded to produce what?", "is_impossible": true}, {"question": "What type of civil war was not fought between political and tribal warlords?", "is_impossible": true}, {"question": " What did the civil war leave the state of Iraq economy in?", "is_impossible": true}, {"question": " When did the Democratic Republic of Iraq collapse?", "is_impossible": true}, {"question": "How much of Iraq did the Taliban take over?", "is_impossible": true}]}, {"id": "31_32", "context": "The Taliban were spawned by the thousands of madrasahs the Deobandi movement established for impoverished Afghan refugees and supported by governmental and religious groups in neighboring Pakistan. The Taliban differed from other Islamist movements to the point where they might be more properly described as Islamic fundamentalist or neofundamentalist, interested in spreading \"an idealized and systematized version of conservative tribal village customs\" under the label of Sharia to an entire country. Their ideology was also described as being influenced by Wahhabism, and the extremist jihadism of their guest Osama bin Laden.", "questions": [{"question": "Thousands of madrasahs spawned what organization?", "is_impossible": false}, {"question": "Where did support from governmental and religious groups come from?", "is_impossible": false}, {"question": "The Taliban was so different from other moments that they could be more accurately described as being what?", "is_impossible": false}, {"question": "What did the Taliban want to subject the entire country to?", "is_impossible": false}, {"question": "Who influenced the Taliban's ideology?", "is_impossible": false}, {"question": "Hundreds of madrasahs spawned what organization?", "is_impossible": true}, {"question": " Where did rejection from governmental and religious groups come from?", "is_impossible": true}, {"question": "The Taliban was so similar to other moments that they could be more accurately described as being what?", "is_impossible": true}, {"question": " What did the Taliban want to subject a small part of the country to?", "is_impossible": true}, {"question": " Who influenced the non-Taliban ideology?", "is_impossible": true}]}, {"id": "31_33", "context": "In July 1977, General Zia-ul-Haq overthrew Prime Minister Zulfiqar Ali Bhutto's regime in Pakistan. Ali Bhutto, a leftist in democratic competition with Islamists, had announced banning alcohol and nightclubs within six months, shortly before he was overthrown. Zia-ul-Haq was much more committed to Islamism, and \"Islamization\" or implementation of Islamic law, became a cornerstone of his eleven-year military dictatorship and Islamism became his \"official state ideology\". Zia ul Haq was an admirer of Mawdudi and Mawdudi's party Jamaat-e-Islami became the \"regime's ideological and political arm\". In Pakistan this Islamization from above was \"probably\" more complete \"than under any other regime except those in Iran and Sudan,\" but Zia-ul-Haq was also criticized by many Islamists for imposing \"symbols\" rather than substance, and using Islamization to legitimize his means of seizing power. Unlike neighboring Iran, Zia-ul-Haq's policies were intended to \"avoid revolutionary excess\", and not to strain relations with his American and Persian Gulf state allies. Zia-ul-Haq was killed in 1988 but Islamization remains an important element in Pakistani society.", "questions": [{"question": "When was the regime in Pakistan overthrown by General Zia-ul-Haq?", "is_impossible": false}, {"question": "What had Bhutto planned on banning within six months, before he was overthrown?", "is_impossible": false}, {"question": "What was Zia-ul-Haq's official state ideology?", "is_impossible": false}, {"question": "What was Zia-ul-Haq accused of using Islamization to legitimize? ", "is_impossible": false}, {"question": "When was Zia-ul-Haq killed?", "is_impossible": false}, {"question": "When was the regime in Pakistan accepted by General Zia-ul-Haq?", "is_impossible": true}, {"question": "What had Bhutto planned on approving within six months, before he was overthrown?", "is_impossible": true}, {"question": " What was Zia-ul-Haq's non-official state ideology?", "is_impossible": true}, {"question": " What was Zia-ul-Haq supported for using Islamization to legitimize?", "is_impossible": true}, {"question": "When was Zia-ul-Haq born?", "is_impossible": true}]}, {"id": "31_34", "context": "\"The Islamic State\", formerly known as the \"Islamic State of Iraq and the Levant\" and before that as the \"Islamic State of Iraq\", (and called the acronym Daesh by its many detractors), is a Wahhabi/Salafi jihadist extremist militant group which is led by and mainly composed of Sunni Arabs from Iraq and Syria. In 2014, the group proclaimed itself a caliphate, with religious, political and military authority over all Muslims worldwide. As of March 2015[update], it had control over territory occupied by ten million people in Iraq and Syria, and has nominal control over small areas of Libya, Nigeria and Afghanistan. (While a self-described state, it lacks international recognition.) The group also operates or has affiliates in other parts of the world, including North Africa and South Asia.", "questions": [{"question": "What type of group is The Islamic State?", "is_impossible": false}, {"question": "Who leads The Islamic State?", "is_impossible": false}, {"question": "What did the Islamic State proclaim itself in 2014?", "is_impossible": false}, {"question": "How many people did the Islamic State control the territory of as of March 2015?", "is_impossible": false}, {"question": "What does the Islamic State lack from the international community?", "is_impossible": false}, {"question": "What type of group is The non-Islamic State?", "is_impossible": true}, {"question": " Who refuses to lead The Islamic State?", "is_impossible": true}, {"question": " What did the Islamic State proclaim itself in 2015?", "is_impossible": true}, {"question": "How many people did the Islamic State control the territory of as of February 2015?", "is_impossible": true}, {"question": "What does the Islamic State have a surplus of from the international community?", "is_impossible": true}]}, {"id": "31_35", "context": "Originating as the Jama'at al-Tawhid wal-Jihad in 1999, it pledged allegiance to al-Qaeda in 2004, participated in the Iraqi insurgency that followed the March 2003 invasion of Iraq by Western forces, joined the fight in the Syrian Civil War beginning in March 2011, and was expelled from al-Qaeda in early 2014, (which complained of its failure to consult and \"notorious intransigence\"). The group gained prominence after it drove Iraqi government forces out of key cities in western Iraq in a 2014 offensive. The group is adept at social media, posting Internet videos of beheadings of soldiers, civilians, journalists and aid workers, and is known for its destruction of cultural heritage sites. The United Nations has held ISIL responsible for human rights abuses and war crimes, and Amnesty International has reported ethnic cleansing by the group on a \"historic scale\". The group has been designated a terrorist organisation by the United Nations, the European Union and member states, the United States, India, Indonesia, Turkey, Saudi Arabia, Syria and other countries.", "questions": [{"question": "When did ISIL pledge allegiance to al-Qaeda?", "is_impossible": false}, {"question": "When did Western forces invade Iraq?", "is_impossible": false}, {"question": "When did the Syrian Civil War begin?", "is_impossible": false}, {"question": "Why did al-Qaeda tell ISIL to take a hike?", "is_impossible": false}, {"question": "What has the United Nations designed ISIL?", "is_impossible": false}, {"question": "When did ISIL refuse to pledge allegiance to al-Qaeda?", "is_impossible": true}, {"question": " When did Eastern forces invade Iraq?", "is_impossible": true}, {"question": " When did the Syrian Civil War end?", "is_impossible": true}, {"question": " What has the United Nations not claimed ISIL to be?", "is_impossible": true}]}, {"id": "31_36", "context": "In its focus on the Caliphate, the party takes a different view of Muslim history than some other Islamists such as Muhammad Qutb. HT sees Islam's pivotal turning point as occurring not with the death of Ali, or one of the other four rightly guided Caliphs in the 7th century, but with the abolition of the Ottoman Caliphate in 1924. This is believed to have ended the true Islamic system, something for which it blames \"the disbelieving (Kafir) colonial powers\" working through Turkish modernist Mustafa Kemal Atatürk.", "questions": [{"question": "What's the party's take on Muslim history?", "is_impossible": false}, {"question": "When did the four rightly guided Caliphs die?", "is_impossible": false}, {"question": "When was the Ottoman Caliphate abolished?", "is_impossible": false}, {"question": "The abolition of the Ottoman Caliphate is believed to have ended what system?", "is_impossible": false}, {"question": "What are colonial powers blamed for?", "is_impossible": false}, {"question": "What's the party's take on Muslim present?", "is_impossible": true}, {"question": " When did the five rightly guided Caliphs die?", "is_impossible": true}, {"question": " When was the Ottoman Caliphate maintained?", "is_impossible": true}, {"question": "The abolition of the Ottoman Caliphate is believed to have started what system?", "is_impossible": true}, {"question": " What are colonial powers praised for?", "is_impossible": true}]}, {"id": "31_37", "context": "HT does not engage in armed jihad or work for a democratic system, but works to take power through \"ideological struggle\" to change Muslim public opinion, and in particular through elites who will \"facilitate\" a \"change of the government,\" i.e., launch a \"bloodless\" coup. It allegedly attempted and failed such coups in 1968 and 1969 in Jordan, and in 1974 in Egypt, and is now banned in both countries. But many HT members have gone on to join terrorist groups and many jihadi terrorists have cited HT as their key influence.", "questions": [{"question": "What type of jihad does HT avoid engaging in?", "is_impossible": false}, {"question": "How does HT strive to amass power?", "is_impossible": false}, {"question": "Who specifically does HT target to change the opinion of?", "is_impossible": false}, {"question": "Where did HT fail to pull off a bloodless coup in 1974?", "is_impossible": false}, {"question": "What have many HT members graduated to joining?", "is_impossible": false}, {"question": "What type of jihad does HT prefer to engage in?", "is_impossible": true}, {"question": "How does HT strive to give up power?", "is_impossible": true}, {"question": "Who specifically does HT target to maintain the opinion of?", "is_impossible": true}, {"question": " Where did HT succeed in pulling off a bloodless coup in 1974?", "is_impossible": true}, {"question": " What have many HT members failed to to join?", "is_impossible": true}]}, {"id": "31_38", "context": "Greater London has over 900,000 Muslims, (most of South Asian origins and concentrated in the East London boroughs of Newham, Tower Hamlets and Waltham Forest), and among them are some with a strong Islamist outlook. Their presence, combined with a perceived British policy of allowing them free rein, heightened by exposés such as the 2007 Channel 4 documentary programme Undercover Mosque, has given rise to the term Londonistan. Following the 9/11 attacks, however, Abu Hamza al-Masri, the imam of the Finsbury Park Mosque, was arrested and charged with incitement to terrorism which has caused many Islamists to leave the UK to avoid internment.[citation needed]", "questions": [{"question": "How many Muslims are in Greater London?", "is_impossible": false}, {"question": "What type of outlook do some of the Muslims in London have?", "is_impossible": false}, {"question": "When did the Channel 4 documentary Undercover Mosque air?", "is_impossible": false}, {"question": "The perceived British policy of being hands off of its Muslim population has resulted in what derogatory term for London?", "is_impossible": false}, {"question": "What was Abu Hamaz al-Masri charged with when he was arrested?", "is_impossible": false}, {"question": "How many non-Muslims are in Greater London?", "is_impossible": true}, {"question": " What type of outlook do some of the non-Muslims in London have?", "is_impossible": true}, {"question": " When did the Channel 8 documentary Undercover Mosque air?", "is_impossible": true}, {"question": "The perceived British policy of being hands off of its Muslim population has resulted in what derogatory term for France?", "is_impossible": true}, {"question": "What was Abu Hamaz al-Masri charged with when he was freed?", "is_impossible": true}]}, {"id": "31_39", "context": "The U.S. government has engaged in efforts to counter Islamism, or violent Islamism, since 2001. These efforts were centred in the U.S. around public diplomacy programmes conducted by the State Department. There have been calls to create an independent agency in the U.S. with a specific mission of undermining Islamism and jihadism. Christian Whiton, an official in the George W. Bush administration, called for a new agency focused on the nonviolent practice of \"political warfare\" aimed at undermining the ideology. U.S. Defense Secretary Robert Gates called for establishing something similar to the defunct U.S. Information Agency, which was charged with undermining the communist ideology during the Cold War.", "questions": [{"question": "How long as the U.S. government been actively engaged in efforts to counter Islamism?", "is_impossible": false}, {"question": "What department in the U.S. spearheaded the efforts against Islamism? ", "is_impossible": false}, {"question": "Who called for an agency to be created to be solely focused at undermining the Islamism ideology?", "is_impossible": false}, {"question": "What position in the government does Robert Gates hold?", "is_impossible": false}, {"question": "What was the U.S. Information Agency charged with doing during the Cold War?", "is_impossible": false}, {"question": "How long as the Canadian government been actively engaged in efforts to counter Islamism?", "is_impossible": true}, {"question": "What department in the U.S. spearheaded the efforts to support Islamism?", "is_impossible": true}, {"question": " Who called for an agency to be destroyed for undermining the Islamism ideology?", "is_impossible": true}, {"question": " What position in the government was Robert Gates fired from?", "is_impossible": true}, {"question": " What was the U.S. Information Agency charged with doing during the Warm War?", "is_impossible": true}]}]}
