{"data": [{"id": "39_1", "context": "The Intergovernmental Panel on Climate Change (IPCC) is a scientific intergovernmental body under the auspices of the United Nations, set up at the request of member governments. It was first established in 1988 by two United Nations organizations, the World Meteorological Organization (WMO) and the United Nations Environment Programme (UNEP), and later endorsed by the United Nations General Assembly through Resolution 43/53. Membership of the IPCC is open to all members of the WMO and UNEP. The IPCC produces reports that support the United Nations Framework Convention on Climate Change (UNFCCC), which is the main international treaty on climate change. The ultimate objective of the UNFCCC is to \"stabilize greenhouse gas concentrations in the atmosphere at a level that would prevent dangerous anthropogenic [i.e., human-induced] interference with the climate system\". IPCC reports cover \"the scientific, technical and socio-economic information relevant to understanding the scientific basis of risk of human-induced climate change, its potential impacts and options for adaptation and mitigation.\"", "questions": ["What organization is the IPCC a part of?", "What UN organizations established the IPCC?", "What does the UN want to stabilize?", "What is the UN's climate change treaty?", "What UN resolution endorsed the IPCC?"]}, {"id": "39_2", "context": "Korean economist Hoesung Lee is the chair of the IPCC since October 8, 2015, following the election of the new IPCC Bureau. Before this election, the IPCC was led by his vice-Chair Ismail El Gizouli, who was designated acting Chair after the resignation of Rajendra K. Pachauri in February 2015. The previous chairs were Rajendra K. Pachauri, elected in May 2002; Robert Watson in 1997; and Bert Bolin in 1988. The chair is assisted by an elected bureau including vice-chairs, working group co-chairs, and a secretariat.", "questions": ["Who is the chair of the IPCC?", "What nationality is Hoesung Lee?", "Who is the vice-chair of the IPCC?", "Who was the first chair of the IPCC?", "When did Pachauri resign as chair of the IPCC?"]}, {"id": "39_3", "context": "The IPCC Panel is composed of representatives appointed by governments and organizations. Participation of delegates with appropriate expertise is encouraged. Plenary sessions of the IPCC and IPCC Working groups are held at the level of government representatives. Non Governmental and Intergovernmental Organizations may be allowed to attend as observers. Sessions of the IPCC Bureau, workshops, expert and lead authors meetings are by invitation only. Attendance at the 2003 meeting included 350 government officials and climate change experts. After the opening ceremonies, closed plenary sessions were held. The meeting report states there were 322 persons in attendance at Sessions with about seven-eighths of participants being from governmental organizations.", "questions": ["Who is on the IPCC Panel?", "How many people attended the 2003 IPCC meeting?", "What kind of people attend the IPCC meetings?", "How much of the IPCC attendees are government representatives?"]}, {"id": "39_4", "context": "The IPCC receives funding through the IPCC Trust Fund, established in 1989 by the United Nations Environment Programme (UNEP) and the World Meteorological Organization (WMO), Costs of the Secretary and of housing the secretariat are provided by the WMO, while UNEP meets the cost of the Depute Secretary. Annual cash contributions to the Trust Fund are made by the WMO, by UNEP, and by IPCC Members; the scale of payments is determined by the IPCC Panel, which is also responsible for considering and adopting by consensus the annual budget. The organisation is required to comply with the Financial Regulations and Rules of the WMO.", "questions": ["When was the IPCC Trust Fund founded?", "Who started the IPCC Trust Fund?", "Who funds the IPCC's Deputy Secretary?", "What rules does the IPCC have to follow?", "Who funds the IPCC's Secretary?"]}, {"id": "39_5", "context": "The IPCC does not carry out research nor does it monitor climate related data. Lead authors of IPCC reports assess the available information about climate change based on published sources. According to IPCC guidelines, authors should give priority to peer-reviewed sources. Authors may refer to non-peer-reviewed sources (the \"grey literature\"), provided that they are of sufficient quality. Examples of non-peer-reviewed sources include model results, reports from government agencies and non-governmental organizations, and industry journals. Each subsequent IPCC report notes areas where the science has improved since the previous report and also notes areas where further research is required.", "questions": ["What does the IPCC not do?", "Where do IPCC reports get their information?", "What is 'grey literature'?", "What kind of non-peer-reviewed sources does the IPCC use?"]}, {"id": "39_6", "context": "Each chapter has a number of authors who are responsible for writing and editing the material. A chapter typically has two \"coordinating lead authors\", ten to fifteen \"lead authors\", and a somewhat larger number of \"contributing authors\". The coordinating lead authors are responsible for assembling the contributions of the other authors, ensuring that they meet stylistic and formatting requirements, and reporting to the Working Group chairs. Lead authors are responsible for writing sections of chapters. Contributing authors prepare text, graphs or data for inclusion by the lead authors.", "questions": ["How many coordinating lead authors does an IPCC report chapter have?", "How many lead authors does an IPCC report chapter have?", "How many contributing authors does an IPCC report chapter have?", "Who assembles the authors' contributions?", "Who do coordinating lead authors report to?"]}, {"id": "39_7", "context": "The executive summary of the WG I Summary for Policymakers report says they are certain that emissions resulting from human activities are substantially increasing the atmospheric concentrations of the greenhouse gases, resulting on average in an additional warming of the Earth's surface. They calculate with confidence that CO2 has been responsible for over half the enhanced greenhouse effect. They predict that under a \"business as usual\" (BAU) scenario, global mean temperature will increase by about 0.3 °C per decade during the [21st] century. They judge that global mean surface air temperature has increased by 0.3 to 0.6 °C over the last 100 years, broadly consistent with prediction of climate models, but also of the same magnitude as natural climate variability. The unequivocal detection of the enhanced greenhouse effect is not likely for a decade or more.", "questions": ["What does the WG I Summary for Policymakers report say human activities are doing to greenhouse gases?", "What do increased greenhouse gases cause?", "How much of the greenhouse effect is due to carbon dioxide?", "What is the scenario called in which we don't change our greenhouse gas creation practices?", "How much has global mean surface air temperature changed in the last century?"]}, {"id": "39_8", "context": "In 2001, 16 national science academies issued a joint statement on climate change. The joint statement was made by the Australian Academy of Science, the Royal Flemish Academy of Belgium for Science and the Arts, the Brazilian Academy of Sciences, the Royal Society of Canada, the Caribbean Academy of Sciences, the Chinese Academy of Sciences, the French Academy of Sciences, the German Academy of Natural Scientists Leopoldina, the Indian National Science Academy, the Indonesian Academy of Sciences, the Royal Irish Academy, Accademia Nazionale dei Lincei (Italy), the Academy of Sciences Malaysia, the Academy Council of the Royal Society of New Zealand, the Royal Swedish Academy of Sciences, and the Royal Society (UK). The statement, also published as an editorial in the journal Science, stated \"we support the [TAR's] conclusion that it is at least 90% certain that temperatures will continue to rise, with average global surface temperature projected to increase by between 1.4 and 5.8 °C above 1990 levels by 2100\". The TAR has also been endorsed by the Canadian Foundation for Climate and Atmospheric Sciences, Canadian Meteorological and Oceanographic Society, and European Geosciences Union (refer to \"Endorsements of the IPCC\").", "questions": ["When was the joint statement on climate change issued?", "How many organizations issued the joint statement on climate change?", "Which journal was the joint statement published in?", "How sure did the statement say scientists were that temperatures would keep rising?", "How much did the statement predict global surface temperature would increase by 2100?"]}, {"id": "39_9", "context": "IPCC author Richard Lindzen has made a number of criticisms of the TAR. Among his criticisms, Lindzen has stated that the WGI Summary for Policymakers (SPM) does not faithfully summarize the full WGI report. For example, Lindzen states that the SPM understates the uncertainty associated with climate models. John Houghton, who was a co-chair of TAR WGI, has responded to Lindzen's criticisms of the SPM. Houghton has stressed that the SPM is agreed upon by delegates from many of the world's governments, and that any changes to the SPM must be supported by scientific evidence.", "questions": ["Which IPCC author criticized the TAR?", "What did Lindzen criticize about the Summary for Policymakers?", "Who responded to Lindzen's criticisms?", "What was Houghton's role?", "What did Houghton say is necessary for any changes to the SPM?"]}, {"id": "39_10", "context": "In addition to climate assessment reports, the IPCC is publishing Special Reports on specific topics. The preparation and approval process for all IPCC Special Reports follows the same procedures as for IPCC Assessment Reports. In the year 2011 two IPCC Special Report were finalized, the Special Report on Renewable Energy Sources and Climate Change Mitigation (SRREN) and the Special Report on Managing Risks of Extreme Events and Disasters to Advance Climate Change Adaptation (SREX). Both Special Reports were requested by governments.", "questions": ["How does the IPCC prepare Special Reports?", "When was the Special Report on Renewable Energy Sources and Climate Change Mitigation (SRREN) issued?", "When was the Special Report on Managing Risks of Extreme Events and Disasters to Advance Climate Change Adaptation (SREX) issued?", "Why were the 2011 Special Reports issued?"]}, {"id": "39_11", "context": "The IPCC concentrates its activities on the tasks allotted to it by the relevant WMO Executive Council and UNEP Governing Council resolutions and decisions as well as on actions in support of the UNFCCC process. While the preparation of the assessment reports is a major IPCC function, it also supports other activities, such as the Data Distribution Centre and the National Greenhouse Gas Inventories Programme, required under the UNFCCC. This involves publishing default emission factors, which are factors used to derive emissions estimates based on the levels of fuel consumption, industrial production and so on.", "questions": ["What other activities does the UNFCCC require the IPCC to run?", "What is used to estimate emissions?", "Levels of what things are used to determine emission factors?", "What councils assign tasks to the IPCC?"]}, {"id": "39_12", "context": "This projection was not included in the final summary for policymakers. The IPCC has since acknowledged that the date is incorrect, while reaffirming that the conclusion in the final summary was robust. They expressed regret for \"the poor application of well-established IPCC procedures in this instance\". The date of 2035 has been correctly quoted by the IPCC from the WWF report, which has misquoted its own source, an ICSI report \"Variations of Snow and Ice in the past and at present on a Global and Regional Scale\".", "questions": ["What did the IPCC say was mistaken?", "What did the IPCC apologize for?", "What was the source of the mistake?", "What report had the correct date?"]}, {"id": "39_13", "context": "Former IPCC chairman Robert Watson has said \"The mistakes all appear to have gone in the direction of making it seem like climate change is more serious by overstating the impact. That is worrying. The IPCC needs to look at this trend in the errors and ask why it happened\". Martin Parry, a climate expert who had been co-chair of the IPCC working group II, said that \"What began with a single unfortunate error over Himalayan glaciers has become a clamour without substance\" and the IPCC had investigated the other alleged mistakes, which were \"generally unfounded and also marginal to the assessment\".", "questions": ["What was Robert Watson's role in the IPCC?", "What direction did Watson say the mistake went in?", "What was Martin Parry's role in the IPCC?", "What was the topic of the error?", "What was the verdict on other alleged errors?"]}, {"id": "39_14", "context": "The third assessment report (TAR) prominently featured a graph labeled \"Millennial Northern Hemisphere temperature reconstruction\" based on a 1999 paper by Michael E. Mann, Raymond S. Bradley and Malcolm K. Hughes (MBH99), which has been referred to as the \"hockey stick graph\". This graph extended the similar graph in Figure 3.20 from the IPCC Second Assessment Report of 1995, and differed from a schematic in the first assessment report that lacked temperature units, but appeared to depict larger global temperature variations over the past 1000 years, and higher temperatures during the Medieval Warm Period than the mid 20th century. The schematic was not an actual plot of data, and was based on a diagram of temperatures in central England, with temperatures increased on the basis of documentary evidence of Medieval vineyards in England. Even with this increase, the maximum it showed for the Medieval Warm Period did not reach temperatures recorded in central England in 2007. The MBH99 finding was supported by cited reconstructions by Jones et al. 1998, Pollack, Huang & Shen 1998, Crowley & Lowery 2000 and Briffa 2000, using differing data and methods. The Jones et al. and Briffa reconstructions were overlaid with the MBH99 reconstruction in Figure 2.21 of the IPCC report.", "questions": ["When was the paper published that the \"Millennial Northern Hemisphere temperature reconstruction\" graph was based on?", "Who wrote the paper that the \"Millennial Northern Hemisphere temperature reconstruction\" graph was based on?", "What is the nickname for the \"Millennial Northern Hemisphere temperature reconstruction\" graph?", "What reconstructions supported the 1999 paper's information?"]}, {"id": "39_15", "context": "These studies were widely presented as demonstrating that the current warming period is exceptional in comparison to temperatures between 1000 and 1900, and the MBH99 based graph featured in publicity. Even at the draft stage, this finding was disputed by contrarians: in May 2000 Fred Singer's Science and Environmental Policy Project held a press event on Capitol Hill, Washington, D.C., featuring comments on the graph Wibjörn Karlén and Singer argued against the graph at a United States Senate Committee on Commerce, Science and Transportation hearing on 18 July 2000. Contrarian John Lawrence Daly featured a modified version of the IPCC 1990 schematic, which he mis-identified as appearing in the IPCC 1995 report, and argued that \"Overturning its own previous view in the 1995 report, the IPCC presented the 'Hockey Stick' as the new orthodoxy with hardly an apology or explanation for the abrupt U-turn since its 1995 report\". Criticism of the MBH99 reconstruction in a review paper, which was quickly discredited in the Soon and Baliunas controversy, was picked up by the Bush administration, and a Senate speech by US Republican senator James Inhofe alleged that \"manmade global warming is the greatest hoax ever perpetrated on the American people\". The data and methodology used to produce the \"hockey stick graph\" was criticized in papers by Stephen McIntyre and Ross McKitrick, and in turn the criticisms in these papers were examined by other studies and comprehensively refuted by Wahl & Ammann 2007, which showed errors in the methods used by McIntyre and McKitrick.", "questions": ["What range of years was the current warming compared to?", "Who led the Science and Environmental Policy Project?", "Where did Singer hold a press conference in May 2000?", "When did Singer dispute the graph at a Senate hearing?", "What Senate committee did Singer speak to in July 2000?"]}, {"id": "39_16", "context": "On 23 June 2005, Rep. Joe Barton, chairman of the House Committee on Energy and Commerce wrote joint letters with Ed Whitfield, Chairman of the Subcommittee on Oversight and Investigations demanding full records on climate research, as well as personal information about their finances and careers, from Mann, Bradley and Hughes. Sherwood Boehlert, chairman of the House Science Committee, said this was a \"misguided and illegitimate investigation\" apparently aimed at intimidating scientists, and at his request the U.S. National Academy of Sciences arranged for its National Research Council to set up a special investigation. The National Research Council's report agreed that there were some statistical failings, but these had little effect on the graph, which was generally correct. In a 2006 letter to Nature, Mann, Bradley, and Hughes pointed out that their original article had said that \"more widespread high-resolution data are needed before more confident conclusions can be reached\" and that the uncertainties were \"the point of the article\".", "questions": ["Who was the chairman of the House Committee on Energy and Commerce?", "Who was Chairman of the Subcommittee on Oversight and Investigations?", "When did Barton and Whitfield demand climate research records?", "Who was chairman of the House Science Committee?", "Who said Barton's investigation was \"misguided and illegitimate\"?"]}, {"id": "39_17", "context": "The IPCC Fourth Assessment Report (AR4) published in 2007 featured a graph showing 12 proxy based temperature reconstructions, including the three highlighted in the 2001 Third Assessment Report (TAR); Mann, Bradley & Hughes 1999 as before, Jones et al. 1998 and Briffa 2000 had both been calibrated by newer studies. In addition, analysis of the Medieval Warm Period cited reconstructions by Crowley & Lowery 2000 (as cited in the TAR) and Osborn & Briffa 2006. Ten of these 14 reconstructions covered 1,000 years or longer. Most reconstructions shared some data series, particularly tree ring data, but newer reconstructions used additional data and covered a wider area, using a variety of statistical methods. The section discussed the divergence problem affecting certain tree ring data.", "questions": ["When was the IPCC Third Assessment Report published?", "When was the IPCC Fourth Assessment Report published?", "How many Medieval Warm Period reconstructions covered 1,000+ years?", "What problem did some tree ring data have?", "How many Medieval Warm Period reconstructions were used?"]}, {"id": "39_18", "context": "On 1 February 2007, the eve of the publication of IPCC's major report on climate, a study was published suggesting that temperatures and sea levels have been rising at or above the maximum rates proposed during the last IPCC report in 2001. The study compared IPCC 2001 projections on temperature and sea level change with observations. Over the six years studied, the actual temperature rise was near the top end of the range given by IPCC's 2001 projection, and the actual sea level rise was above the top of the range of the IPCC projection.", "questions": ["When was a study published confirming the 2001 IPCC projections?", "How did the 2001 IPCC report compare to reality for 2001-2006?", "How did the 2001 IPCC report compare to reality on temperature levels?", "How did the 2001 IPCC report compare to reality on sea levels?"]}, {"id": "39_19", "context": "Another example of scientific research which suggests that previous estimates by the IPCC, far from overstating dangers and risks, have actually understated them is a study on projected rises in sea levels. When the researchers' analysis was \"applied to the possible scenarios outlined by the Intergovernmental Panel on Climate Change (IPCC), the researchers found that in 2100 sea levels would be 0.5–1.4 m [50–140 cm] above 1990 levels. These values are much greater than the 9–88 cm as projected by the IPCC itself in its Third Assessment Report, published in 2001\". This may have been due, in part, to the expanding human understanding of climate.", "questions": ["What danger did the IPCC understate?", "How much did the IPCC Third Assessment Report say sea levels will rise from 1990 to 2100?", "How much do researchers now think sea levels will rise from 1990 to 2100?", "When was the Third Assessment Report published?"]}, {"id": "39_20", "context": "Michael Oppenheimer, a long-time participant in the IPCC and coordinating lead author of the Fifth Assessment Report conceded in Science Magazine's State of the Planet 2008-2009 some limitations of the IPCC consensus approach and asks for concurring, smaller assessments of special problems instead of the large scale approach as in the previous IPCC assessment reports. It has become more important to provide a broader exploration of uncertainties. Others see as well mixed blessings of the drive for consensus within the IPCC process and ask to include dissenting or minority positions or to improve statements about uncertainties.", "questions": ["What role did Michael Oppenheimer have in the IPCC's reports?", "Who published the State of the Planet 2008-2009 report?", "What approach did Oppenheimer advocate?"]}, {"id": "39_21", "context": "The IPCC process on climate change and its efficiency and success has been compared with dealings with other environmental challenges (compare Ozone depletion and global warming). In case of the Ozone depletion global regulation based on the Montreal Protocol has been successful, in case of Climate Change, the Kyoto Protocol failed. The Ozone case was used to assess the efficiency of the IPCC process. The lockstep situation of the IPCC is having built a broad science consensus while states and governments still follow different, if not opposing goals. The underlying linear model of policy-making of more knowledge we have, the better the political response will be is being doubted.", "questions": ["What has successfully dealt with ozone depletion?", "What did the Kyoto Protocol try to address?", "Whose goals often still oppose the IPCC?"]}, {"id": "39_22", "context": "According to Sheldon Ungar's comparison with global warming, the actors in the ozone depletion case had a better understanding of scientific ignorance and uncertainties. The ozone case communicated to lay persons \"with easy-to-understand bridging metaphors derived from the popular culture\" and related to \"immediate risks with everyday relevance\", while the public opinion on climate change sees no imminent danger. The stepwise mitigation of the ozone layer challenge was based as well on successfully reducing regional burden sharing conflicts. In case of the IPCC conclusions and the failure of the Kyoto Protocol, varying regional cost-benefit analysis and burden-sharing conflicts with regard to the distribution of emission reductions remain an unsolved problem. In the UK, a report for a House of Lords committee asked to urge the IPCC to involve better assessments of costs and benefits of climate change but the Stern Review ordered by the UK government made a stronger argument in favor to combat human-made climate change.", "questions": ["Who said people involved in the ozone situation had \"a better understanding of scientific ignorance and uncertainties\"?", "What remain unsolved problems with the Kyoto Protocol?", "What conflicts did the ozone mitigation reduce?", "Who ordered the Stern Review?"]}, {"id": "39_23", "context": "Since the IPCC does not carry out its own research, it operates on the basis of scientific papers and independently documented results from other scientific bodies, and its schedule for producing reports requires a deadline for submissions prior to the report's final release. In principle, this means that any significant new evidence or events that change our understanding of climate science between this deadline and publication of an IPCC report cannot be included. In an area of science where our scientific understanding is rapidly changing, this has been raised as a serious shortcoming in a body which is widely regarded as the ultimate authority on the science. However, there has generally been a steady evolution of key findings and levels of scientific confidence from one assessment report to the next.[citation needed]", "questions": ["What does the IPCC rely on for research?", "What can the IPCC's report deadlines cause to be omitted?", "Who is seen as the ultimate climate change authority?"]}, {"id": "39_24", "context": "In February 2010, in response to controversies regarding claims in the Fourth Assessment Report, five climate scientists – all contributing or lead IPCC report authors – wrote in the journal Nature calling for changes to the IPCC. They suggested a range of new organizational options, from tightening the selection of lead authors and contributors, to dumping it in favor of a small permanent body, or even turning the whole climate science assessment process into a moderated \"living\" Wikipedia-IPCC. Other recommendations included that the panel employ a full-time staff and remove government oversight from its processes to avoid political interference.", "questions": ["How many scientists called to change the IPCC in Feb 2010?", "Where was the Feb 2010 call for change published?", "What was one proposal to let the IPCC respond to new evidence faster?", "How was it suggested that the IPCC avoid political problems?"]}]}
