{"data": [{"id": "4_1", "context": "Nikola Tesla (Serbian Cyrillic: Никола Тесла; 10 July 1856 – 7 January 1943) was a Serbian American inventor, electrical engineer, mechanical engineer, physicist, and futurist best known for his contributions to the design of the modern alternating current (AC) electricity supply system.", "questions": ["In what year was Nikola Tesla born? ", "What was Nikola Tesla's ethnicity?", "In what year did Tesla die? ", "When was Nikola Tesla born?", "In what year did Tesla die?", "What is Tesla's home country?", "What does AC stand for?"]}, {"id": "4_2", "context": "Tesla gained experience in telephony and electrical engineering before emigrating to the United States in 1884 to work for Thomas Edison in New York City. He soon struck out on his own with financial backers, setting up laboratories and companies to develop a range of electrical devices. His patented AC induction motor and transformer were licensed by George Westinghouse, who also hired Tesla for a short time as a consultant. His work in the formative years of electric power development was involved in a corporate alternating current/direct current \"War of Currents\" as well as various patent battles.", "questions": ["In what year did Nikola Tesla emigrate to the United States?", "Who did Tesla work for in the 1880s?", "Tesla's induction motor and transformer was licensed by whom?", "In what area of the United States did Tesla move to?", "What \"war\" was Tesla involved in?", "When did Tesla come to the US?", "What other inventor did he work with?", "Where did Tesla work with Edison?", "Who licensed Tesla's induction motor?", "What other invention of Tesla's did Westinghouse license?"]}, {"id": "4_3", "context": "Tesla went on to pursue his ideas of wireless lighting and electricity distribution in his high-voltage, high-frequency power experiments in New York and Colorado Springs, and made early (1893) pronouncements on the possibility of wireless communication with his devices. He tried to put these ideas to practical use in an ill-fated attempt at intercontinental wireless transmission, his unfinished Wardenclyffe Tower project. In his lab he also conducted a range of experiments with mechanical oscillators/generators, electrical discharge tubes, and early X-ray imaging. He also built a wireless controlled boat, one of the first ever exhibited.", "questions": ["When did Tesla discover the possibility of wireless connectivity?", "Were Tesla's experiments high-voltage or low-voltage?", "What were some of Tesla's experiments?", "Other than New York where did Tesla conduct experiments?", "When did he first mention wireless communication?", "What remote control vehicle did he make?", "Where was his unfinished project called?"]}, {"id": "4_4", "context": "Tesla was renowned for his achievements and showmanship, eventually earning him a reputation in popular culture as an archetypal \"mad scientist\". His patents earned him a considerable amount of money, much of which was used to finance his own projects with varying degrees of success.:121,154 He lived most of his life in a series of New York hotels, through his retirement. Tesla died on 7 January 1943. His work fell into relative obscurity after his death, but in 1960 the General Conference on Weights and Measures named the SI unit of magnetic flux density the tesla in his honor. There has been a resurgence in popular interest in Tesla since the 1990s.", "questions": ["What year did Tesla die? ", "What was named \"The Tesla\" in his honor?", "Where did Tesla live for much of his life?", "What was Tesla's reputation in popular culture?", "How did Tesla finance his work?", "What year did Tesla die?", "What did the General Conference on Weights and Measures name after Tesla in 1960?", "When did people once again start to show an interest in Tesla?", "Other than his scientific achievements what was Tesla famous for?"]}, {"id": "4_5", "context": "Tesla was born on 10 July [O.S. 28 June] 1856 into a Serb family in the village of Smiljan, Austrian Empire (modern-day Croatia). His father, Milutin Tesla, was a Serbian Orthodox priest. Tesla's mother, Đuka Tesla (née Mandić), whose father was also an Orthodox priest,:10 had a talent for making home craft tools, mechanical appliances, and the ability to memorize Serbian epic poems. Đuka had never received a formal education. Nikola credited his eidetic memory and creative abilities to his mother's genetics and influence. Tesla's progenitors were from western Serbia, near Montenegro.:12", "questions": ["What modern-day country was Tesla born in?", "What was the occupation of Tesla's father?", "What was special about Tesla's memory?", "Who did Tesla credit for his abilities?", "What was Tesla's fathers occupation?", "What was Tesla's father's name?", "What was Tesla's mother's name?", "What were Tesla's mother's special abilities?", "Where did Tesla believe his talents came from?"]}, {"id": "4_6", "context": "Tesla was the fourth of five children. He had an older brother named Dane and three sisters, Milka, Angelina and Marica. Dane was killed in a horse-riding accident when Nikola was five. In 1861, Tesla attended the \"Lower\" or \"Primary\" School in Smiljan where he studied German, arithmetic, and religion. In 1862, the Tesla family moved to Gospić, Austrian Empire, where Tesla's father worked as a pastor. Nikola completed \"Lower\" or \"Primary\" School, followed by the \"Lower Real Gymnasium\" or \"Normal School.\"", "questions": ["How many siblings did Tesla have?", "What language did Tesla study while in school?", "In what year did Tesla's family move to Gospic?", "What was Tesla's brother's name?", "What were Tesla's sisters' names?", "What happened to Dane?", "Where did the family move in 1862?", "What job did Tesla's father have in Gospic?"]}, {"id": "4_7", "context": "In 1870, Tesla moved to Karlovac, to attend school at the Higher Real Gymnasium, where he was profoundly influenced by a math teacher Martin Sekulić.:32 The classes were held in German, as it was a school within the Austro-Hungarian Military Frontier. Tesla was able to perform integral calculus in his head, which prompted his teachers to believe that he was cheating. He finished a four-year term in three years, graduating in 1873.:33", "questions": ["Who was Tesla influenced by while in school?", "What language were classes held in at Tesla's school?", "What could Tesla perform in his head?", "What did Tesla's teachers believe he was doing while in school?", "In what year did Tesla graduate from the Higher Real Gymnasium?", "When did Tesla go to Karlovac?", "Why did Tesla go to Karlovac?", "Who was Tesla's main influence in Karlovac?", "In what language were the classes given?", "When did Tesla graduate?"]}, {"id": "4_8", "context": "In 1873, Tesla returned to his birthtown, Smiljan. Shortly after he arrived, Tesla contracted cholera; he was bedridden for nine months and was near death multiple times. Tesla's father, in a moment of despair, promised to send him to the best engineering school if he recovered from the illness (his father had originally wanted him to enter the priesthood).", "questions": ["What disease did Tesla contract in 1873?", "How long was he bedridden with cholera?", "What did Tesla's father promise him while he were bedridden?", "What did Tesla's father originally want him to do?", "Where did Tesla return to in 1873?", "What was the year when Tesla went back to Smiljan?", "What disease did Tesla catch?", "How long was he in bed from cholera?", "What was Tesla's father's original plans for Tesla?", "What bargain did his father make with him if Tesla recovered?"]}, {"id": "4_9", "context": "In 1874, Tesla evaded being drafted into the Austro-Hungarian Army in Smiljan by running away to Tomingaj, near Gračac. There, he explored the mountains in hunter's garb. Tesla said that this contact with nature made him stronger, both physically and mentally. He read many books while in Tomingaj, and later said that Mark Twain's works had helped him to miraculously recover from his earlier illness.", "questions": ["Where did Tesla run to avoid the army draft?", "Whose works helped Tesla recover from illness?", "What did Tesla explore in Tominaj?", "What year did Tesla avade the draft? ", "What did Tesla dress in while in Tominaj?", "Why did Tesla avoid by fleeing Smiljan?", "When did Tesla go to Tomingaj?", "What did Tesla do in Tomingaj?", "What author did Tesla credit for his recovery?"]}, {"id": "4_10", "context": "In 1875, Tesla enrolled at Austrian Polytechnic in Graz, Austria, on a Military Frontier scholarship. During his first year, Tesla never missed a lecture, earned the highest grades possible, passed nine exams (nearly twice as many required), started a Serbian culture club, and even received a letter of commendation from the dean of the technical faculty to his father, which stated, \"Your son is a star of first rank.\" Tesla claimed that he worked from 3 a.m. to 11 p.m., no Sundays or holidays excepted. He was \"mortified when [his] father made light of [those] hard won honors.\" After his father's death in 1879, Tesla found a package of letters from his professors to his father, warning that unless he were removed from the school, Tesla would be killed through overwork. During his second year, Tesla came into conflict with Professor Poeschl over the Gramme dynamo, when Tesla suggested that commutators weren't necessary. At the end of his second year, Tesla lost his scholarship and became addicted to gambling. During his third year, Tesla gambled away his allowance and his tuition money, later gambling back his initial losses and returning the balance to his family. Tesla said that he \"conquered [his] passion then and there,\" but later he was known to play billiards in the US. When exam time came, Tesla was unprepared and asked for an extension to study, but was denied. He never graduated from the university and did not receive grades for the last semester.", "questions": ["What year did Tesla enroll at an engineering school?", "What school did he enroll in during 1875?", "In what year did Tesla's father die?", "What did Tesla struggle with while in school? ", "Did Tesla graduate from the university?", "Where was Austrian Polytechnic located?", "When did Tesla enroll in Austrian Polytechnic?", "When did Tesla's father die?", "How did Tesla lose his tuition money?", "What was Tesla's father afraid would happen to him in school?"]}, {"id": "4_11", "context": "In December 1878, Tesla left Graz and severed all relations with his family to hide the fact that he dropped out of school. His friends thought that he had drowned in the Mur River. Tesla went to Maribor (now in Slovenia), where he worked as a draftsman for 60 florins a month. He spent his spare time playing cards with local men on the streets. In March 1879, Milutin Tesla went to Maribor to beg his son to return home, but Nikola refused. Nikola suffered a nervous breakdown at around the same time.", "questions": ["What did Tesla do in December 1878?", "Why did Tesla sever ties with his family?", "What did Tesla work as after dropping out? ", "Before he died, what did Tesla's father ask him to do?", "What health issue did Tesla suffer?", "When did Tesla depart Graz?", "What secret did he sever family ties to keep hidden?", "What was Tesla's friends' theory as to what became of him?", "What did Tesla do in Maribor for work?", "What health problem did Tesla have in 1879?"]}, {"id": "4_12", "context": "On 24 March 1879, Tesla was returned to Gospić under police guard for not having a residence permit. On 17 April 1879, Milutin Tesla died at the age of 60 after contracting an unspecified illness (although some sources say that he died of a stroke). During that year, Tesla taught a large class of students in his old school, Higher Real Gymnasium, in Gospić.", "questions": ["Why was Tesla returned to Gospic?", "When was Tesla returned to Gospic?", "Milutin Tesla died at what age?", "What do some sources say Nikola's brother died from?", "what did tesla do at his old school in 1879?", "Why did the police bring Tesla back to Gospic?", "When was Tesla brought to Gospic?", "Where did Tesla teach in Gospic?", "What was one of theories as to what caused Tesla's father's unspecified illness?"]}, {"id": "4_13", "context": "In January 1880, two of Tesla's uncles put together enough money to help him leave Gospić for Prague where he was to study. Unfortunately, he arrived too late to enroll at Charles-Ferdinand University; he never studied Greek, a required subject; and he was illiterate in Czech, another required subject. Tesla did, however, attend lectures at the university, although, as an auditor, he did not receive grades for the courses.", "questions": ["What city did Tesla move to in 1880?", "Why was he unable to enroll at the university? ", "How did Tesla attend the university?", "Which university did Tesla audit in 1880?", "Where did Tesla go upon leaving Gospic?", "When did Tesla go to Prague?", "Where was Tesla hoping to attend classes in Prague?", "Who gave Tesla money to go to Prague?"]}, {"id": "4_14", "context": "In 1881, Tesla moved to Budapest to work under Ferenc Puskás at a telegraph company, the Budapest Telephone Exchange. Upon arrival, Tesla realized that the company, then under construction, was not functional, so he worked as a draftsman in the Central Telegraph Office instead. Within a few months, the Budapest Telephone Exchange became functional and Tesla was allocated the chief electrician position. During his employment, Tesla made many improvements to the Central Station equipment and claimed to have perfected a telephone repeater or amplifier, which was never patented nor publicly described.", "questions": ["Where did Tesla move in 1881?", "Which company did Tesla work for in 1881?", "What position did Tesla accept at the exchange?", "What did Tesla claim to perfect while at the exchange?", "What position did Tesla hold in the Central Telegraph Office?", "In what year did Tesla go to Budapest?", "Where did Tesla work in Budapest?", "What was the name of the telegraph company Tesla returned to after it became functional?", "What was Tesla's position at the Budapest Telephone Exchange?"]}, {"id": "4_15", "context": "In 1882, Tesla began working for the Continental Edison Company in France, designing and making improvements to electrical equipment. In June 1884, he relocated to New York City:57–60 where he was hired by Thomas Edison to work at his Edison Machine Works on Manhattan's lower east side. Tesla's work for Edison began with simple electrical engineering and quickly progressed to solving more difficult problems.", "questions": ["When did Tesla begin working for the Continental Edison Company?", "Where was the Continental Edison Company located? ", "In June 1884, where did Tesla relocate? ", "Who hired Tesla when he moved to New York?", "Where did Tesla begin working in 1884?", "Where did Tesla begin a new job at in 1882?", "Where was the  Continental Edison Company located?", "When did Tesla move to New York City?", "Who hired Tesla in New York?", "Where was Edison Machine Works located?"]}, {"id": "4_16", "context": "Tesla was offered the task of completely redesigning the Edison Company's direct current generators. In 1885, he said that he could redesign Edison's inefficient motor and generators, making an improvement in both service and economy. According to Tesla, Edison remarked, \"There's fifty thousand dollars in it for you—if you can do it.\":54–57 :64 This has been noted as an odd statement from an Edison whose company was stingy with pay and who did not have that sort of cash on hand. After months of work, Tesla fulfilled the task and inquired about payment. Edison, saying that he was only joking, replied, \"Tesla, you don't understand our American humor.\":64  Instead, Edison offered a US$10 a week raise over Tesla's US$18 per week salary; Tesla refused the offer and immediately resigned.", "questions": ["How much did Edison offer Tesla to redesign a motor and generators?", "What did Edison offer Tesla after completing the project?", "how long did Tesla spend redesigning the motor and generators?", "How much did Tesla say Edison offered him to redesign his motor and generators?", "What was Edison's reply as to what Tesla didn't understand when Tesla asked for payment?", "What alternate payment did Edison offer Tesla?"]}, {"id": "4_17", "context": "After leaving Edison's company Tesla partnered with two businessmen in 1886, Robert Lane and Benjamin Vail, who agreed to finance an electric lighting company in Tesla's name, Tesla Electric Light & Manufacturing. The company installed electrical arc light based illumination systems designed by Tesla and also had designs for dynamo electric machine commutators, the first patents issued to Tesla in the US.", "questions": ["Who did Tesla partner with in 1886?", "What did lane and vail finance?", "What did Tesla Electric Light & Manufacturing do?", "What did Tesla first receive after starting his company?", "What was produced at tesla's company? ", "What were the names of Tesla's new partners?", "When did the partnership between Tesla, Lane and Vail form?", "What was the name of the company the businessmen financed? ", "What did Tesla Electric Light & Manufacturing do?", "Who designed the illumination systems that Tesla Electric Light & Manufacturing installed?"]}, {"id": "4_18", "context": "The investors showed little interest in Tesla's ideas for new types of motors and electrical transmission equipment and also seemed to think it was better to develop an electrical utility than invent new systems. They eventually forced Tesla out leaving him penniless. He even lost control of the patents he had generated since he had assigned them to the company in lieu of stock. He had to work at various electrical repair jobs and even as a ditch digger for $2 per day. Tesla considered the winter of 1886/1887 as a time of \"terrible headaches and bitter tears.\" During this time, he questioned the value of his education.", "questions": ["What did Tesla's investors do to him?", "what was Tesla's financial situation after being forced out?", "what did he do for $2 a day?", "which years did tesla refer to as a time of terrible headaches and bitter tears?", "What did Tesla do with his patents causing him to lose them?", "What did Tesla do for a job that paid two dollars a day?", "What else did Tesla do for work at this time?"]}, {"id": "4_19", "context": "In late 1886 Tesla met Alfred S. Brown, a Western Union superintendent, and New York attorney Charles F. Peck. The two men were experienced in setting up companies and promoting inventions and patents for financial gain. Based on Tesla's patents and other ideas they agreed to back him financially and handle his patents. Together in April 1887 they formed the Tesla Electric Company with an agreement that profits from generated patents would go ⅓ to Tesla, ⅓ to Peck and Brown, and ⅓ to fund development. They set up a laboratory for Tesla at 89 Liberty Street in Manhattan where he worked on improving and developing new types of electric motors, generators and other devices.", "questions": ["Who was Alfred S brown?", "When was Tesla Electric Company formed?", "Where would profits go in this new company?", "Where was a lab for Tesla set up?", "When did Tesla first encounter Alfred S. Brown", "What was Brown's job?", "Who else did Tesla make the acquaintance of in 1886?", "Where was Tesla's new lab?", "What was Tesla, Brown and Peck's new company?"]}, {"id": "4_20", "context": "One of the things Tesla developed at that laboratory in 1887 was an induction motor that ran on alternating current, a power system format that was starting to be built in Europe and the United States because of its advantages in long-distance, high-voltage transmission. The motor used polyphase current which generated a rotating magnetic field to turn the motor (a principle Tesla claimed to have conceived in 1882). This innovative electric motor, patented in May 1888, was a simple self-starting design that did not need a commutator, thus avoiding sparking and the high maintenance of constantly servicing and replacing mechanical brushes.", "questions": ["What did Tesla develop in 1887?", "When was Tesla's innovative motor patented? ", "What did Tesla's design not need? ", "What did his design avoid in not having a commutator?", "what sort of design was this motor?", "When did Tesla make the induction motor?", "Why was AC electricity gaining popularity?", "What high maintenance part did Tesla's AC motor not require?", "When did Tesla patent the motor?"]}, {"id": "4_21", "context": "In 1888, the editor of Electrical World magazine, Thomas Commerford Martin (a friend and publicist), arranged for Tesla to demonstrate his alternating current system, including his induction motor, at the American Institute of Electrical Engineers (now IEEE). Engineers working for the Westinghouse Electric & Manufacturing Company reported to George Westinghouse that Tesla had a viable AC motor and related power system — something for which Westinghouse had been trying to secure patents. Westinghouse looked into getting a patent on a similar commutator-less, rotating magnetic field-based induction motor presented in a paper in March 1888 by the Italian physicist Galileo Ferraris, but decided Tesla's patent would probably control the market.", "questions": ["Who was Thomas Commerford Martin?", "What is the IEEE?", "In what year did Tesla demonstrate his alternating current system?", "Why did Westinghouse not secure a patent for a similar motor?", "Who arranged for Tesla to demonstrate his system at the IEEE?", "Who edited Electrical World magazine?", "Who wanted to acquire patents an AC motor.", "Who other than Tesla did Westinghouse consider for the patents?", "What was Galileo Ferraris?", "What was the name of Westinghouse's company?"]}, {"id": "4_22", "context": "In July 1888, Brown and Peck negotiated a licensing deal with George Westinghouse for Tesla's polyphase induction motor and transformer designs for $60,000 in cash and stock and a royalty of $2.50 per AC horsepower produced by each motor. Westinghouse also hired Tesla for one year for the large fee of $2,000 ($52,700 in today's dollars) per month to be a consultant at the Westinghouse Electric & Manufacturing Company's Pittsburgh labs.", "questions": ["In what year were Tesla's motor and transformer designs licensed to Westinghouse?", "How much did Westinghouse pay to license Tesla's designs?", "Who hired Tesla in 1888?", "What was Tesla's position with Westinghouse?", "How much did Westinghouse pay for Tesla's designs?", "When did the deal between Peck, Brown and Westinghouse take place?", "What was Tesla's monthly consultant salary?", "In which city was Tesla's consultant job for Westinghouse?"]}, {"id": "4_23", "context": "During that year, Tesla worked in Pittsburgh, helping to create an alternating current system to power the city's streetcars. He found the time there frustrating because of conflicts between him and the other Westinghouse engineers over how best to implement AC power. Between them, they settled on a 60-cycle AC current system Tesla proposed (to match the working frequency of Tesla's motor), although they soon found that, since Tesla's induction motor could only run at a constant speed, it would not work for street cars. They ended up using a DC traction motor instead.", "questions": ["Where did Tesla work in 1888?", "What did Tesla work on in 1888?", "What cycle AC current system did Tesla propose?", "What motor did they end up using instead of the one Tesla wanted? ", "What was Tesla's AC system used for in Pittsburgh?", "What ended up being used for the streetcars in the place of Tesla's system?"]}, {"id": "4_24", "context": "Tesla's demonstration of his induction motor and Westinghouse's subsequent licensing of the patent, both in 1888, put Tesla firmly on the \"AC\" side of the so-called \"War of Currents,\" an electrical distribution battle being waged between Thomas Edison and George Westinghouse that had been simmering since Westinghouse's first AC system in 1886 and had reached the point of all-out warfare by 1888. This started out as a competition between rival lighting systems with Edison holding all the patents for DC and the incandescent light and Westinghouse using his own patented AC system to power arc lights as well as incandescent lamps of a slightly different design to get around the Edison patent. The acquisition of a feasible AC motor gave Westinghouse a key patent in building a completely integrated AC system, but the financial strain of buying up patents and hiring the engineers needed to build it meant development of Tesla's motor had to be put on hold for a while. The competition resulted in Edison Machine Works pursuing AC development in 1890 and by 1892 Thomas Edison was no longer in control of his own company, which was consolidated into the conglomerate General Electric and converting to an AC delivery system at that point.", "questions": ["Who was the War of Currents waged between? ", "What did the war first start out as being between?", "What did Edison Machine Works persue in 1890?", "What company took over Edison Machine Works?", "Which current type was Tesla in favor of?", "Who was Westinghouse's chief rival?", "When did the rivalry between Westinghouse and Edison reach its peak?", "What caused the delay during the development of the AC motor.", "Who took control of Edison's company."]}, {"id": "4_25", "context": "In 1893, George Westinghouse won the bid to light the 1893 World's Columbian Exposition in Chicago with alternating current, beating out a General Electric bid by one million dollars. This World's Fair devoted a building to electrical exhibits. It was a key event in the history of AC power, as Westinghouse demonstrated the safety, reliability, and efficiency of a fully integrated alternating current system to the American public. At the Columbian Exposition, under a banner announcing the \"Tesla Polyphase System\", Tesla demonstrated a series of electrical effects previously performed throughout America and Europe,:76 included using high-voltage, high-frequency alternating current to light a wireless gas-discharge lamp.:79 An observer noted:", "questions": ["In 1893, who won the bid to light the World's Columbian Exposition?", "Where was the 1893 World's Columbian Exposition held?", "Who did George Westinghouse beat out to light the World's Columbian Exposition?", "What did Tesla call his electrical effects in 1893?", "What was it called when Tesla lit a wireless gas-discharge lamp using a high-frequency, high-voltage alternating current?", "Who outbid General Electric to provide light to the World's Columbian Exposition?", "Where did the Exposition take place?", "In what year was the World's Columbian Exposition?", "What type of power was displayed at the World's fair by Westinghouse and Tesla?"]}, {"id": "4_26", "context": "In 1893 Richard Dean Adams, who headed up the Niagara Falls Cataract Construction Company sought Tesla's opinion on what system would be best to transmit power generated at the falls. Over several years there had been a series of proposals and open competitions on how best to utilize power generated by the falls with many systems being proposed by several US and European companies including two-phase and three-phase AC, high-voltage DC, and even compressed air. Adams pumped Tesla for information about the current state of all the competing systems. Tesla advised Adams that a two-phased system would be the most reliable and that there was a Westinghouse system to light incandescent bulbs using two-phase alternating current. Based on Tesla's advice and Westinghouse's demonstration that they could build a complete AC system at the Columbian Exposition, a contract for building a two-phase AC generating system at the Niagara Falls was awarded to Westinghouse Electric. A further contract to build the AC distribution system was awarded to General Electric.", "questions": ["Who headed the Niagara Falls Cataract Construction Company in 1893?", "What landmark was Tesla asked about in regards to electricity in 1893?", "What company was chosen to build a two-phase AC generating system at Niagara Falls?", "What company was chosen to build an AC distribution system at Niagara Falls?", "What system did Tesla recommend to Niagara Falls in 1893?", "Who was the head of the company?", "When did Richard Dean Adams make his inquiry?", "What type of system did Tesla suggest to Adams?", "What was the advantage of the two-phased system "]}, {"id": "4_27", "context": "The mid 1890s saw the conglomerate General Electric, backed by financier J. P. Morgan, involved in takeover attempts and patent battles with Westinghouse Electric. Although a patent-sharing agreement was signed between the two companies in 1896 Westinghouse was still cash-strapped from the financial warfare. To secure further loans, Westinghouse was forced to revisit Tesla's AC patent, which bankers considered a financial strain on the company (at that point Westinghouse had paid out an estimated $200,000 in licenses and royalties to Tesla, Brown, and Peck). In 1897, Westinghouse explained his financial difficulties to Tesla in stark terms, saying that if things continue the way they were he would no longer be in control of Westinghouse Electric and Tesla would have to \"deal with the bankers\" to try to collect future royalties. Westinghouse convinced Tesla to release his company from the licensing agreement over Tesla's AC patents in exchange for Westinghouse Electric purchasing the patents for a lump sum payment of $216,000; this provided Westinghouse a break from what, due to alternating current's rapid gain in popularity, had turned out to be an overly generous $2.50 per AC horsepower royalty.", "questions": ["When was a patent-sharing agreement signed between Westinghouse Electric and General Electric?", "How much did Tesla sell his AC patents to Westinghouse Electric for?", "What was the overly generous royalty amount that Tesla had been receiving? ", "By 1897, how much had Tesla, Brown, and Peck received in royalties and licenses over the patents?", "Who financed General Electric's attempts to takeover Westinghouse?", "How much had Westinghouse paid to Tesla, Brown and Peck?", "How much did Westinghouse pay for Tesla's patents in order to escape its financial problems?"]}, {"id": "4_28", "context": "On 30 July 1891, at the age of 35, Tesla became a naturalized citizen of the United States, and established his South Fifth Avenue laboratory, and later another at 46 E. Houston Street, in New York. He lit electric lamps wirelessly at both locations, demonstrating the potential of wireless power transmission. In the same year, he patented the Tesla coil.", "questions": ["How old was tesla when he became a US citizen?", "Where was Tesla's laboratory established?", "What did he light at his laboratories to demonstrate his wireless power transmission?", "what did he patent in 1891? ", "When did Tesla get his US citizenship?", "What did Tesla patent in 1891?", "How old was Tesla when he became a citizen of the US?", "What sort of power transmission did Tesla show off at his labs?"]}, {"id": "4_29", "context": "Tesla served as a vice president of the American Institute of Electrical Engineers, the forerunner (along with the Institute of Radio Engineers) of the modern-day IEEE, from 1892 to 1894.", "questions": ["What organization did Tesla serve as vice president of? ", "What was the forerunner of the modern-day IEEE?", "When did Tesla stop serving as the vice president of American Institute of Electrical Engineers?", "What position did Tesla hold in the American Institute of Electrical Engineers?", "How long did Tesla hold this position?", "Along with the American Institute of Electrical Engineers what other institute eventually became the IEEE?"]}, {"id": "4_30", "context": "Starting in 1894, Tesla began investigating what he referred to as radiant energy of \"invisible\" kinds after he had noticed damaged film in his laboratory in previous experiments (later identified as \"Roentgen rays\" or \"X-Rays\"). His early experiments were with Crookes tubes, a cold cathode electrical discharge tube. Soon after, much of Tesla's early research—hundreds of invention models, plans, notes, laboratory data, tools, photographs, valued at $50,000—was lost in the 5th Avenue laboratory fire of March 1895. Tesla is quoted by The New York Times as saying, \"I am in too much grief to talk. What can I say?\" Tesla may have inadvertently captured an X-ray image—predating, by a few weeks, Wilhelm Röntgen's December 1895 announcement of the discovery of x-rays—when he tried to photograph Mark Twain illuminated by a Geissler tube, an earlier type of gas discharge tube. The only thing captured in the image was the metal locking screw on the camera lens.:134", "questions": ["Why did Tesla begin investigating invisible energy?", "What took place in his lab in 1895, causing him to lose thousands of dollars of data and tools? ", "When were x-rays discovered? ", "When Tesla attempted to photograph Mark Twain, what was the only thing that showed up on the image?", "When die Tesla turn his attention to trying to understand invisible radiant energy?", "What is this invisible radiant energy now known as?", "What happened to most of Tesla's work from this time?", "What type of image was Tesla thought to have accidentally taken a week prior to the announcement of its discovery?", "Who was Tesla trying to photograph when he accidentally took the X-Ray image?"]}, {"id": "4_31", "context": "In March 1896, after hearing of Wilhelm Röntgen's discovery of X-ray and X-ray imaging (radiography), Tesla proceeded to do his own experiments in X-ray imaging, developing a high energy single terminal vacuum tube of his own design that had no target electrode and that worked from the output of the Tesla Coil (the modern term for the phenomenon produced by this device is bremsstrahlung or braking radiation). In his research, Tesla devised several experimental setups to produce X-rays. Tesla held that, with his circuits, the \"instrument will ... enable one to generate Roentgen rays of much greater power than obtainable with ordinary apparatus.\"", "questions": ["What did Tesla begin to research in March 1896?", "when did tesla begin researching x-ray imaging?", "What is another term for x-ray imaging?", "What did Tesla design several experimental setups to produce? ", "What did Tesla's device work from the output of?", "When did Tesla start deliberately experimenting with X-ray imaging?", "What powered Tesla's high energy terminal vacuum tube?", "What were X-rays known as at the time?"]}, {"id": "4_32", "context": "Tesla noted the hazards of working with his circuit and single-node X-ray-producing devices. In his many notes on the early investigation of this phenomenon, he attributed the skin damage to various causes. He believed early on that damage to the skin was not caused by the Roentgen rays, but by the ozone generated in contact with the skin, and to a lesser extent, by nitrous acid. Tesla incorrectly believed that X-rays were longitudinal waves, such as those produced in waves in plasmas. These plasma waves can occur in force-free magnetic fields.", "questions": ["What did tesla incorrectly believe about x-rays?", "what did tesla attribute skin damage to?", "what did Tesla think nitrous acid contributed to? ", "what did tesla note the hazards of working with? ", "where do plasma waves occur? ", "At first what did Tesla think was the main cause of damage to skin cells when they were exposed to X-rays?", "What did Tesla mistakenly believe X-rays were?", "Where are longitudinal waves found?", "Where can Tesla's theories as to what caused the skin damage be found?"]}, {"id": "4_33", "context": "At the beginning of 1893 Westinghouse engineer Benjamin Lamme had made great progress developing an efficient version of Tesla's induction motor and Westinghouse Electric started branding their complete polyphase phase AC system as the \"Tesla Polyphase System\", noting how they believed Tesla's patents gave them patent priority over other AC systems.", "questions": ["Which engineer made the induction motor more efficient?", "In which year did Benjamin Lamme achieve success making the motor more efficient?", "Who called their system the \"Tesla Polyphase System\"?"]}, {"id": "4_34", "context": "Tesla also explained the principles of the rotating magnetic field in an induction motor by demonstrating how to make a copper egg stand on end using a device he constructed known as the Egg of Columbus.", "questions": ["What was Tesla's device called?", "Who demonstrated the Egg of Columbus?"]}, {"id": "4_35", "context": "On 11 July 1934, the New York Herald Tribune published an article on Tesla, in which he recalled an event that would occasionally take place while experimenting with his single-electrode vacuum tubes; a minute particle would break off the cathode, pass out of the tube, and physically strike him. \"Tesla said he could feel a sharp stinging pain where it entered his body, and again at the place where it passed out.\" In comparing these particles with the bits of metal projected by his \"electric gun,\" Tesla said, \"The particles in the beam of force ... will travel much faster than such particles ... and they will travel in concentrations.\"", "questions": ["When did the Herald Tribune publish its Tesla article?", "What did the particle do to Tesla?", "How did Tesla know he was being struck by the particle?", "What other projectiles did Tesla compare the electric particles to?"]}, {"id": "4_36", "context": "Tesla's theories on the possibility of the transmission by radio waves go back as far as lectures and demonstrations in 1893 in St. Louis, Missouri, the Franklin Institute in Philadelphia, Pennsylvania, and the National Electric Light Association. Tesla's demonstrations and principles were written about widely through various media outlets. Many devices such as the Tesla Coil were used in the further development of radio.", "questions": ["What association did Tesla demonstrate his radio wave theories to?", "Which of Tesla's inventions was used in radio development?", "What Philadelphia institution did Tesla give a demonstration to?"]}, {"id": "4_37", "context": "In 1898, Tesla demonstrated a radio-controlled boat—which he dubbed \"teleautomaton\"—to the public during an electrical exhibition at Madison Square Garden. The crowd that witnessed the demonstration made outrageous claims about the workings of the boat, such as magic, telepathy, and being piloted by a trained monkey hidden inside. Tesla tried to sell his idea to the U.S. military as a type of radio-controlled torpedo, but they showed little interest. Remote radio control remained a novelty until World War I and afterward, when a number of countries used it in military programs. Tesla took the opportunity to further demonstrate \"Teleautomatics\" in an address to a meeting of the Commercial Club in Chicago, while he was travelling to Colorado Springs, on 13 May 1899.", "questions": ["When did Tesla give a demonstration of his remote control boat?", "What was the boat called?", "Where was the boat demonstration given?", "What was the occasion for the boat demonstration?", "What type of animal did onlookers claim was piloting the boat?"]}, {"id": "4_38", "context": "In 1900, Tesla was granted patents for a \"system of transmitting electrical energy\" and \"an electrical transmitter.\" When Guglielmo Marconi made his famous first-ever transatlantic radio transmission in 1901, Tesla quipped that it was done with 17 Tesla patents, though there is little to support this claim. This was the beginning of years of patent battles over radio with Tesla's patents being upheld in 1903, followed by a reverse decision in favor of Marconi in 1904. In 1943, a Supreme Court of the United States decision restored the prior patents of Tesla, Oliver Lodge, and John Stone. The court declared that their decision had no bearing on Marconi's claim as the first to achieve radio transmission, just that since Marconi's claim to certain patents were questionable, he could not claim infringement on those same patents (there are claims the high court was trying to nullify a World War I claim against the U.S. government by the Marconi Company via simply restoring Tesla's prior patent).", "questions": ["When did Tesla attain his electrical transmitter patent?", "Who first sent radio waves across the Atlantic?", "When was Marconi's radio demonstration?", "When were Tesla's patents restored?", "A decision made by what entity restored Tesla's patents?"]}, {"id": "4_39", "context": "On 17 May 1899, Tesla moved to Colorado Springs, where he would have room for his high-voltage, high-frequency experiments; his lab was located near Foote Ave. and Kiowa St. He chose this location because the polyphase alternating current power distribution system had been introduced there and he had associates who were willing to give him all the power he needed without charging for it. Upon his arrival, he told reporters that he was conducting wireless telegraphy experiments, transmitting signals from Pikes Peak to Paris.[citation needed] The 1978 book Colorado Springs Notes, 1899–1900 contains descriptions of Tesla's experiments. On 15 June 1899, Tesla performed his first experiments at his Colorado Springs lab; he recorded his initial spark length at five inches long, but very thick and noisy.", "questions": ["In what year did Tesla go to Colorado Springs?", " Where did he claim he would transport energy to?", "What date did Tesla begin his Colorado Springs experiments?", "What was the recorded length of the first spark?"]}, {"id": "4_40", "context": "Tesla investigated atmospheric electricity, observing lightning signals via his receivers. He stated that he observed stationary waves during this time. The great distances and the nature of what Tesla was detecting from lightning storms confirmed his belief that the earth had a resonant frequency.", "questions": ["What kind of electricity was Tesla investigating?", "What sort of waves did he claim to observe?", "What was Tesla's idea regarding Earth?"]}, {"id": "4_41", "context": "He produced artificial lightning, with discharges consisting of millions of volts and up to 135 feet long. Thunder from the released energy was heard 15 miles away in Cripple Creek, Colorado. People walking along the street observed sparks jumping between their feet and the ground. Sparks sprang from water line taps when touched. Light bulbs within 100 feet of the lab glowed even when turned off. Horses in a livery stable bolted from their stalls after receiving shocks through their metal shoes. Butterflies were electrified, swirling in circles with blue halos of St. Elmo's fire around their wings.", "questions": ["What natural phenomenon did Tesla create artificially? ", "How big were his artificial bolts?", "From what distance could the artificial thunder be heard.", "What happened to nearby light bulbs?", "What was notable about the butterflies?"]}, {"id": "4_42", "context": "While experimenting, Tesla inadvertently faulted a power station generator, causing a power outage. In August 1917, Tesla explained what had happened in The Electrical Experimenter: \"As an example of what has been done with several hundred kilowatts of high frequency energy liberated, it was found that the dynamos in a power house six miles away were repeatedly burned out, due to the powerful high frequency currents set up in them, and which caused heavy sparks to jump through the windings and destroy the insulation!\"", "questions": ["What did Tesla accidentally cause?", "What happened to the dynamos in the power station?", "What caused the dynamos to be burnt out?", "What did the sparks do to the insulation?"]}, {"id": "4_43", "context": "During his time at his lab, Tesla observed unusual signals from his receiver which he concluded may be communications from another planet. He mentioned them in a letter to reporter Julian Hawthorne at the Philadelphia North American on 8 December 1899 and in a December 1900 letter about possible discoveries in the new century to the Red Cross Society where he referred to messages \"from another world\" that read \"1... 2... 3...\". Reporters treated it as a sensational story and jumped to the conclusion Tesla was hearing signals from Mars. He expanded on the signals he heard in a 9 February 1901 Collier's Weekly article \"Talking With Planets\" where he said it had not been immediately apparent to him that he was hearing \"intelligently controlled signals\" and that the signals could come from Mars, Venus, or other planets. It has been hypothesized that he may have intercepted Marconi's European experiments in July 1899—Marconi may have transmitted the letter S (dot/dot/dot) in a naval demonstration, the same three impulses that Tesla hinted at hearing in Colorado—or signals from another experimenter in wireless transmission.", "questions": ["To what did Tesla attribute the unknown signals his radio received?", "What planet did the reporters decide the signals were from?", "What magazine did Tesla talk to about the strange signals?", "What is another possible explanation for the source of the signals?", "When did Marconi transmit similar signals to those Tesla received?"]}, {"id": "4_44", "context": "In 1899, John Jacob Astor IV invested $100,000 for Tesla to further develop and produce a new lighting system. Instead, Tesla used the money to fund his Colorado Springs experiments.", "questions": ["How much money did John Jacob Astor IV provide Tesla with?", "What did Astor expect the money be used for?", "What did Tesla spend Astor's money on?", "When did Astor provide the money?"]}, {"id": "4_45", "context": "On 7 January 1900, Tesla left Colorado Springs.[citation needed] His lab was torn down in 1904, and its contents were sold two years later to satisfy a debt.", "questions": ["When did Tesla depart from Colorado Springs?", "What happened to his lab?", "When was his lab destroyed?", "What happened to the things inside the lab after it was torn down?"]}, {"id": "4_46", "context": "The Colorado experiments had prepared Tesla for the establishment of the trans-Atlantic wireless telecommunications facility known as Wardenclyffe near Shoreham, Long Island.", "questions": ["What did Tesla establish following his Colorado experiments?", "What kind of facility was Wardenclyffe?", "Where was Wardenclyffe located?"]}, {"id": "4_47", "context": "Tesla later approached Morgan to ask for more funds to build a more powerful transmitter. When asked where all the money had gone, Tesla responded by saying that he was affected by the Panic of 1901, which he (Morgan) had caused. Morgan was shocked by the reminder of his part in the stock market crash and by Tesla's breach of contract by asking for more funds. Tesla wrote another plea to Morgan, but it was also fruitless. Morgan still owed Tesla money on the original agreement, and Tesla had been facing foreclosure even before construction of the tower began.", "questions": ["Who did Tesla try to get money from?", "On what did Tesla blame for the loss of the initial money?", "How did Morgan react to the request?"]}, {"id": "4_48", "context": "In December 1901, Marconi successfully transmitted the letter S from England to Newfoundland, terminating Tesla's relationship with Morgan.[improper synthesis?] Over the next five years, Tesla wrote over 50 letters to Morgan, pleading for and demanding additional funding to complete the construction of Wardenclyffe. Tesla continued the project for another nine months. The tower was erected to its full 187 feet (57 m). In July 1903, Tesla wrote to Morgan that in addition to wireless communication, Wardenclyffe would be capable of wireless transmission of electric power. On 14 October 1904, Morgan finally replied through his secretary, stating, \"It will be impossible for [me] to do anything in the matter,\" after Tesla had written to Morgan when the financier was meeting with the Archbishop of Canterbury in an attempt to appeal to his Christian spirit.", "questions": ["How much correspondence did Tesla send Morgan in the five years following 1901?", "Why did Tesla want funds from Morgan?", "What happened in 1901?", "How tall was the tower's ultimate height?"]}, {"id": "4_49", "context": "On his 50th birthday in 1906, Tesla demonstrated his 200 horsepower (150 kilowatts) 16,000 rpm bladeless turbine. During 1910–1911 at the Waterside Power Station in New York, several of his bladeless turbine engines were tested at 100–5,000 hp.", "questions": ["How many horsepower did Tesla's bladeless turbine have?", "At what speed did the turbine operate?", "When did Tesla first show off the turbine?", "What was the horsepower put out by the turbines in Waterside Power Station"]}, {"id": "4_50", "context": "Tesla invented a steam-powered mechanical oscillator—Tesla's oscillator. While experimenting with mechanical oscillators at his Houston Street lab, Tesla allegedly generated a resonance of several buildings. As the speed grew, it is said that the machine oscillated at the resonance frequency of his own building and, belatedly realizing the danger, he was forced to use a sledge hammer to terminate the experiment, just as the police arrived.:162–164 In February 1912, an article—\"Nikola Tesla, Dreamer\" by Allan L. Benson—was published in World Today, in which an artist's illustration appears showing the entire earth cracking in half with the caption, \"Tesla claims that in a few weeks he could set the earth's crust into such a state of vibration that it would rise and fall hundreds of feet and practically destroy civilization. A continuation of this process would, he says, eventually split the earth in two.\"", "questions": ["How was Tesla's mechanical oscillator powered?", "Where did he work on the oscillators?", "What unforeseen problem caused Tesla to hit his experiment with a sledgehammer? ", "What publication published an article about Tesla in 1912?", "What did Tesla claim his resonant frequencies could do in the World Today article?"]}, {"id": "4_51", "context": "Tesla theorized that the application of electricity to the brain enhanced intelligence. In 1912, he crafted \"a plan to make dull students bright by saturating them unconsciously with electricity,\" wiring the walls of a schoolroom and, \"saturating [the schoolroom] with infinitesimal electric waves vibrating at high frequency. The whole room will thus, Mr. Tesla claims, be converted into a health-giving and stimulating electromagnetic field or 'bath.'\" The plan was, at least provisionally approved by then superintendent of New York City schools, William H. Maxwell.", "questions": ["What did Tesla think could improve the brain's intelligence?", "What was Tesla's plan to make students \"bright\"?", "Who approved of this plan?", "What was Maxwell's job?"]}, {"id": "4_52", "context": "Before World War I, Tesla sought overseas investors. After the war started, Tesla lost the funding he was receiving from his patents in European countries. Eventually, he sold Wardenclyffe for $20,000 ($472,500 in today's dollars). In 1917, around the time that the Wardenclyffe Tower was demolished by Boldt to make the land a more viable real estate asset, Tesla received AIEE's highest honor, the Edison Medal.", "questions": ["Where did Tesla look for investors prior to WWI?", "What happened to Tesla's funding once the war begun?", "What did he do with Wardenclyffe?", "How much did Tesla receive from the sale of Wardenclyffe?", "What award was given to Tesla?"]}, {"id": "4_53", "context": "In the August 1917 edition of the magazine Electrical Experimenter Tesla postulated that electricity could be used to locate submarines via using the reflection of an \"electric ray\" of \"tremendous frequency,\" with the signal being viewed on a fluorescent screen (a system that has been noted to have a superficial resemblance to modern radar). Tesla was incorrect in his assumption that high frequency radio waves would penetrate water but Émile Girardeau, who helped develop France's first radar system in the 1930s, noted in 1953 that Tesla's general speculation that a very strong high frequency signal would be needed was correct stating \"(Tesla) was prophesying or dreaming, since he had at his disposal no means of carrying them out, but one must add that if he was dreaming, at least he was dreaming correctly.\":266", "questions": ["In what magazine did Tesla talk about reflecting electricity off of submarine's hulls?", "How would the operator of observe the reflected signal?", "What later invention was Tesla's idea similar to?", "Who played a part in the development of radar in France?"]}, {"id": "4_54", "context": "On 6 November 1915, a Reuters news agency report from London had the 1915 Nobel Prize in Physics awarded to Thomas Edison and Nikola Tesla; however, on 15 November, a Reuters story from Stockholm stated the prize that year was being awarded to Sir William Henry Bragg and William Lawrence Bragg \"for their services in the analysis of crystal structure by means of X-rays.\":245 There were unsubstantiated rumors at the time that Tesla and/or Edison had refused the prize.:245 The Nobel Foundation said, \"Any rumor that a person has not been given a Nobel Prize because he has made known his intention to refuse the reward is ridiculous\"; a recipient could only decline a Nobel Prize after he is announced a winner.:245", "questions": ["Who did Reuters claim won the 1915 Nobel prize in Physics?", "Who actually won the prize?", "What was the rumored reason Edison and Tesla were not awarded the prize?", "According to the Nobel Foundation what has to happen before someone can decline a prize?"]}, {"id": "4_55", "context": "There have been subsequent claims by Tesla biographers that Edison and Tesla were the original recipients and that neither was given the award because of their animosity toward each other; that each sought to minimize the other's achievements and right to win the award; that both refused ever to accept the award if the other received it first; that both rejected any possibility of sharing it; and even that a wealthy Edison refused it to keep Tesla from getting the $20,000 prize money.:245", "questions": ["What was another possible reason that Tesla and Edison did not get the award?."]}, {"id": "4_56", "context": "In the years after these rumors, neither Tesla nor Edison won the prize (although Edison did receive one of 38 possible bids in 1915 and Tesla did receive one of 38 possible bids in 1937).", "questions": ["How many possible bids for the prize were there in 1915?", "Who received a bid in 1915?", "In what year did Tesla receive a Nobel Prize bid?"]}, {"id": "4_57", "context": "In 1928, Tesla received his last patent, U.S. Patent 1,655,114, for a biplane capable of taking off vertically (VTOL aircraft) and then be \"gradually tilted through manipulation of the elevator devices\" in flight until it was flying like a conventional plane. Tesla thought the plane would sell for less than $1,000.:251 Although the aircraft was probably impractical, it may be the earliest known design for what became the tiltrotor/tilt-wing concept as well as the earliest proposal for the use of turbine engines in rotor aircraft.[improper synthesis?]", "questions": ["What was the patent number for Tesla's final patent?", "For what invention was U.S. Patent 1,655,114 granted?", "What was Tesla's belief as to the selling price of the biplane?", "What kind of engines did the biplane design have?"]}, {"id": "4_58", "context": "Starting in 1934, the Westinghouse Electric & Manufacturing Company began paying Tesla $125 per month as well as paying his rent at the Hotel New Yorker, expenses the Company would pay for the rest of Tesla's life. Accounts on how this came about vary. Several sources say Westinghouse was worried about potential bad publicity surrounding the impoverished conditions their former star inventor was living under. It has been described as being couched in the form of a \"consulting fee\" to get around Tesla's aversion to accept charity, or by one biographer (Marc Seifer), as a type of unspecified settlement.", "questions": ["What was Tesla's salary from Westinghouse in 1934?", "What other compensation did Tesla get from Westinghouse?", "For how long did Tesla receive this compensation?", "What was Westinghouse potentially trying to avoid by paying Tesla?"]}, {"id": "4_59", "context": "In 1935, in an annual birthday celebration interview, Tesla announced a method of transmitting mechanical energy with minimal loss over any terrestrial distance, a related new means of communication, and a method of accurately determining the location of underground mineral deposits.", "questions": ["What did Tesla claim to be able to transmit?", "How far did he claim the mechanical energy could be transmitted?", "How much energy loss did he expect would occur?", "What did he hope to locate underground?", "When did Tesla make these claims?"]}, {"id": "4_60", "context": "In the fall of 1937, after midnight one night, Tesla left the Hotel New Yorker to make his regular commute to the cathedral and the library to feed the pigeons. While crossing a street a couple of blocks from the hotel, Tesla was unable to dodge a moving taxicab and was thrown heavily to the ground. Tesla's back was severely wrenched and three of his ribs were broken in the accident (the full extent of his injuries will never be known; Tesla refused to consult a doctor—an almost lifelong custom). Tesla didn't raise any question as to who was at fault and refused medical aid, only asking to be taken to his hotel via cab. Tesla was bedridden for some months and was unable to continue feeding pigeons from his window; soon, they failed to come. In early 1938, Tesla was able to get up. He at once resumed the pigeon-feeding walks on a much more limited scale, but frequently had a messenger act for him.", "questions": ["What was Tesla on his way to do when he was struck by the cab?", "Who did Tesla refuse to see following the accident?", "What happened to his ribs in the accident?", "When did he first get out of bed following the accident?", "When did the accident occur?"]}, {"id": "4_61", "context": "Later in life, Tesla made claims concerning a \"teleforce\" weapon after studying the Van de Graaff generator. The press variably referred to it as a \"peace ray\" or death ray. Tesla described the weapon as capable of being used against ground-based infantry or for anti-aircraft purposes.", "questions": ["What kind of weapon did Tesla talk about?", "What was he studying that gave him the teleforce weapon idea?", "What ground based group did Tesla think the weapon could be used on?", "What was another use for the weapon?", "Other than a peace-ray, what did reporters call the weapon?"]}, {"id": "4_62", "context": "In 1937, at a luncheon in his honor concerning the death ray, Tesla stated, \"But it is not an experiment ... I have built, demonstrated and used it. Only a little time will pass before I can give it to the world.\" His records indicate that the device is based on a narrow stream of small tungsten pellets that are accelerated via high voltage (by means akin to his magnifying transformer).", "questions": ["When did Tesla claim to have built the weapon?", "What was the occasion when he claimed he'd made the death ray?", "Of what material were the death rays pellets made?", "What was used to accelerate the tungsten pellets?", "How much time did he claim had to pass before he gave the ray to the world?"]}, {"id": "4_63", "context": "During the same year, Tesla wrote a treatise, The Art of Projecting Concentrated Non-dispersive Energy through the Natural Media, concerning charged particle beam weapons. Tesla published the document in an attempt to expound on the technical description of a \"superweapon that would put an end to all war.\" This treatise is currently in the Nikola Tesla Museum archive in Belgrade. It describes an open-ended vacuum tube with a gas jet seal that allows particles to exit, a method of charging particles to millions of volts, and a method of creating and directing non-dispersive particle streams (through electrostatic repulsion). Tesla tried to interest the US War Department, the United Kingdom, the Soviet Union, and Yugoslavia in the device.", "questions": ["What kind of weapons did Tesla's treatise concern?", "Where can the Treatise be found?", "In what city is the Nikola Tesla Museum?", "How many volts could particles be charged to in his weapon design?", "What did he claim the weapon would end?"]}, {"id": "4_64", "context": "During the period in which the negotiations were being conducted, Tesla said that efforts had been made to steal the invention. His room had been entered and his papers had been scrutinized, but the thieves, or spies, left empty-handed. He said that there was no danger that his invention could be stolen, for he had at no time committed any part of it to paper; the blueprint for the teleforce weapon was all in his mind.", "questions": ["What was Tesla afraid someone was trying to do with his invention?", "Where did he claim the blueprint was stored?", "According to Tesla what had been gone over by the thieves, or spies who entered his room?"]}, {"id": "4_65", "context": "On 7 January 1943, at the age of 86, Tesla died alone in room 3327 of the New Yorker Hotel. His body was later found by maid Alice Monaghan after she had entered Tesla's room, ignoring the \"do not disturb\" sign that Tesla had placed on his door two days earlier. Assistant medical examiner H.W. Wembly examined the body and ruled that the cause of death had been coronary thrombosis. Tesla's remains were taken to the Frank E. Campbell Funeral Home at Madison Ave. and 81st St. A long-time friend and supporter of Tesla, Hugo Gernsback, commissioned a sculptor to create a death mask, now displayed in the Nikola Tesla Museum.", "questions": ["How old was Tesla when he died?", "What was the date of Tesla's death?", "Who first discovered his body?", "What had been left hanging on the door to Tesla's room?", "What was given as the cause of death?"]}, {"id": "4_66", "context": "Two days later, the FBI ordered the Alien Property Custodian to seize Tesla's belongings, even though Tesla was an American citizen. Tesla's entire estate from the Hotel New Yorker and other New York City hotels was transported to the Manhattan Storage and Warehouse Company under the Office of Alien Property (OAP) seal. John G. Trump, a professor at M.I.T. and a well-known electrical engineer serving as a technical aide to the National Defense Research Committee, was called in to analyze the Tesla items in OAP custody. After a three-day investigation, Trump's report concluded that there was nothing which would constitute a hazard in unfriendly hands, stating:", "questions": ["What happened to Tesla's belongings?", "Who analyzed Tesla's belongings?", "What did he find that could constitute a hazard?", "To where were the belongings taken?"]}, {"id": "4_67", "context": "On 10 January 1943, New York City mayor Fiorello La Guardia read a eulogy written by Slovene-American author Louis Adamic live over the WNYC radio while violin pieces \"Ave Maria\" and \"Tamo daleko\" were played in the background. On 12 January, two thousand people attended a state funeral for Tesla at the Cathedral of Saint John the Divine. After the funeral, Tesla's body was taken to the Ferncliff Cemetery in Ardsley, New York, where it was later cremated. The following day, a second service was conducted by prominent priests in the Trinity Chapel (today's Serbian Orthodox Cathedral of Saint Sava) in New York City.", "questions": ["Who gave Tesla's eulogy? ", "Who wrote the eulogy?", "What day was Tesla's funeral?", "How many people attended the funeral?", "Where was the funeral held?"]}, {"id": "4_68", "context": "In 1952, following pressure from Tesla's nephew, Sava Kosanović, Tesla's entire estate was shipped to Belgrade in 80 trunks marked N.T. In 1957, Kosanović's secretary Charlotte Muzar transported Tesla's ashes from the United States to Belgrade. The ashes are displayed in a gold-plated sphere on a marble pedestal in the Nikola Tesla Museum.", "questions": ["Where was Tesla's property sent?", "Who was Tesla's nephew?", "Who transported Tesla's ashes from the US.", "Where were the ashes sent?", "When are the ashes now?"]}, {"id": "4_69", "context": "Tesla obtained around 300 patents worldwide for his inventions. Some of Tesla's patents are not accounted for, and various sources have discovered some that have lain hidden in patent archives. There are a minimum of 278 patents issued to Tesla in 26 countries that have been accounted for. Many of Tesla's patents were in the United States, Britain, and Canada, but many other patents were approved in countries around the globe.:62 Many inventions developed by Tesla were not put into patent protection.", "questions": ["What was the total number of patents that Tesla had?", "In how many countries did Tesla hold patents?", "Other than the US and Britain what was the other main country that Tesla had patents granted?", " Where were missing patents later found?"]}, {"id": "4_70", "context": "Tesla worked every day from 9:00 a.m. until 6:00 p.m. or later, with dinner from exactly 8:10 p.m., at Delmonico's restaurant and later the Waldorf-Astoria Hotel. Tesla would telephone his dinner order to the headwaiter, who also could be the only one to serve him. \"The meal was required to be ready at eight o'clock ... He dined alone, except on the rare occasions when he would give a dinner to a group to meet his social obligations. Tesla would then resume his work, often until 3:00 a.m.\":283, 286", "questions": ["At what time did Tesla get dinner?", "Before dinner what were Tesla's working hours?", "On some nights how late did Tesla work until?", "Who served his dinner?"]}, {"id": "4_71", "context": "For exercise, Tesla walked between 8 to 10 miles per day. He squished his toes one hundred times for each foot every night, saying that it stimulated his brain cells.", "questions": ["What was the daily distance walked by Tesla?", "Why did he walk?", "What did he do to his feet at night?", "What was he hoping to stimulate with the toe squishing?"]}, {"id": "4_72", "context": "In an interview with newspaper editor Arthur Brisbane, Tesla said that he did not believe in telepathy, stating, \"Suppose I made up my mind to murder you,\" he said, \"In a second you would know it. Now, isn't that wonderful? By what process does the mind get at all this?\" In the same interview, Tesla said that he believed that all fundamental laws could be reduced to one.", "questions": ["What did Tesla tell Brisbane he didn't believe in?", "What was Brisbane's job?", "Down to how many laws did Tesla believe the fundamental laws could be reduced?"]}, {"id": "4_73", "context": "Near the end of his life, Tesla walked to the park every day to feed the pigeons and even brought injured ones into his hotel room to nurse back to health. He said that he had been visited by a specific injured white pigeon daily. Tesla spent over $2,000, including building a device that comfortably supported her so her bones could heal, to fix her broken wing and leg. Tesla stated,", "questions": ["What animals did Tesla care for?", "How much did Tesla spend on the injured pigeon?", "What was wrong with the pigeon?", "Where did Tesla go to feed the pigeons daily?", "To what place did he bring the injured pigeons to take care of them?"]}, {"id": "4_74", "context": "Tesla was 6 feet 2 inches (1.88 m) tall and weighed 142 pounds (64 kg), with almost no weight variance from 1888 to about 1926.:292 He was an elegant, stylish figure in New York City, meticulous in his grooming, clothing, and regimented in his daily activities.", "questions": ["How much did Tesla weigh?", "How tall was Tesla?", "In what time frame did Tesla weigh almost exactly the same amount?", "Where did he live while he was looking good?"]}, {"id": "4_75", "context": "Tesla read many works, memorizing complete books, and supposedly possessed a photographic memory.:33 He was a polyglot, speaking eight languages: Serbo-Croatian, Czech, English, French, German, Hungarian, Italian, and Latin.:282 Tesla related in his autobiography that he experienced detailed moments of inspiration. During his early life, Tesla was repeatedly stricken with illness. He suffered a peculiar affliction in which blinding flashes of light would appear before his eyes, often accompanied by visions.:33 Often, the visions were linked to a word or idea he might have come across; at other times they would provide the solution to a particular problem he had encountered. Just by hearing the name of an item, he would be able to envision it in realistic detail.:33 Tesla would visualize an invention in his mind with extreme precision, including all dimensions, before moving to the construction stage, a technique sometimes known as picture thinking. He typically did not make drawings by hand but worked from memory. Beginning in his childhood, Tesla had frequent flashbacks to events that had happened previously in his life.:33", "questions": ["How many languages did Tesla know?", "What did Tesla see during his strange illnesses when he was young?", "What is another term for Tesla's visualization ability?", "What other visual phenomena accompanied Tesla's visions?", "What kind of memory was Tesla thought to have?"]}, {"id": "4_76", "context": "During his second year of study at Graz, Tesla developed a passion for (and became very proficient at) billiards, chess and card-playing, sometimes spending more than 48 hours in a stretch at a gaming table.:43, 301 On one occasion at his laboratory, Tesla worked for a period of 84 hours without sleep or rest.:208 Kenneth Swezey, a journalist whom Tesla had befriended, confirmed that Tesla rarely slept. Swezey recalled one morning when Tesla called him at 3 a.m.: \"I was sleeping in my room like one dead ... Suddenly, the telephone ring awakened me ... [Tesla] spoke animatedly, with pauses, [as he] ... work[ed] out a problem, comparing one theory to another, commenting; and when he felt he had arrived at the solution, he suddenly closed the telephone.\"", "questions": ["How long would Tesla spend gambling sometimes?", "What amount of time was the longest that Tesla spent working without stopping to rest?", "Where was Tesla studying when he started playing cards and billiards?", "Who did Tesla call in the middle of the night?", "What was Kenneth Swezey's job?"]}, {"id": "4_77", "context": "Tesla never married; he said his chastity was very helpful to his scientific abilities.:33 However, toward the end of his life, he told a reporter, \"Sometimes I feel that by not marrying, I made too great a sacrifice to my work ...\" There have been numerous accounts of women vying for Tesla's affection, even some madly in love with him.[citation needed] Tesla, though polite and soft-spoken, did not have any known relationships.", "questions": ["What characteristic did Tesla say helped his scientific abilities?", "Who reportedly wanted Tesla's company?", "When did Tesla admit to a reporter that maybe he'd sacrificed too much by not having a relationship?"]}, {"id": "4_78", "context": "Tesla was asocial and prone to seclude himself with his work. However, when he did engage in a social life, many people spoke very positively and admiringly of Tesla. Robert Underwood Johnson described him as attaining a \"distinguished sweetness, sincerity, modesty, refinement, generosity, and force.\" His loyal secretary, Dorothy Skerrit, wrote: \"his genial smile and nobility of bearing always denoted the gentlemanly characteristics that were so ingrained in his soul.\" Tesla's friend, Julian Hawthorne, wrote, \"seldom did one meet a scientist or engineer who was also a poet, a philosopher, an appreciator of fine music, a linguist, and a connoisseur of food and drink.\":80", "questions": ["Who was Tesla's secretary? ", "Who said Tesla had a \"distinguished sweetness\"?", "What was Tesla likely to do with his work?", "With what word was Tesla's sociability described?", "What was Julian Hawthorne's relation to Tesla?"]}, {"id": "4_79", "context": "Tesla was a good friend of Francis Marion Crawford, Robert Underwood Johnson, Stanford White, Fritz Lowenstein, George Scherff, and Kenneth Swezey. In middle age, Tesla became a close friend of Mark Twain; they spent a lot of time together in his lab and elsewhere. Twain notably described Tesla's induction motor invention as \"the most valuable patent since the telephone.\" In the late 1920s, Tesla also befriended George Sylvester Viereck, a poet, writer, mystic, and later, a Nazi propagandist. Tesla occasionally attended dinner parties held by Viereck and his wife.", "questions": ["What famous writer was Tesla's good friend?", "Where did Tesla and Twain hang out?", "When did Tesla become friends with Viereck?"]}, {"id": "4_80", "context": "Tesla could be harsh at times and openly expressed disgust for overweight people, such as when he fired a secretary because of her weight.:110 He was quick to criticize clothing; on several occasions, Tesla directed a subordinate to go home and change her dress.:33", "questions": ["Who was Tesla prejudiced against?", "Who did he fire?", "Why did he fire the secretary?", "What did he make the employee do when he didn't like her outfit?"]}, {"id": "4_81", "context": "Tesla exhibited a pre-atomic understanding of physics in his writings; he disagreed with the theory of atoms being composed of smaller subatomic particles, stating there was no such thing as an electron creating an electric charge (he believed that if electrons existed at all, they were some fourth state of matter or \"sub-atom\" that could only exist in an experimental vacuum and that they had nothing to do with electricity).:249 Tesla believed that atoms are immutable—they could not change state or be split in any way. He was a believer in the 19th century concept of an all pervasive \"ether\" that transmitted electrical energy.", "questions": ["What subatomic particle did Tesla deny the existence of?", "What did he think was everywhere in the universe?", "What did he believe the ether did?", "To what century did the idea of ether belong?"]}, {"id": "4_82", "context": "Tesla was generally antagonistic towards theories about the conversion of matter into energy.:247 He was also critical of Einstein's theory of relativity, saying:", "questions": ["Whose theory did Tesla disagree with?", "What was Tesla's attitude toward the idea that matter could be turned into energy?", "Which theory of Einstein's did Tesla speak critically toward?"]}, {"id": "4_83", "context": "Tesla claimed to have developed his own physical principle regarding matter and energy that he started working on in 1892, and in 1937, at age 81, claimed in a letter to have completed a \"dynamic theory of gravity\" that \"[would] put an end to idle speculations and false conceptions, as that of curved space.\" He stated that the theory was \"worked out in all details\" and that he hoped to soon give it to the world. Further elucidation of his theory was never found in his writings.:309", "questions": ["What \"dynamic theory\" did Tesla say he finished in 1937?", "When did Tesla start working on the problem of energy and matter?", "What shape of space did Tesla consider a \"false conception\"?", "How old was Tesla when he wrote that he'd completed his dynamic theory of gravity?"]}, {"id": "4_84", "context": "Tesla, like many of his era, became a proponent of an imposed selective breeding version of eugenics. His opinion stemmed from the belief that humans' \"pity\" had interfered with the natural \"ruthless workings of nature,\" rather than from conceptions of a \"master race\" or inherent superiority of one person over another. His advocacy of it was, however, to push it further. In a 1937 interview, he stated:", "questions": ["What idea was Tesla a fan of?", "What was his belief as to what nature was supposed to be?", "What attribute of humans interfered with nature's ruthlessness in Tesla's opinion?", "When did he talk about his beliefs in an interview?"]}, {"id": "4_85", "context": "In 1926, Tesla commented on the ills of the social subservience of women and the struggle of women toward gender equality, and indicated that humanity's future would be run by \"Queen Bees.\" He believed that women would become the dominant sex in the future.", "questions": ["Who did Tesla think would run the world of the future?", "When did he talk about his thoughts on gender?", "What term did he use for what he believed would be humanity's future rulers?"]}, {"id": "4_86", "context": "Tesla made predictions about the relevant issues of a post-World War I environment in a printed article, \"Science and Discovery are the great Forces which will lead to the Consummation of the War\" (20 December 1914). Tesla believed that the League of Nations was not a remedy for the times and issues.[citation needed]", "questions": ["The issues of what era did Tesla's article talk about?", "What were the \"great Forces\" mentioned in the article's title?", "When was the article published?", "What entity did Tesla believe would not be able to solve the problems of the time?"]}, {"id": "4_87", "context": "Tesla was raised an Orthodox Christian. Later in his life, he did not consider himself to be a \"believer in the orthodox sense,\" and opposed religious fanaticism. Despite this, he had a profound respect for both Buddhism and Christianity.", "questions": ["What religion did Tesla grow up in?", "What type of religious behavior was Tesla against?", "Which two religions did Tesla express respect for?"]}, {"id": "4_88", "context": "However, his religious views remain uncertain due to other statements that he made. For example, in his article, \"A Machine to End War\", published in 1937, Tesla stated:", "questions": ["What article was published in 1937?", "Because of certain statements what was the believed state of his religious views?", "In the article's title, what did the machine hope to end?"]}, {"id": "4_89", "context": "Tesla wrote a number of books and articles for magazines and journals. Among his books are My Inventions: The Autobiography of Nikola Tesla, compiled and edited by Ben Johnston; The Fantastic Inventions of Nikola Tesla, compiled and edited by David Hatcher Childress; and The Tesla Papers.", "questions": ["What did Tesla write?", "Who published Tesla's writings?", "Who edited Tesla's autobiography?"]}, {"id": "4_90", "context": "Many of Tesla's writings are freely available on the web, including the article \"The Problem of Increasing Human Energy,\" published in The Century Magazine in 1900, and the article \"Experiments With Alternate Currents Of High Potential And High Frequency,\" published in his book Inventions, Researches and Writings of Nikola Tesla.", "questions": ["Where can a lot Tesla's writings be found?", "When was his article published in Century Magazine?", "What was one of Tesla's books where articles can be read?"]}, {"id": "4_91", "context": "Tesla's legacy has endured in books, films, radio, TV, music, live theater, comics and video games. The impact of the technologies invented or envisioned by Tesla is a recurring theme in several types of science fiction.", "questions": ["What kind of fiction is Tesla's work featured in?", "What kind of media can references to Tesla be found in", "How many types of science fiction have been impacted by Tesla?"]}, {"id": "4_92", "context": "On Tesla's 75th birthday in 1931, Time magazine put him on its cover. The cover caption \"All the world's his power house\" noted his contribution to electrical power generation. He received congratulatory letters from more than 70 pioneers in science and engineering, including Albert Einstein.", "questions": ["On which magazine's cover did Tesla appear in 1931", "For what occasion was he put on the cover?", "To which technology type that Tesla worked on did the caption refer to?", "What famous person congratulated him?", "How many other important people sent letters?"]}]}
