{"data": [{"id": "6_1", "context": "Huguenot numbers peaked near an estimated two million by 1562, concentrated mainly in the southern and central parts of France, about one-eighth the number of French Catholics. As Huguenots gained influence and more openly displayed their faith, Catholic hostility grew, in spite of increasingly liberal political concessions and edicts of toleration from the French crown. A series of religious conflicts followed, known as the Wars of Religion, fought intermittently from 1562 to 1598. The wars finally ended with the granting of the Edict of Nantes, which granted the Huguenots substantial religious, political and military autonomy.", "questions": [{"question": "Where was France's Huguenot population largely centered?", "is_impossible": false}, {"question": "What was the proportion of Huguenots to Catholics at their peak?", "is_impossible": false}, {"question": "When were the Wars of Religion fought?", "is_impossible": false}, {"question": "What treaty ended the Wars of Religion?", "is_impossible": false}, {"question": "What did this agreement do?", "is_impossible": false}, {"question": "When did the Huguenot movement start?", "is_impossible": true}, {"question": "Where were French Catholics concentrated in France?", "is_impossible": true}, {"question": "Who initially started the Wars of Religion?", "is_impossible": true}, {"question": "How many Huguenots were there in 1598?", "is_impossible": true}, {"question": "How many French Catholics were there in 1598?", "is_impossible": true}]}, {"id": "6_2", "context": "A term used originally in derision, Huguenot has unclear origins. Various hypotheses have been promoted. The nickname may have been a combined reference to the Swiss politician Besançon Hugues (died 1532) and the religiously conflicted nature of Swiss republicanism in his time, using a clever derogatory pun on the name Hugues by way of the Dutch word Huisgenoten (literally housemates), referring to the connotations of a somewhat related word in German Eidgenosse (Confederates as in \"a citizen of one of the states of the Swiss Confederacy\"). Geneva was John Calvin's adopted home and the centre of the Calvinist movement. In Geneva, Hugues, though Catholic, was a leader of the \"Confederate Party\", so called because it favoured independence from the Duke of Savoy through an alliance between the city-state of Geneva and the Swiss Confederation. The label Huguenot was purportedly first applied in France to those conspirators (all of them aristocratic members of the Reformed Church) involved in the Amboise plot of 1560: a foiled attempt to wrest power in France from the influential House of Guise. The move would have had the side effect of fostering relations with the Swiss. Thus, Hugues plus Eidgenosse by way of Huisgenoten supposedly became Huguenot, a nickname associating the Protestant cause with politics unpopular in France.[citation needed]", "questions": [{"question": "The term Huguenot was originally meant to confer?", "is_impossible": false}, {"question": "The term may be related to what politician from Switzerland?", "is_impossible": false}, {"question": "What Swiss city was the center of the Calvinist movement?", "is_impossible": false}, {"question": "What name was given to the plot to usurp power from the French House of Guise?", "is_impossible": false}, {"question": "When did this attempt take place?", "is_impossible": false}, {"question": "In what year was Swiss politician Besancon Hugues born?", "is_impossible": true}, {"question": "What does Huisgenoten translate to in French?", "is_impossible": true}, {"question": "Which city was John Calvin born in?", "is_impossible": true}, {"question": "What religion was John Calvin?", "is_impossible": true}, {"question": "In what year did the House of Guise gain influence?", "is_impossible": true}]}, {"id": "6_3", "context": "The availability of the Bible in vernacular languages was important to the spread of the Protestant movement and development of the Reformed church in France. The country had a long history of struggles with the papacy by the time the Protestant Reformation finally arrived. Around 1294, a French version of the Scriptures was prepared by the Roman Catholic priest, Guyard de Moulin. A two-volume illustrated folio paraphrase version based on his manuscript, by Jean de Rély, was printed in Paris in 1487.", "questions": [{"question": "What helped spread Protestantism in France?", "is_impossible": false}, {"question": "When did the first French language bible appear?", "is_impossible": false}, {"question": "Who translated this version of the scriptures?", "is_impossible": false}, {"question": "An illustrated, paraphrased version of this appeared when?", "is_impossible": false}, {"question": "Jean De Rely's illustrated French-language scriptures were first published in what city?", "is_impossible": false}, {"question": "In what year did the Protestant Reformation arrive in France?", "is_impossible": true}, {"question": "In what country did the Protestant Reformation get its start?", "is_impossible": true}, {"question": "In what year did the Reformed church of France get established?", "is_impossible": true}, {"question": "Where was the Roman Catholic Priest Guyard de Moulin from?", "is_impossible": true}, {"question": "Where was Jean de Rely from?", "is_impossible": true}]}, {"id": "6_4", "context": "Montpellier was among the most important of the 66 \"villes de sûreté\" that the Edict of 1598 granted to the Huguenots. The city's political institutions and the university were all handed over to the Huguenots. Tension with Paris led to a siege by the royal army in 1622. Peace terms called for the dismantling of the city's fortifications. A royal citadel was built and the university and consulate were taken over by the Catholic party. Even before the Edict of Alès (1629), Protestant rule was dead and the ville de sûreté was no more.[citation needed]", "questions": [{"question": "What were the towns granted to the Huguenots in 1598 collectively called?", "is_impossible": false}, {"question": "What was the most important of these cities or towns?", "is_impossible": false}, {"question": "France laid siege to Montpellier in what year?", "is_impossible": false}, {"question": "What proclamation officially ended limited Huguenot autonomy?", "is_impossible": false}, {"question": "When was this proclamation issued?", "is_impossible": false}, {"question": "What was the result in Montpellier of the Edict of Ales in 1629?", "is_impossible": true}, {"question": "What does \"villes de surete\" translate to in English?", "is_impossible": true}, {"question": "How many miles is Montpellier from Paris?", "is_impossible": true}, {"question": "In what year did Protestant rule in Montpellier effectively collapse?", "is_impossible": true}, {"question": "In what year was a royal citadel built by Catholics in Montpellier?", "is_impossible": true}]}, {"id": "6_5", "context": "Individual Huguenots settled at the Cape of Good Hope from as early as 1671 with the arrival of François Villion (Viljoen). The first Huguenot to arrive at the Cape of Good Hope was however Maria de la Queillerie, wife of commander Jan van Riebeeck (and daughter of a Walloon church minister), who arrived on 6 April 1652 to establish a settlement at what is today Cape Town. The couple left for the Far East ten years later. On 31 December 1687 the first organised group of Huguenots set sail from the Netherlands to the Dutch East India Company post at the Cape of Good Hope. The largest portion of the Huguenots to settle in the Cape arrived between 1688 and 1689 in seven ships as part of the organised migration, but quite a few arrived as late as 1700; thereafter, the numbers declined and only small groups arrived at a time.", "questions": [{"question": "Where did the first Huguenot colonists settle?", "is_impossible": false}, {"question": "What modern city is located on the original Huguenot colony?", "is_impossible": false}, {"question": "Who was the first Huguenot to arrive at the Cape of Good Hope?", "is_impossible": false}, {"question": "What trading company helped settle Huguenots near the Cape?", "is_impossible": false}, {"question": "The number of new Huguenot colonists declined after what year?", "is_impossible": false}, {"question": "In what year was Francois Villion born?", "is_impossible": true}, {"question": "What was Maria de la Quellerie's fathers name?", "is_impossible": true}, {"question": "How many ships with Hugeunot's aboard had sailed to Cape of Good Hope in 1671?", "is_impossible": true}, {"question": "What city was Jan van Riebeeck from?", "is_impossible": true}, {"question": "What did Jan van Riebeeck's father do for a living?", "is_impossible": true}]}, {"id": "6_6", "context": "Barred by the government from settling in New France, Huguenots led by Jessé de Forest, sailed to North America in 1624 and settled instead in the Dutch colony of New Netherland (later incorporated into New York and New Jersey); as well as Great Britain's colonies, including Nova Scotia. A number of New Amsterdam's families were of Huguenot origin, often having emigrated as refugees to the Netherlands in the previous century. In 1628 the Huguenots established a congregation as L'Église française à la Nouvelle-Amsterdam (the French church in New Amsterdam). This parish continues today as L'Eglise du Saint-Esprit, part of the Episcopal (Anglican) communion, and welcomes Francophone New Yorkers from all over the world. Upon their arrival in New Amsterdam, Huguenots were offered land directly across from Manhattan on Long Island for a permanent settlement and chose the harbor at the end of Newtown Creek, becoming the first Europeans to live in Brooklyn, then known as Boschwick, in the neighborhood now known as Bushwick.", "questions": [{"question": "When did Huguenots colonize in North America?", "is_impossible": false}, {"question": "Who led the North American Huguenot colonial expedition?", "is_impossible": false}, {"question": "What was the name of the first Huguenot church in the New World?", "is_impossible": false}, {"question": "By what name is that first Huguenot church known today?", "is_impossible": false}, {"question": "The Huguenots were the first Europeans to live in what modern New York borough?", "is_impossible": false}, {"question": "In what part of the now US was New France?", "is_impossible": true}, {"question": "In what year did the Boschwick neighborhood officially change its name to Bushwick?", "is_impossible": true}, {"question": "Where did Jesse de Forest sale from to arrive in North America?", "is_impossible": true}, {"question": "Besides Nova Scotia what was another British colony in North America?", "is_impossible": true}, {"question": "In what year did New Netherland split into New York and New Jersey?", "is_impossible": true}]}, {"id": "6_7", "context": "In the early years, many Huguenots also settled in the area of present-day Charleston, South Carolina. In 1685, Rev. Elie Prioleau from the town of Pons in France, was among the first to settle there. He became pastor of the first Huguenot church in North America in that city. After the Revocation of the Edict of Nantes in 1685, several Huguenot families of Norman and Carolingian nobility and descent, including Edmund Bohun of Suffolk England from the Humphrey de Bohun line of French royalty descended from Charlemagne, Jean Postell of Dieppe France, Alexander Pepin, Antoine Poitevin of Orsement France, and Jacques de Bordeaux of Grenoble, immigrated to the Charleston Orange district. They were very successful at marriage and property speculation. After petitioning the British Crown in 1697 for the right to own land in the Baronies, they prospered as slave owners on the Cooper, Ashepoo, Ashley and Santee River plantations they purchased from the British Landgrave Edmund Bellinger. Some of their descendants moved into the Deep South and Texas, where they developed new plantations.", "questions": [{"question": "What southern city did the Huguenots settle near?", "is_impossible": false}, {"question": "Where in South Carolina did Huguenot nobility settle?", "is_impossible": false}, {"question": "When did the Huguenots secure the right to own land in the Baronies?", "is_impossible": false}, {"question": "From whom did the Huguenots in South Carolina purchase land from?", "is_impossible": false}, {"question": "Charleston settler Elie Prioleau was from what French town?", "is_impossible": false}, {"question": "What French city was Alexander Pepin originally from?", "is_impossible": true}, {"question": "What English city was Edmund Bellinger from?", "is_impossible": true}, {"question": "In what year did Rev. Elie Prioleau become the pastor of the first Huguenot church in Charleston, South Carolina?", "is_impossible": true}, {"question": "In what year did Edmund Bohun of the Humphrey de Bohun line of French royalty move to North America?", "is_impossible": true}, {"question": "In what year was Charleston, North Carolina founded?", "is_impossible": true}]}, {"id": "6_8", "context": "Stadtholder William III of Orange, who later became King of England, emerged as the strongest opponent of king Louis XIV after the French attacked the Dutch Republic in 1672. William formed the League of Augsburg as a coalition to oppose Louis and the French state. Consequently, many Huguenots considered the wealthy and Calvinist Dutch Republic, which led the opposition to Louis XIV, as the most attractive country for exile after the revocation of the Edict of Nantes. They also found many French-speaking Calvinist churches there.", "questions": [{"question": "Who was Louis XIV's main rival?", "is_impossible": false}, {"question": "William would eventually gain what throne?", "is_impossible": false}, {"question": "What coalition rose up to oppose Louis XIV's France?", "is_impossible": false}, {"question": "With what European country did the Huguenots feel kinship for emigration to?", "is_impossible": false}, {"question": "When did France and the Dutch fight in the 17th century?", "is_impossible": false}, {"question": "In what year did William III become King of England?", "is_impossible": true}, {"question": "What language did William III primarily speak?", "is_impossible": true}, {"question": "What did most people in the League of Augsburg speak as their first language?", "is_impossible": true}, {"question": "In what year did King Louis XIV of France take the throne?", "is_impossible": true}]}, {"id": "6_9", "context": "Renewed religious warfare in the 1620s caused the political and military privileges of the Huguenots to be abolished following their defeat. They retained the religious provisions of the Edict of Nantes until the rule of Louis XIV, who progressively increased persecution of them until he issued the Edict of Fontainebleau (1685), which abolished all legal recognition of Protestantism in France, and forced the Huguenots to convert. While nearly three-quarters eventually were killed  or submitted, roughly 500,000 Huguenots had fled France by the early 18th century[citation needed].", "questions": [{"question": "What proclamation abolished protestantism in France?", "is_impossible": false}, {"question": "When was this edict declared?", "is_impossible": false}, {"question": "Which French kind issued this declaration?", "is_impossible": false}, {"question": "How many Huguenots fled France by the 1700s?", "is_impossible": false}, {"question": "In what decade did Louis XIV start his reign?", "is_impossible": true}, {"question": "How many Huguenots were there in France in 1685?", "is_impossible": true}, {"question": "Who had issued the Edict of Nantes?", "is_impossible": true}, {"question": "How many Huguenots were in France in the early 18th century?", "is_impossible": true}]}, {"id": "6_10", "context": "The Catholic Church in France and many of its members opposed the Huguenots. Some Huguenot preachers and congregants were attacked as they attempted to meet for worship. The height of this persecution was the St. Bartholomew's Day massacre when 5,000 to 30,000 were killed, although there were also underlying political reasons for this as well, as some of the Huguenots were nobles trying to establish separate centers of power in southern France. Retaliating against the French Catholics, the Huguenots had their own militia.", "questions": [{"question": "What group specifically opposed the Huguenots?", "is_impossible": false}, {"question": "What event was the worst example of Huguenot persecution?", "is_impossible": false}, {"question": "How many Huguenots were killed during this purge?", "is_impossible": false}, {"question": "How did the Huguenots defend themselves?", "is_impossible": false}, {"question": "What was a non-religious reason for the massacre?", "is_impossible": false}, {"question": "How many French Catholics died during the Bartholomew's Day massacre?", "is_impossible": true}, {"question": "How many French nobles were Huguenots?", "is_impossible": true}, {"question": "How many French Catholics died after the Huguenots retaliated?", "is_impossible": true}, {"question": "How many Huguenots were there in Northern France during this time?", "is_impossible": true}]}, {"id": "6_11", "context": "By 1620 the Huguenots were on the defensive, and the government increasingly applied pressure. A series of three small civil wars known as the Huguenot rebellions broke out, mainly in southwestern France, between 1621 and 1629. revolted against royal authority. The uprising occurred a decade following the death of Henry IV, a Huguenot before converting to Catholicism, who had protected Protestants through the Edict of Nantes. His successor Louis XIII, under the regency of his Italian Catholic mother Marie de' Medici, became more intolerant of Protestantism. The Huguenots respond by establishing independent political and military structures, establishing diplomatic contacts with foreign powers, and openly revolting against central power. The rebellions were implacably suppressed by the French Crown.[citation needed]", "questions": [{"question": "What were the civil wars caused by the Huguenots called?", "is_impossible": false}, {"question": "Where did these uprisings take place?", "is_impossible": false}, {"question": "When did these rebellions take place?", "is_impossible": false}, {"question": "What King and former Huguenot looked out for the welfare of the group?", "is_impossible": false}, {"question": "Which successor to Henry resumed persecution of the Huguenots?", "is_impossible": false}, {"question": "When was the second Huguenot rebellion?", "is_impossible": true}, {"question": "In what year was Louis XIII crowned?", "is_impossible": true}, {"question": "What nationality was Louis XIII originally?", "is_impossible": true}, {"question": "What was one of the nationalities that the Huguenots established diplomatic contacts with?", "is_impossible": true}, {"question": "What religion were most Italians during the 1620s?", "is_impossible": true}]}, {"id": "6_12", "context": "Approximately one million Protestants in modern France represent some 2% of its population. Most are concentrated in Alsace in northeast France and the Cévennes mountain region in the south, who still regard themselves as Huguenots to this day.[citation needed] A diaspora of French Australians still considers itself Huguenot, even after centuries of exile. Long integrated into Australian society, it is encouraged by the Huguenot Society of Australia to embrace and conserve its cultural heritage, aided by the Society's genealogical research services.", "questions": [{"question": "How many protestants live in France today?", "is_impossible": false}, {"question": "What percentage of France's population is protestant today?", "is_impossible": false}, {"question": "What northern province in France has a large protestant population?", "is_impossible": false}, {"question": "What is the southern region where protestants are concentrated?", "is_impossible": false}, {"question": "What country currently has a group who call themselves Huguenots?", "is_impossible": false}, {"question": "How many regard themselves as Huguenots today outside of France?", "is_impossible": true}, {"question": "How many people live in the Alsace region of France?", "is_impossible": true}, {"question": "Where are there the fewest Protestants in France?", "is_impossible": true}, {"question": "What percentage of people in Australia regard themselves as Huguenots?", "is_impossible": true}, {"question": " How many Protestants are there in the Cevennes mountain region?", "is_impossible": true}]}, {"id": "6_13", "context": "Huguenot immigrants did not disperse or settle in different parts of the country, but rather, formed three societies or congregations; one in the city of New York, another 21 miles north of New York in a town which they named New Rochelle, and a third further upstate in New Paltz. The \"Huguenot Street Historic District\" in New Paltz has been designated a National Historic Landmark site and contains the oldest street in the United States of America. A small group of Huguenots also settled on the south shore of Staten Island along the New York Harbor, for which the current neighborhood of Huguenot was named.", "questions": [{"question": "What city north of New York was settled by Huguenots?", "is_impossible": false}, {"question": "What town in upstate New York was settled by Huguenots?", "is_impossible": false}, {"question": "What Huguenot area is designated as a historical landmark?", "is_impossible": false}, {"question": "What is located within this district?", "is_impossible": false}, {"question": "In what borough is there a neighborhood called Huguenot?", "is_impossible": false}, {"question": "How far is New Paltz from New York?", "is_impossible": true}, {"question": "How far is New Rochelle from New Paltz?", "is_impossible": true}, {"question": "How long is the south shore of Staten Island?", "is_impossible": true}, {"question": "Where did most of the Huguenots decide to live?", "is_impossible": true}, {"question": "Where did the fewest Huguenots stay?", "is_impossible": true}]}, {"id": "6_14", "context": "After the revocation of the Edict of Nantes, the Dutch Republic received the largest group of Huguenot refugees, an estimated total of 75,000 to 100,000 people. Amongst them were 200 clergy. Many came from the region of the Cévennes, for instance, the village of Fraissinet-de-Lozère. This was a huge influx as the entire population of the Dutch Republic amounted to ca. 2 million at that time. Around 1700, it is estimated that nearly 25% of the Amsterdam population was Huguenot.[citation needed] In 1705, Amsterdam and the area of West Frisia were the first areas to provide full citizens rights to Huguenot immigrants, followed by the Dutch Republic in 1715. Huguenots intermarried with Dutch from the outset.", "questions": [{"question": "What country initially received the largest number of Huguenot refugees?", "is_impossible": false}, {"question": "How many refugees emigrated to the Dutch Republic?", "is_impossible": false}, {"question": "What was the population of the Dutch Republic before this emigration?", "is_impossible": false}, {"question": "What two areas in the Republic were first to grant rights to the Huguenots?", "is_impossible": false}, {"question": "What declaration predicated the emigration of Huguenot refugees?", "is_impossible": false}, {"question": "How many Huguenots lived in West Frisia in 1705?", "is_impossible": true}, {"question": "How many Huguenots lived in Amsterdam in 1705?", "is_impossible": true}, {"question": "In what year was the Edict of Nantes revoked?", "is_impossible": true}, {"question": "How many clergymen were there in the Dutch Republic before the influx of Huguenots?", "is_impossible": true}, {"question": "In what country is the Cevennes?", "is_impossible": true}]}, {"id": "6_15", "context": "In this last connection, the name could suggest the derogatory inference of superstitious worship; popular fancy held that Huguon, the gate of King Hugo, was haunted by the ghost of le roi Huguet (regarded by Roman Catholics as an infamous scoundrel) and other spirits, who instead of being in Purgatory came back to harm the living at night. It was in this place in Tours that the prétendus réformés (\"these supposedly 'reformed'\") habitually gathered at night, both for political purposes, and for prayer and singing psalms. Such explanations have been traced to the contemporary, Reguier de la Plancha (d. 1560), who in De l'Estat de France offered the following account as to the origin of the name, as cited by The Cape Monthly:", "questions": [{"question": "Where was the Gate of King Hugo?", "is_impossible": false}, {"question": "By what other name was the Gate known?", "is_impossible": false}, {"question": "Who allegedly haunted the gate?", "is_impossible": false}, {"question": "By what name were the \"supposedly reformed\" known?", "is_impossible": false}, {"question": "What time of day did these reformed supposedly gather to engage in Huguenot rituals?", "is_impossible": false}, {"question": "In what year was Huguon built?", "is_impossible": true}, {"question": "In what year did King Hugo die?", "is_impossible": true}, {"question": "In what year did le roi Huguet die?", "is_impossible": true}, {"question": "In what year was Reguier de la Plancha born?", "is_impossible": true}, {"question": "In what year was The Cape Monthly first published?", "is_impossible": true}]}, {"id": "6_16", "context": "Other evidence of the Walloons and Huguenots in Canterbury includes a block of houses in Turnagain Lane, where weavers' windows survive on the top floor, as many Huguenots worked as weavers. The Weavers, a half-timbered house by the river, was the site of a weaving school from the late 16th century to about 1830. (It has been adapted as a restaurant—see illustration above. The house derives its name from a weaving school which was moved there in the last years of the 19th century, reviving an earlier use.) Others refugees practised the variety of occupations necessary to sustain the community as distinct from the indigenous population. Such economic separation was the condition of the refugees' initial acceptance in the City. They also settled elsewhere in Kent, particularly Sandwich, Faversham and Maidstone—towns in which there used to be refugee churches.", "questions": [{"question": "Where did Huguenots and Walloons settle in England?", "is_impossible": false}, {"question": "What house was the site of a weaving school in Canterbury?", "is_impossible": false}, {"question": "What social construct did Huguenot refugees in Canterbury practice?", "is_impossible": false}, {"question": "What other English towns were sites of Huguenot settlement?", "is_impossible": false}, {"question": "What is located on the site of The Weaving House currently?", "is_impossible": false}, {"question": "When was the The Weavers converted into a restaurant?", "is_impossible": true}, {"question": "In which English town did the most Huguenots live?", "is_impossible": true}, {"question": "In which English town did the most Walloons live?", "is_impossible": true}, {"question": "What was one occupation of the native English?", "is_impossible": true}, {"question": "Which English town had the largest refugee church?", "is_impossible": true}]}, {"id": "6_17", "context": "A number of Huguenots served as mayors in Dublin, Cork, Youghal and Waterford in the 17th and 18th centuries. Numerous signs of Huguenot presence can still be seen with names still in use, and with areas of the main towns and cities named after the people who settled there. Examples include the Huguenot District and French Church Street in Cork City; and D'Olier Street in Dublin, named after a High Sheriff and one of the founders of the Bank of Ireland. A French church in Portarlington dates back to 1696, and was built to serve the significant new Huguenot community in the town. At the time, they constituted the majority of the townspeople.", "questions": [{"question": "What Irish cities had Huguenot mayors in the 1600s and 1700s?", "is_impossible": false}, {"question": "French Church Street is in what Irish town?", "is_impossible": false}, {"question": "Where is D'Olier Street?", "is_impossible": false}, {"question": "D'Olier Street is named after whom?", "is_impossible": false}, {"question": "The French church in Portarlington was built when?", "is_impossible": false}, {"question": "In what Irish city can few signs remain to be seen of the Huguenots?", "is_impossible": true}, {"question": "In what year was D'Olier Street built in Dublin?", "is_impossible": true}, {"question": "In what year was French Church Street built in Cork?", "is_impossible": true}, {"question": "The Huguenot District was named in Cork in what year?", "is_impossible": true}, {"question": "What was D'olier's first name?", "is_impossible": true}]}, {"id": "6_18", "context": "The exodus of Huguenots from France created a brain drain, as many Huguenots had occupied important places in society. The kingdom did not fully recover for years. The French crown's refusal to allow non-Catholics to settle in New France may help to explain that colony's slow rate of population growth compared to that of the neighbouring British colonies, which opened settlement to religious dissenters. By the time of the French and Indian War (the North American front of the Seven Years' War), a sizeable population of Huguenot descent lived in the British colonies, and many participated in the British defeat of New France in 1759-60.", "questions": [{"question": "What is the common term for the loss of key members of French society to Huguenot emigration?", "is_impossible": false}, {"question": "What was the name of France's primary colony in the New World?", "is_impossible": false}, {"question": "What persons were not allowed to settle in New France?", "is_impossible": false}, {"question": "The French and Indian War was the New World aspect of what European conflict?", "is_impossible": false}, {"question": "When did the British defeat New France?", "is_impossible": false}, {"question": "In what year did the French and Indian War begin?", "is_impossible": true}, {"question": "What people weren't allowed to settle in British colonies?", "is_impossible": true}, {"question": "In what year did the first Huguenots arrive in the British colonies?", "is_impossible": true}, {"question": "Who won the Seven Years' War?", "is_impossible": true}]}, {"id": "6_19", "context": "The pattern of warfare, followed by brief periods of peace, continued for nearly another quarter-century. The warfare was definitively quelled in 1598, when Henry of Navarre, having succeeded to the French throne as Henry IV, and having recanted Protestantism in favour of Roman Catholicism, issued the Edict of Nantes. The Edict reaffirmed Catholicism as the state religion of France, but granted the Protestants equality with Catholics under the throne and a degree of religious and political freedom within their domains. The Edict simultaneously protected Catholic interests by discouraging the founding of new Protestant churches in Catholic-controlled regions.[citation needed]", "questions": [{"question": "What was Henry IV known as before taking the throne?", "is_impossible": false}, {"question": "When did Henry issue the Edict of Nantes?", "is_impossible": false}, {"question": "What did the Edict do for Huguenots in France?", "is_impossible": false}, {"question": "The edict protected Catholics by discouraging what?", "is_impossible": false}, {"question": "What religion did Henry renounce upon ascending the throne?", "is_impossible": false}, {"question": "In what year was Henry of Navarre born?", "is_impossible": true}, {"question": "In what year was Henry of Navarre made Henry IV?", "is_impossible": true}, {"question": "In what year did the warfare in France between Protestants and Catholics get it start?", "is_impossible": true}, {"question": "What did the Edict of Nantes encourage in Catholic-controlled areas of France?", "is_impossible": true}]}, {"id": "6_20", "context": "The revocation forbade Protestant services, required education of children as Catholics, and prohibited emigration. It proved disastrous to the Huguenots and costly for France. It precipitated civil bloodshed, ruined commerce, and resulted in the illegal flight from the country of hundreds of thousands of Protestants, many of whom became intellectuals, doctors and business leaders in Britain as well as Holland, Prussia, and South Africa. Four thousand emigrated to the North American colonies, where they settled in New York and Virginia, especially. The English welcomed the French refugees, providing money from both government and private agencies to aid their relocation. Those Huguenots who stayed in France became Catholics and were called \"new converts\".", "questions": [{"question": "What was required of Huguenot children after the Edict was revoked?", "is_impossible": false}, {"question": "How did the revocation restrict Huguenot travel?", "is_impossible": false}, {"question": "How many Huguenots emigrated to North America as colonists?", "is_impossible": false}, {"question": "What were Huguenots who stayed in France eventually known as?", "is_impossible": false}, {"question": "Besides Britain and North America, where else did Huguenot refugees settle?", "is_impossible": false}, {"question": "How many French people fled to Prussia?", "is_impossible": true}, {"question": "Besides England who else were particularly welcoming to those fleeing France?", "is_impossible": true}, {"question": "What country was very well known for offering a Protestant education?", "is_impossible": true}, {"question": "How many of those fleeing France went on to become doctors?", "is_impossible": true}, {"question": "How many Huguenots chose to stay in France?", "is_impossible": true}]}, {"id": "6_21", "context": "The first Huguenots to leave France sought freedom from persecution in Switzerland and the Netherlands.[citation needed] A group of Huguenots was part of the French colonisers who arrived in Brazil in 1555 to found France Antarctique. A couple of ships with around 500 people arrived at the Guanabara Bay, present-day Rio de Janeiro, and settled in a small island. A fort, named Fort Coligny, was built to protect them from attack from the Portuguese troops and Brazilian Native Americans. It was an attempt to establish a French colony in South America. The fort was destroyed in 1560 by the Portuguese, who captured part of the Huguenots. The Portuguese threatened the prisoners with death if they did not convert to Catholicism. The Huguenots of Guanabara, as they are now known, produced a declaration of faith to express their beliefs to the Portuguese. This was their death sentence. This document, the Guanabara Confession of Faith, became the first Protestant confession of faith in the whole of the Americas.[citation needed]", "questions": [{"question": "What were the first two destinations of Huguenot emigres?", "is_impossible": false}, {"question": "When was the French colony in modern day Brazil founded?", "is_impossible": false}, {"question": "What was the Brazilian French colony called?", "is_impossible": false}, {"question": "In what year was Fort Coligny destroyed?", "is_impossible": false}, {"question": "By what document did the Huguenots confess their faith to the Portuguese in Brazil?", "is_impossible": false}, {"question": "How many Huguenots were part of the group that founded France Antarctique in 1555?", "is_impossible": true}, {"question": "In what year was Fort Coligny built?", "is_impossible": true}, {"question": "How many were in the first wave of Huguenot's fleeing to Switzerland?", "is_impossible": true}, {"question": "How many Huguenot's did the Portuguese kill for being Protestant in Guanabara?", "is_impossible": true}]}, {"id": "6_22", "context": "Many of the farms in the Western Cape province in South Africa still bear French names. Many families, today mostly Afrikaans-speaking, have surnames indicating their French Huguenot ancestry. Examples include: Blignaut, Cilliers, de Klerk (Le Clercq), de Villiers, du Plessis, Du Preez (Des Pres), du Randt (Durand), du Toit, Duvenhage(Du Vinage), Franck, Fouche, Fourie (Fleurit), Gervais, Giliomee (Guilliaume), Gous/Gouws (Gauch), Hugo, Jordaan (Jourdan), Joubert, Kriek, Labuschagne (la Buscagne), le Roux, Lombard, Malan, Malherbe, Marais, Maree, Minnaar (Mesnard), Nel (Nell),Naude', Nortje (Nortier), Pienaar (Pinard), Retief (Retif), Rossouw (Rousseau), Taljaard (Taillard), TerBlanche, Theron, Viljoen (Villion) and Visagie (Visage). The wine industry in South Africa owes a significant debt to the Huguenots, some of whom had vineyards in France, or were brandy distillers, and used their skills in their new home.", "questions": [{"question": "Families with French names in South Africa speak what language today?", "is_impossible": false}, {"question": "What South African industry descended from Huguenot settlers?", "is_impossible": false}, {"question": "Where can one find the formerly Huguenot farms in South Africa?", "is_impossible": false}, {"question": "What characteristic identifies the French ancestry of some South Africans?", "is_impossible": false}, {"question": "What prominent South African family had a vineyard in France?", "is_impossible": true}, {"question": "What South African family had the largest vineyard in France?", "is_impossible": true}, {"question": "What prominent South African family distilled brandy and were Huguenots?", "is_impossible": true}, {"question": "What Huguenot French family had the largest brandy distilling business in South Africa?", "is_impossible": true}]}, {"id": "6_23", "context": "Paul Revere was descended from Huguenot refugees, as was Henry Laurens, who signed the Articles of Confederation for South Carolina; Jack Jouett, who made the ride from Cuckoo Tavern to warn Thomas Jefferson and others that Tarleton and his men were on their way to arrest him for crimes against the king; Francis Marion, and a number of other leaders of the American Revolution and later statesmen. The last active Huguenot congregation in North America worships in Charleston, South Carolina, at a church that dates to 1844. The Huguenot Society of America maintains Manakin Episcopal Church in Virginia as an historic shrine with occasional services. The Society has chapters in numerous states, with the one in Texas being the largest.", "questions": [{"question": "What Revolutionary War midnight rider was a Huguenot descendant?", "is_impossible": false}, {"question": "What signer of the Articles of Confederation was descended from Huguenots?", "is_impossible": false}, {"question": "In what city is the last Huguenot congregation in the US?", "is_impossible": false}, {"question": "What church in Virginia is maintained by Huguenots as a historic shrine?", "is_impossible": false}, {"question": "In what state is the largest Huguenot Society located?", "is_impossible": false}, {"question": "In what year was the Articles of Confederation for South Carolina signed?", "is_impossible": true}, {"question": "In what year was the Huguenot Society for America founded?", "is_impossible": true}, {"question": "What is the Huguenot church in Charleston, South Carolina named?", "is_impossible": true}, {"question": "Who owned the Cuckoo Tavern?", "is_impossible": true}, {"question": "In what state was the Cuckoo Tavern?", "is_impossible": true}]}, {"id": "6_24", "context": "Some Huguenots settled in Bedfordshire, one of the main centres of the British lace industry at the time. Although 19th century sources have asserted that some of these refugees were lacemakers and contributed to the East Midlands lace industry, this is contentious. The only reference to immigrant lacemakers in this period is of twenty-five widows who settled in Dover, and there is no contemporary documentation to support there being Huguenot lacemakers in Bedfordshire. The implication that the style of lace known as 'Bucks Point' demonstrates a Huguenot influence, being a \"combination of Mechlin patterns on Lille ground\", is fallacious: what is now known as Mechlin lace did not develop until first half of the eighteenth century and lace with Mechlin patterns and Lille ground did not appear until the end of the 18th century, when it was widely copied throughout Europe.", "questions": [{"question": "What industry was centered in Bedfordshire?", "is_impossible": false}, {"question": "What style of lace is erroneously believed by some to have Huguenot influence?", "is_impossible": false}, {"question": "What reference is there to Huguenot lacemakers in the 19th century?", "is_impossible": false}, {"question": "When did Mechlin lace develop?", "is_impossible": false}, {"question": "How many immigrant lacemakers were there in Bedfordshire?", "is_impossible": true}, {"question": "In what era was \"Bucks Point\" lace making developed?", "is_impossible": true}, {"question": "How many Huguenots settled in Bedfordshire?", "is_impossible": true}, {"question": "What was Dover the main British center of at the time?", "is_impossible": true}]}, {"id": "6_25", "context": "In Berlin, the Huguenots created two new neighbourhoods: Dorotheenstadt and Friedrichstadt. By 1700, one-fifth of the city's population was French speaking. The Berlin Huguenots preserved the French language in their church services for nearly a century. They ultimately decided to switch to German in protest against the occupation of Prussia by Napoleon in 1806-07. Many of their descendents rose to positions of prominence. Several congregations were founded, such as those of Fredericia (Denmark), Berlin, Stockholm, Hamburg, Frankfurt, Helsinki, and Emden.", "questions": [{"question": "What were the two Huguenot neighborhoods created in Berlin?", "is_impossible": false}, {"question": "What portion of Berlin's population spoke French by 1700?", "is_impossible": false}, {"question": "Why did Berlin Huguenots switch to German from French in their services?", "is_impossible": false}, {"question": "What years did this occupation take place?", "is_impossible": false}, {"question": "What other Northern European cities had Huguenot congregations?", "is_impossible": false}, {"question": "In what year did Napoleon come to power in France?", "is_impossible": true}, {"question": "What neighborhood did Huguenots establish in Stockholm?", "is_impossible": true}, {"question": "What neighborhood did Huguenots create in Hamburg?", "is_impossible": true}, {"question": "When did Huguenots first arrive in Helsinki?", "is_impossible": true}, {"question": "How much of Helsinki's population spoke French as of 1700?", "is_impossible": true}]}, {"id": "6_26", "context": "After this, Huguenots (with estimates ranging from 200,000 to 1,000,000) fled to surrounding Protestant countries: England, the Netherlands, Switzerland, Norway, Denmark, and Prussia — whose Calvinist Great Elector Frederick William welcomed them to help rebuild his war-ravaged and underpopulated country. Following this exodus, Huguenots remained in large numbers in only one region of France: the rugged Cévennes region in the south. In the early 18th century, a regional group known as the Camisards who were Huguenots rioted against the Catholic Church in the region, burning churches and killing clergy. It took French troops years to hunt down and destroy all the bands of Camisards, between 1702 and 1709.", "questions": [{"question": "Which central European country had a Calvinist ruler?", "is_impossible": false}, {"question": "After Huguenots fled France, their last remaining bastion was where?", "is_impossible": false}, {"question": "What did the 18th century Huguenot group call themselves?", "is_impossible": false}, {"question": "Against whom did the Camisards rise up to fight?", "is_impossible": false}, {"question": "French troops put down the Camisard uprisings between what years?", "is_impossible": false}, {"question": "In what year did Frederick William of Prussia become the Great Elector?", "is_impossible": true}, {"question": "How many Huguenots fled to England?", "is_impossible": true}, {"question": "How many people did Prussia lose due to war?", "is_impossible": true}, {"question": "When did the fighting stop in Prussia?", "is_impossible": true}, {"question": "In what year did the Camisards organize as a regional group in southern France?", "is_impossible": true}]}, {"id": "6_27", "context": "In 1564 a group of Norman Huguenots under the leadership of Jean Ribault established the small colony of Fort Caroline on the banks of the St. Johns River in what is today Jacksonville, Florida. The effort was the first at any permanent European settlement in the present-day continental United States, but survived only a short time. A September 1565 French naval attack against the new Spanish colony at St. Augustine failed when its ships were hit by a hurricane on their way to the Spanish encampment at Fort Matanzas. Hundreds of French soldiers were stranded and surrendered to the numerically inferior Spanish forces led by Pedro Menendez. Menendez proceeded to massacre the defenseless Huguenots, after which he wiped out the Fort Caroline garrison.", "questions": [{"question": "There was a 16th century Huguenot settlement near what modern day Florida city?", "is_impossible": false}, {"question": "Who was the leader who established the colony at Florida?", "is_impossible": false}, {"question": "What was the name of the Florida Huguenot colony?", "is_impossible": false}, {"question": "Which army attacked and destroyed this colony?", "is_impossible": false}, {"question": "When was the colony destroyed?", "is_impossible": false}, {"question": "In what year was Jean Ribault born?", "is_impossible": true}, {"question": "How many Huguenots did Pedro Menendez have murdered  at  St Augustine?", "is_impossible": true}, {"question": "How many Huguenots were there in Fort Caroline?", "is_impossible": true}, {"question": "From where had the Norman Huguenots sailed in order to arrive at Fort Caroline?", "is_impossible": true}]}, {"id": "6_28", "context": "French Huguenots made two attempts to establish a haven in North America. In 1562, naval officer Jean Ribault led an expedition that explored Florida and the present-day Southeastern U.S., and founded the outpost of Charlesfort on Parris Island, South Carolina. The Wars of Religion precluded a return voyage, and the outpost was abandoned. In 1564, Ribault's former lieutenant René Goulaine de Laudonnière launched a second voyage to build a colony; he established Fort Caroline in what is now Jacksonville, Florida. War at home again precluded a resupply mission, and the colony struggled. In 1565 the Spanish decided to enforce their claim to La Florida, and sent Pedro Menéndez de Avilés, who established the settlement of St. Augustine near Fort Caroline. Menéndez' forces routed the French and executed most of the Protestant captives.", "questions": [{"question": "What was the name of the first Huguenot outpost in South Carolina?", "is_impossible": false}, {"question": "What present-day area was this settlement near?", "is_impossible": false}, {"question": "Which Spanish officer established the settlement at St. Augustine?", "is_impossible": false}, {"question": "When did Ribault first establish a settlement in South Carolina?", "is_impossible": false}, {"question": "What European event caused the Huguenots to abandon Charlesfort?", "is_impossible": false}, {"question": "In what year did the Wars of Religion start?", "is_impossible": true}, {"question": "In what year was Rene Goulaine de Laudonniere born?", "is_impossible": true}, {"question": "In what year was Pedro Menendez de Aviles born?", "is_impossible": true}, {"question": "In what year did Rene Goulaine de Laudonniere leave his position as a lieutenant for Jean Ribault?", "is_impossible": true}, {"question": "In what year did the French Huguenots abandon their first North American outpost?", "is_impossible": true}]}, {"id": "6_29", "context": "In 1700 several hundred French Huguenots migrated from England to the colony of Virginia, where the English Crown had promised them land grants in Lower Norfolk County. When they arrived, colonial authorities offered them instead land 20 miles above the falls of the James River, at the abandoned Monacan village known as Manakin Town, now in Powhatan County. Some settlers landed in present-day Chesterfield County. On 12 May 1705, the Virginia General Assembly passed an act to naturalise the 148 Huguenots still resident at Manakintown. Of the original 390 settlers in the isolated settlement, many had died; others lived outside town on farms in the English style; and others moved to different areas. Gradually they intermarried with their English neighbors. Through the 18th and 19th centuries, descendants of the French migrated west into the Piedmont, and across the Appalachian Mountains into the West of what became Kentucky, Tennessee, Missouri, and other states. In the Manakintown area, the Huguenot Memorial Bridge across the James River and Huguenot Road were named in their honor, as were many local features, including several schools, including Huguenot High School.", "questions": [{"question": "In what English colony were Huguenot settlers promised land?", "is_impossible": false}, {"question": "In what area of this British colony were Huguenot land grants?", "is_impossible": false}, {"question": "What town was actually granted to the Huguenots on arrival?", "is_impossible": false}, {"question": "How many settlers original settled in Manakintown?", "is_impossible": false}, {"question": "When were these settlers naturalized as English colonists?", "is_impossible": false}, {"question": "How many French Huguenots eventually moved to Missouri from Manakin Town?", "is_impossible": true}, {"question": "How many French Huguenots in Manakin Town ended up moving to Kentucky?", "is_impossible": true}, {"question": "How many French Huguenot residents of Manakin Town actually live outside the town on farms?", "is_impossible": true}, {"question": "In what century was the Huguenot Memorial Bridge built?", "is_impossible": true}, {"question": "In what year had Manakin Town first been abandoned?", "is_impossible": true}]}, {"id": "6_30", "context": "Some Huguenots fought in the Low Countries alongside the Dutch against Spain during the first years of the Dutch Revolt (1568–1609). The Dutch Republic rapidly became a destination for Huguenot exiles. Early ties were already visible in the \"Apologie\" of William the Silent, condemning the Spanish Inquisition, which was written by his court minister, the Huguenot Pierre L'Oyseleur, lord of Villiers. Louise de Coligny, daughter of the murdered Huguenot leader Gaspard de Coligny, married William the Silent, leader of the Dutch (Calvinist) revolt against Spanish (Catholic) rule. As both spoke French in daily life, their court church in the Prinsenhof in Delft held services in French. The practice has continued to the present day. The Prinsenhof is one of the 14 active Walloon churches of the Dutch Reformed Church. The ties between Huguenots and the Dutch Republic's military and political leadership, the House of Orange-Nassau, which existed since the early days of the Dutch Revolt, helped support the many early settlements of Huguenots in the Dutch Republic's colonies. They settled at the Cape of Good Hope in South Africa and New Netherland in North America.", "questions": [{"question": "When was the Dutch Revolt?", "is_impossible": false}, {"question": "Who did the Dutch fight in the Dutch Revolt?", "is_impossible": false}, {"question": "What Dutch document condemned the Spanish Inquisition?", "is_impossible": false}, {"question": "What leader led the Dutch Revolt and wrote Apologie?", "is_impossible": false}, {"question": "What was the Dutch leader's religious affiliation?", "is_impossible": false}, {"question": "In what year did William the Silent issue his \"Apologie\"?", "is_impossible": true}, {"question": "What nationality was Pierre L'Oyseleur?", "is_impossible": true}, {"question": "In what colony was the town of Delft?", "is_impossible": true}, {"question": "In what year did Huguenots begin to settle in South Africa?", "is_impossible": true}, {"question": "Who was William the Silent's father?", "is_impossible": true}]}, {"id": "6_31", "context": "Both before and after the 1708 passage of the Foreign Protestants Naturalization Act, an estimated 50,000 Protestant Walloons and Huguenots fled to England, with many moving on to Ireland and elsewhere. In relative terms, this was one of the largest waves of immigration ever of a single ethnic community to Britain. Andrew Lortie (born André Lortie), a leading Huguenot theologian and writer who led the exiled community in London, became known for articulating their criticism of the Pope and the doctrine of transubstantiation during Mass.", "questions": [{"question": "What English law made that country more welcoming to Huguenots?", "is_impossible": false}, {"question": "When was this naturalization act passed?", "is_impossible": false}, {"question": "About how many Walloons and Huguenots emigrated to England and Ireland in this era?", "is_impossible": false}, {"question": "Who was the famous Huguenot theologian and writer in London?", "is_impossible": false}, {"question": "What Catholic Church liturgical belief did Lortie criticize openly?", "is_impossible": false}, {"question": "How many Huguenots fled to England after the Foreign Protestants Naturalization Act was passed?", "is_impossible": true}, {"question": "How many Protestant Walloons fled to England before the Foreign Protestants Naturalization Act was passed?", "is_impossible": true}, {"question": "Where was Andrew Lortie originally from?", "is_impossible": true}, {"question": "In what year was Andrew Lortie born?", "is_impossible": true}, {"question": "How many Protestant Walloons and Huguenots continued on through England and ended up in Ireland?", "is_impossible": true}]}, {"id": "6_32", "context": "Following the French Crown's revocation of the Edict of Nantes, many Huguenots settled in Ireland in the late 17th and early 18th centuries, encouraged by an act of parliament for Protestants' settling in Ireland. Huguenot regiments fought for William of Orange in the Williamite war in Ireland, for which they were rewarded with land grants and titles, many settling in Dublin. Significant Huguenot settlements were in Dublin, Cork, Portarlington, Lisburn, Waterford and Youghal. Smaller settlements, which included Killeshandra in County Cavan, contributed to the expansion of flax cultivation and the growth of the Irish linen industry.", "questions": [{"question": "What war in Ireland featured Huguenot regiments?", "is_impossible": false}, {"question": "Under which leader did the Huguenots fight in this conflict?", "is_impossible": false}, {"question": "Which Irish cities had large Huguenot enclaves?", "is_impossible": false}, {"question": "Huguenots in Killeshandra and County Cavan expanded what agricultural industry?", "is_impossible": false}, {"question": "What textile industry did the Huguenots contribute to in Ireland?", "is_impossible": false}, {"question": "In what era was the Williamite war in Ireland?", "is_impossible": true}, {"question": "Where was the biggest settlement of Huguenots in Ireland?", "is_impossible": true}, {"question": "Where was the smallest settlement of Huguenots in Ireland among major cities?", "is_impossible": true}, {"question": "What did the Huguenots who settled in Dublin contribute?", "is_impossible": true}, {"question": "What did the Huguenots who settled in Cork contribute?", "is_impossible": true}]}, {"id": "6_33", "context": "Prince Louis de Condé, along with his sons Daniel and Osias,[citation needed] arranged with Count Ludwig von Nassau-Saarbrücken to establish a Huguenot community in present-day Saarland in 1604. The Count supported mercantilism and welcomed technically skilled immigrants into his lands, regardless of their religion. The Condés established a thriving glass-making works, which provided wealth to the principality for many years. Other founding families created enterprises based on textiles and such traditional Huguenot occupations in France. The community and its congregation remain active to this day, with descendants of many of the founding families still living in the region. Some members of this community emigrated to the United States in the 1890s.", "questions": [{"question": "Which noble helped establish the Huguenot settlement in Saarland?", "is_impossible": false}, {"question": "Which Count did the Prince strike an arrangement with?", "is_impossible": false}, {"question": "What industry did the nobleman establish with this settlement?", "is_impossible": false}, {"question": "In what era did some members of this community emigrate to the US?", "is_impossible": false}, {"question": "In what year was the agreement to allow the Saarland settlement reached?", "is_impossible": false}, {"question": "In what year was Prince Louis de Conde born?", "is_impossible": true}, {"question": "In what year was Ludwig von Nassau-Saarbrucken made a Count?", "is_impossible": true}, {"question": "Who was Count Ludwig von Nassau-Saarbucken's father?", "is_impossible": true}, {"question": "In what year did Huguenots first move to present-day Saarland?", "is_impossible": true}]}, {"id": "6_34", "context": "The bulk of Huguenot émigrés relocated to Protestant European nations such as England, Wales, Scotland, Denmark, Sweden, Switzerland, the Dutch Republic, the Electorate of Brandenburg and Electorate of the Palatinate in the Holy Roman Empire, the Duchy of Prussia, the Channel Islands, and Ireland. They also spread beyond Europe to the Dutch Cape Colony in South Africa, the Dutch East Indies, the Caribbean, and several of the English colonies of North America, and Quebec, where they were accepted and allowed to worship freely.", "questions": [{"question": "What two member nations of the Holy Roman Empire received Huguenot refugees?", "is_impossible": false}, {"question": "What general religious belief did the nations that received Huguenot refugees have in common?", "is_impossible": false}, {"question": "What area in South Africa accepted Huguenot colonists?", "is_impossible": false}, {"question": "What area in modern-day Canada received Huguenot immigrants?", "is_impossible": false}, {"question": "What made emigration to these colonies attractive?", "is_impossible": false}, {"question": "What nation did the most Huguenots flee to from France?", "is_impossible": true}, {"question": "To what nation did the fewest Huguenots flee to from France?", "is_impossible": true}, {"question": "What religion predominated in the Holy Roman Empire?", "is_impossible": true}, {"question": "What was the biggest religion in Sweden?", "is_impossible": true}, {"question": "What was the biggest religion in Quebec?", "is_impossible": true}]}, {"id": "6_35", "context": "Some disagree with such double or triple non-French linguistic origins, arguing that for the word to have spread into common use in France, it must have originated in the French language. The \"Hugues hypothesis\" argues that the name was derived by association with Hugues Capet, king of France, who reigned long before the Reformation. He was regarded by the Gallicans and Protestants as a noble man who respected people's dignity and lives. Janet Gray and other supporters of the hypothesis suggest that the name huguenote would be roughly equivalent to little Hugos, or those who want Hugo.", "questions": [{"question": "From what French King did the Huguenot name possibly descend?", "is_impossible": false}, {"question": "What is the theory that this King's name is the origin of \"Huguenot\" called?", "is_impossible": false}, {"question": "Who is one prominent advocate of this theory?", "is_impossible": false}, {"question": "According to the theory, what does the name \"Huguenot\" mean?", "is_impossible": false}, {"question": "Other theories of the word's origin can be generally classed as what?", "is_impossible": false}, {"question": "Who was the first king of France to reign during the Reformation?", "is_impossible": true}, {"question": "What religion was Hugues Capet?", "is_impossible": true}, {"question": "What religion was Janet Gray?", "is_impossible": true}, {"question": "Who was Janet Gray married to?", "is_impossible": true}]}, {"id": "6_36", "context": "Other predecessors of the Reformed church included the pro-reform and Gallican Roman Catholics, such as Jacques Lefevre (c. 1455–1536). The Gallicans briefly achieved independence for the French church, on the principle that the religion of France could not be controlled by the Bishop of Rome, a foreign power. During the Protestant Reformation, Lefevre, a professor at the University of Paris, published his French translation of the New Testament in 1523, followed by the whole Bible in the French language in 1530. William Farel was a student of Lefevre who went on to become a leader of the Swiss Reformation, establishing a Protestant government in Geneva. Jean Cauvin (John Calvin), another student at the University of Paris, also converted to Protestantism. Long after the sect was suppressed by Francis I, the remaining French Waldensians, then mostly in the Luberon region, sought to join William Farel, Calvin and the Reformation, and Olivetan published a French Bible for them. The French Confession of 1559 shows a decidedly Calvinistic influence. Sometime between 1550 and 1580, members of the Reformed church in France came to be commonly known as Huguenots.[citation needed]", "questions": [{"question": "Who was one French pro-reform Roman Catholic of the 15th century? ", "is_impossible": false}, {"question": "Where did this pro-reform leader teach?", "is_impossible": false}, {"question": "When did this leader publish a French language Bible?", "is_impossible": false}, {"question": "What leader of the Swiss reformation was a student of Lefevre?", "is_impossible": false}, {"question": "What other European Protestant leader was educated at the University of Paris?", "is_impossible": false}, {"question": "In what nation did the Gallicans get their start?", "is_impossible": true}, {"question": "What French city was Jacques Lefevre from?", "is_impossible": true}, {"question": "In what year did John Calvin graduate from the University of Paris?", "is_impossible": true}, {"question": "In what year did John Calvin become a Protestant?", "is_impossible": true}, {"question": "Who was one of the most prominent French Waldensians?", "is_impossible": true}]}, {"id": "6_37", "context": "In what became known as the St. Bartholomew's Day Massacre of 24 August – 3 October 1572, Catholics killed thousands of Huguenots in Paris. Similar massacres took place in other towns in the weeks following. The main provincial towns and cities experiencing the Massacre were Aix, Bordeaux, Bourges, Lyons, Meaux, Orleans, Rouen, Toulouse, and Troyes. Nearly 3,000 Protestants were slaughtered in Toulouse alone. The exact number of fatalities throughout the country is not known. On 23–24 August, between about 2,000 and 3,000 Protestants were killed in Paris and between 3,000 and 7,000 more in the French provinces. By 17 September, almost 25,000 Protestants had been massacred in Paris alone. Beyond Paris, the killings continued until 3 October. An amnesty granted in 1573 pardoned the perpetrators.[citation needed]", "questions": [{"question": "When was the St. Bartholomew's Day Massacre?", "is_impossible": false}, {"question": "What group killed thousands of Huguenots?", "is_impossible": false}, {"question": "How many Huguenots were killed in Toulouse?", "is_impossible": false}, {"question": "When was amnesty granted to those responsible for the massacre?", "is_impossible": false}, {"question": "Reports document that how many Parisien Protestants were killed by September 17?", "is_impossible": false}, {"question": "How many Huguenots were killed in Bordeaux?", "is_impossible": true}, {"question": "In which French city was about 2,000 Huguenots killed?", "is_impossible": true}, {"question": "How many Huguenots were killed altogether in France?", "is_impossible": true}, {"question": "How many Huguenots were slaughtered in Orleans?", "is_impossible": true}, {"question": "How many Huguenots were slain in Toulouse?", "is_impossible": true}]}, {"id": "6_38", "context": "Louis XIV gained the throne in 1643 and acted increasingly aggressively to force the Huguenots to convert. At first he sent missionaries, backed by a fund to financially reward converts to Catholicism. Then he imposed penalties, closed Huguenot schools and excluded them from favored professions. Escalating, he instituted dragonnades, which included the occupation and looting of Huguenot homes by military troops, in an effort to forcibly convert them. In 1685, he issued the Edict of Fontainebleau, revoking the Edict of Nantes and declaring Protestantism illegal.[citation needed]", "questions": [{"question": "Who became king in 1643?", "is_impossible": false}, {"question": "How did the new king react to the Huguenots?", "is_impossible": false}, {"question": "What was the king's first approach to the Huguenots?", "is_impossible": false}, {"question": "What did the king do to regarding Huguenot education?", "is_impossible": false}, {"question": "The practice of occupying and looting Huguenot homes was called?", "is_impossible": false}, {"question": "In what year did Louis XIV die?", "is_impossible": true}, {"question": "In what year did Louis XIV start to bribe Protestants to convert to Catholicism?", "is_impossible": true}, {"question": "In what year did Louis XIV start to deny Protestants the ability to work in certain professions?", "is_impossible": true}, {"question": "In what year was the Edict of Nantes issued?", "is_impossible": true}, {"question": "In what year were the Dragonnades started?", "is_impossible": true}]}, {"id": "6_39", "context": "New Rochelle, located in the county of Westchester on the north shore of Long Island Sound, seemed to be the great location of the Huguenots in New York. It is said that they landed on the coastline peninsula of Davenports Neck called \"Bauffet's Point\" after traveling from England where they had previously taken refuge on account of religious persecution, four years before the revocation of the Edict of Nantes. They purchased from John Pell, Lord of Pelham Manor, a tract of land consisting of six thousand one hundred acres with the help of Jacob Leisler. It was named New Rochelle after La Rochelle, their former strong-hold in France. A small wooden church was first erected in the community, followed by a second church that built of stone. Previous to the erection of it, the strong men would often walk twenty-three miles on Saturday evening, the distance by the road from New Rochelle to New York, to attend the Sunday service. The church was eventually replaced by a third, Trinity-St. Paul's Episcopal Church, which contains heirlooms including the original bell from the French Huguenot Church \"Eglise du St. Esperit\" on Pine Street in New York City, which is preserved as a relic in the tower room. The Huguenot cemetery, or \"Huguenot Burial Ground\", has since been recognized as a historic cemetery that is the final resting place for a wide range of the Huguenot founders, early settlers and prominent citizens dating back more than three centuries.", "questions": [{"question": "What present day county is New Rochelle in?", "is_impossible": false}, {"question": "Where did the Huguenots land in New York originally?", "is_impossible": false}, {"question": "From whom did the Huguenots purchase the land where they settled?", "is_impossible": false}, {"question": "What French City was New Rochelle named after?", "is_impossible": false}, {"question": "What is the name of the third, permanent Huguenot church in New Rochelle?", "is_impossible": false}, {"question": "Who named \"Bauffet's Point\" at Davenports Neck?", "is_impossible": true}, {"question": "How much land did the Lord of Pelham Manor, John Pell. own in total in North America?", "is_impossible": true}, {"question": "Whose decision was it to name the new town New Rochelle?", "is_impossible": true}, {"question": "How far is it from Davenports Neck to New Rochelle?", "is_impossible": true}, {"question": "What was the name of the first wooden church built in New Rochelle?", "is_impossible": true}]}, {"id": "6_40", "context": "Most of the Huguenot congregations (or individuals) in North America eventually affiliated with other Protestant denominations with more numerous members. The Huguenots adapted quickly and often married outside their immediate French communities, which led to their assimilation. Their descendants in many families continued to use French first names and surnames for their children well into the nineteenth century. Assimilated, the French made numerous contributions to United States economic life, especially as merchants and artisans in the late Colonial and early Federal periods. For example, E.I. du Pont, a former student of Lavoisier, established the Eleutherian gunpowder mills.", "questions": [{"question": "How did Huguenots evolve their religious beliefs in the New World?", "is_impossible": false}, {"question": "How were Huguenot settlers assimilated into North American society at large?", "is_impossible": false}, {"question": "Who was one prominent Huguenot-descended arms manufacturer?", "is_impossible": false}, {"question": "For how long did Huguenots continue to use French names?", "is_impossible": false}, {"question": "What was the name of du Pont's gunpowder operation?", "is_impossible": false}, {"question": "In what century was Eleutherian gunpowder mills founded?", "is_impossible": true}, {"question": "What were Protestant's contributions to the United State economic life?", "is_impossible": true}, {"question": "What nationality was Lavoisier?", "is_impossible": true}, {"question": "How did Huguenots hold onto some of their religious beliefs over the years?", "is_impossible": true}]}, {"id": "6_41", "context": "One of the most prominent Huguenot refugees in the Netherlands was Pierre Bayle. He started teaching in Rotterdam, where he finished writing and publishing his multi-volume masterpiece, Historical and Critical Dictionary. It became one of the 100 foundational texts of the US Library of Congress. Some Huguenot descendants in the Netherlands may be noted by French family names, although they typically use Dutch given names. Due to the Huguenots' early ties with the leadership of the Dutch Revolt and their own participation, some of the Dutch patriciate are of part-Huguenot descent. Some Huguenot families have kept alive various traditions, such as the celebration and feast of their patron Saint Nicolas, similar to the Dutch Sint Nicolaas (Sinterklaas) feast.", "questions": [{"question": "Who was a prominent Huguenot in Holland?", "is_impossible": false}, {"question": "Where did he begin teaching?", "is_impossible": false}, {"question": "What books did Bayle publish?", "is_impossible": false}, {"question": "These books became a foundational text for what library?", "is_impossible": false}, {"question": "Who is the patron saint of the Huguenots?", "is_impossible": false}, {"question": "How many months did it take Pierre Bayle to write his multi-volume series Historical and Critical Dictionary?", "is_impossible": true}, {"question": "How many French family names are commonly used in the Netherlands?", "is_impossible": true}, {"question": "Is Saint Nicolas or Sint Nicolaas celebrated earlier in the year in the Netherlands?", "is_impossible": true}, {"question": "How many volumes is Historical and Critical Dictionary?", "is_impossible": true}]}, {"id": "6_42", "context": "The French Protestant Church of London was established by Royal Charter in 1550. It is now located at Soho Square. Huguenot refugees flocked to Shoreditch, London. They established a major weaving industry in and around Spitalfields (see Petticoat Lane and the Tenterground) in East London. In Wandsworth, their gardening skills benefited the Battersea market gardens. The Old Truman Brewery, then known as the Black Eagle Brewery, was founded in 1724. The flight of Huguenot refugees from Tours, France drew off most of the workers of its great silk mills which they had built.[citation needed] Some of these immigrants moved to Norwich, which had accommodated an earlier settlement of Walloon weavers. The French added to the existing immigrant population, then comprising about a third of the population of the city.", "questions": [{"question": "What early Huguenot Church was established in England?", "is_impossible": false}, {"question": "When was the charter for this church signed?", "is_impossible": false}, {"question": "What is the present-day location of this church?", "is_impossible": false}, {"question": "What London neighborhood attracted Huguenot refugees?", "is_impossible": false}, {"question": "When was the Old Truman Brewery founded?", "is_impossible": false}, {"question": "In what year did Huguenot refugees first start to move to London?", "is_impossible": true}, {"question": "In what year did the Black Eagle Brewery change its name to Old Truman Brewery?", "is_impossible": true}, {"question": "What Huguenot church was established in Norwich?", "is_impossible": true}, {"question": "How much of London's populace became immigrants?", "is_impossible": true}, {"question": "In what year did Huguenot refugees first settle in Norwich?", "is_impossible": true}]}, {"id": "6_43", "context": "Around 1685, Huguenot refugees found a safe haven in the Lutheran and Reformed states in Germany and Scandinavia. Nearly 50,000 Huguenots established themselves in Germany, 20,000 of whom were welcomed in Brandenburg-Prussia, where they were granted special privileges (Edict of Potsdam) and churches in which to worship (such as the Church of St. Peter and St. Paul, Angermünde) by Frederick William, Elector of Brandenburg and Duke of Prussia. The Huguenots furnished two new regiments of his army: the Altpreußische Infantry Regiments No. 13 (Regiment on foot Varenne) and 15 (Regiment on foot Wylich). Another 4,000 Huguenots settled in the German territories of Baden, Franconia (Principality of Bayreuth, Principality of Ansbach), Landgraviate of Hesse-Kassel, Duchy of Württemberg, in the Wetterau Association of Imperial Counts, in the Palatinate and Palatinate-Zweibrücken, in the Rhine-Main-Area (Frankfurt), in modern-day Saarland; and 1,500 found refuge in Hamburg, Bremen and Lower Saxony. Three hundred refugees were granted asylum at the court of George William, Duke of Brunswick-Lüneburg in Celle.", "questions": [{"question": "What protestant religions made Northern European counties safe for Huguenot immigration?", "is_impossible": false}, {"question": "Which areas of Northern Europe practiced those religions?", "is_impossible": false}, {"question": "What proclamation gave Huguenots special privileges in Brandenburg?", "is_impossible": false}, {"question": "What dual titles did Frederick William hold?", "is_impossible": false}, {"question": "What military impact did Huguenot immigration have on Frederick's army?", "is_impossible": false}, {"question": "In what year was the AltpreuBissche Infantry Regiment No. 13 established?", "is_impossible": true}, {"question": "In what year was Frederick William named as the Elector of Brandenburg?", "is_impossible": true}, {"question": "How many Huguenot settled in the Baden territory of Germany?", "is_impossible": true}, {"question": "How many Huguenot settled in the Lower Saxony territory of Germany?", "is_impossible": true}, {"question": "How many men were in the AltpreusBische Infantry No. 15?", "is_impossible": true}]}, {"id": "6_44", "context": "Frederick William, Elector of Brandenburg, invited Huguenots to settle in his realms, and a number of their descendants rose to positions of prominence in Prussia. Several prominent German military, cultural, and political figures were ethnic Huguenot, including poet Theodor Fontane, General Hermann von François, the hero of the First World War Battle of Tannenberg, Luftwaffe General and fighter ace Adolf Galland, Luftwaffe flying ace Hans-Joachim Marseille, and famed U-boat captain Lothar von Arnauld de la Perière. The last Prime Minister of the (East) German Democratic Republic, Lothar de Maizière, is also a descendant of a Huguenot family, as is the German Federal Minister of the Interior, Thomas de Maizière.", "questions": [{"question": "What German ruler invited Huguenot immigration?", "is_impossible": false}, {"question": "What German poet was descended from Huguenots?", "is_impossible": false}, {"question": "What German general and fighter pilot was of Huguenot ancestry?", "is_impossible": false}, {"question": "Who was the final Prime Minister of East Germany?", "is_impossible": false}, {"question": "Thomas de Maiziere serves what role in the German cabinet?", "is_impossible": false}, {"question": "Who is one of Frederick Williams' descendants?", "is_impossible": true}, {"question": "Who is a descendant of General Hermann von Francois?", "is_impossible": true}, {"question": "Which side won the First World War Battle of Tannenberg?", "is_impossible": true}, {"question": "What ethnicity was Frederick William, Elector of Brandenburg?", "is_impossible": true}, {"question": "Who was one of Lothar de Maiziere's predecessors?", "is_impossible": true}]}]}
