{"data": [{"id": "7_1", "context": "Martin Luther (/ˈluːθər/ or /ˈluːðər/; German: [ˈmaɐ̯tiːn ˈlʊtɐ] ( listen); 10 November 1483 – 18 February 1546) was a German professor of theology, composer, priest, former monk and a seminal figure in the Protestant Reformation. Luther came to reject several teachings and practices of the Late Medieval Catholic Church. He strongly disputed the claim that freedom from God's punishment for sin could be purchased with money. He proposed an academic discussion of the power and usefulness of indulgences in his Ninety-Five Theses of 1517. His refusal to retract all of his writings at the demand of Pope Leo X in 1520 and the Holy Roman Emperor Charles V at the Diet of Worms in 1521 resulted in his excommunication by the Pope and condemnation as an outlaw by the Emperor.", "questions": ["Of what nationality was Martin Luther?", "When did Martin Luther die?", "What organization's teaching did Luther reject?", "What did the Church claim could be avoided with money?", "What did the Church do when Luther refused to retract his writings?"]}, {"id": "7_2", "context": "Luther taught that salvation and subsequently eternal life is not earned by good deeds but is received only as a free gift of God's grace through faith in Jesus Christ as redeemer from sin. His theology challenged the authority and office of the Pope by teaching that the Bible is the only source of divinely revealed knowledge from God and opposed sacerdotalism by considering all baptized Christians to be a holy priesthood. Those who identify with these, and all of Luther's wider teachings, are called Lutherans even though Luther insisted on Christian or Evangelical as the only acceptable names for individuals who professed Christ.", "questions": ["Since he didn't believe that salvation was acquired through good deeds, how was it achieved?", "What did Martin Luther believe achieved God's Grace?", "Whose authority did Luther's theology oppose?", "What did Luther think was the only source of knowledge of God?", "To Luther, what were all baptized Christians considered to be?"]}, {"id": "7_3", "context": "His translation of the Bible into the vernacular (instead of Latin) made it more accessible, which had a tremendous impact on the church and German culture. It fostered the development of a standard version of the German language, added several principles to the art of translation, and influenced the writing of an English translation, the Tyndale Bible. His hymns influenced the development of singing in churches. His marriage to Katharina von Bora set a model for the practice of clerical marriage, allowing Protestant clergy to marry.", "questions": ["What book did Martin Luther translate to impact German culture?", "What did Luther's translation of the Bible promote in the German language?", "What version of the English translation of the Bible did Luther's translation affect?", "What development did Luther's hymns translations influence?", "What did Martin Luther's marriage allow?"]}, {"id": "7_4", "context": "Martin Luther was born to Hans Luder (or Ludher, later Luther) and his wife Margarethe (née Lindemann) on 10 November 1483 in Eisleben, Saxony, then part of the Holy Roman Empire. He was baptized as a Catholic the next morning on the feast day of St. Martin of Tours. His family moved to Mansfeld in 1484, where his father was a leaseholder of copper mines and smelters and served as one of four citizen representatives on the local council. The religious scholar Martin Marty describes Luther's mother as a hard-working woman of \"trading-class stock and middling means\" and notes that Luther's enemies later wrongly described her as a whore and bath attendant. He had several brothers and sisters, and is known to have been close to one of them, Jacob. Hans Luther was ambitious for himself and his family, and he was determined to see Martin, his eldest son, become a lawyer. He sent Martin to Latin schools in Mansfeld, then Magdeburg in 1497, where he attended a school operated by a lay group called the Brethren of the Common Life, and Eisenach in 1498. The three schools focused on the so-called \"trivium\": grammar, rhetoric, and logic. Luther later compared his education there to purgatory and hell.", "questions": ["When was Martin Luther born?", "Where was Luther born?", "Of what region was Saxony a part?", "Into what religion was Martin Luther baptized?", "What profession did Martin's father want his son to pursue?"]}, {"id": "7_5", "context": "In 1501, at the age of 19, he entered the University of Erfurt, which he later described as a beerhouse and whorehouse. He was made to wake at four every morning for what has been described as \"a day of rote learning and often wearying spiritual exercises.\" He received his master's degree in 1505.", "questions": ["Where did Martin Luther go to school?", "How did Luther describe the University of Erfurt?", "How early did Luther say he had to awaken every day?", "How did Luther describe his learning at the university?", "In what year did Luther get his degree?"]}, {"id": "7_6", "context": "In accordance with his father's wishes, Luther enrolled in law school at the same university that year but dropped out almost immediately, believing that law represented uncertainty. Luther sought assurances about life and was drawn to theology and philosophy, expressing particular interest in Aristotle, William of Ockham, and Gabriel Biel. He was deeply influenced by two tutors, Bartholomaeus Arnoldi von Usingen and Jodocus Trutfetter, who taught him to be suspicious of even the greatest thinkers and to test everything himself by experience. Philosophy proved to be unsatisfying, offering assurance about the use of reason but none about loving God, which to Luther was more important. Reason could not lead men to God, he felt, and he thereafter developed a love-hate relationship with Aristotle over the latter's emphasis on reason. For Luther, reason could be used to question men and institutions, but not God. Human beings could learn about God only through divine revelation, he believed, and Scripture therefore became increasingly important to him.", "questions": ["What educational study did Luther start to pursue and immediately  drop?", "What did Luther think the study of law meant?", "What fields of study did Martin Luther prefer?", "How did Luther's tutors advise him to test what he learned?", "What did Luther think reason could not be used to test?"]}, {"id": "7_7", "context": "He later attributed his decision to an event: on 2 July 1505, he was returning to university on horseback after a trip home. During a thunderstorm, a lightning bolt struck near him. Later telling his father he was terrified of death and divine judgment, he cried out, \"Help! Saint Anna, I will become a monk!\" He came to view his cry for help as a vow he could never break. He left law school, sold his books, and entered a closed Augustinian cloister in Erfurt on 17 July 1505. One friend blamed the decision on Luther's sadness over the deaths of two friends. Luther himself seemed saddened by the move. Those who attended a farewell supper walked him to the door of the Black Cloister. \"This day you see me, and then, not ever again,\" he said. His father was furious over what he saw as a waste of Luther's education.", "questions": ["What did Martin Luther fear after a lightening bolt struck near him?", "When did the lightening event happen?", "Where did Luther go on 17 July 1505?", "On what did Luther's friend blame his sadness and entrance into the cloister?", "What did Martin's father view his entering the cloister as a waste of?"]}, {"id": "7_8", "context": "Luther dedicated himself to the Augustinian order, devoting himself to fasting, long hours in prayer, pilgrimage, and frequent confession. Luther described this period of his life as one of deep spiritual despair. He said, \"I lost touch with Christ the Savior and Comforter, and made of him the jailer and hangman of my poor soul.\" Johann von Staupitz, his superior, pointed Luther's mind away from continual reflection upon his sins toward the merits of Christ. He taught that true repentance does not involve self-inflicted penances and punishments but rather a change of heart.", "questions": ["To what did Martin Luther devote all his attention ?", "How did Luther describe his time in the order?", "What did Luther feel he made of Christ?", "Who directed Luther away from self-reflection and towards the merits of Christ?", "What lesson did Johann von Staupitz teach Luther  repentance was?"]}, {"id": "7_9", "context": "In 1507, he was ordained to the priesthood, and in 1508, von Staupitz, first dean of the newly founded University of Wittenberg, sent for Luther, to teach theology. He received a bachelor's degree in Biblical studies on 9 March 1508, and another bachelor's degree in the Sentences by Peter Lombard in 1509.", "questions": ["When was Martin Luther ordained as a priest?", "Who asked Luther to teach theology at the University of Wittenberg?", "When was Luther  called by von Staupitz to Wittenberg?", "When did Luther receive a degree in Biblical studies?", "What did Luther's degree in 1509 concern?"]}, {"id": "7_10", "context": "On 19 October 1512, he was awarded his Doctor of Theology and, on 21 October 1512, was received into the senate of the theological faculty of the University of Wittenberg, having been called to the position of Doctor in Bible. He spent the rest of his career in this position at the University of Wittenberg.", "questions": ["When did Martin Luther receive his Doctor of Theology?", "When did Luther enter into the senate of the Theology faculty of the University of Wittenberg?", "What position did Luther have in Wittenberg?", "Where did Luther spend his career?", "What degree did Martin Luther receive on 19 October, 1512?"]}, {"id": "7_11", "context": "In 1516, Johann Tetzel, a Dominican friar and papal commissioner for indulgences, was sent to Germany by the Roman Catholic Church to sell indulgences to raise money to rebuild St. Peter's Basilica in Rome. Roman Catholic theology stated that faith alone, whether fiduciary or dogmatic, cannot justify man; justification rather depends only on such faith as is active in charity and good works (fides caritate formata). The benefits of good works could be obtained by donating money to the church.", "questions": ["When was Johann Tetzel sent by the Roman Catholic Church to Germany to sell indulgences?", "Why was Tetzel seeking money in Germany?", "What theology states that faith alone isn't enough to justify man?", "What does man's justification depend on in faith?", "What is the Catholic doctrine of fides caritate formata?"]}, {"id": "7_12", "context": "On 31 October 1517, Luther wrote to his bishop, Albert of Mainz, protesting the sale of indulgences. He enclosed in his letter a copy of his \"Disputation of Martin Luther on the Power and Efficacy of Indulgences\", which came to be known as The Ninety-Five Theses. Hans Hillerbrand writes that Luther had no intention of confronting the church, but saw his disputation as a scholarly objection to church practices, and the tone of the writing is accordingly \"searching, rather than doctrinaire.\" Hillerbrand writes that there is nevertheless an undercurrent of challenge in several of the theses, particularly in Thesis 86, which asks: \"Why does the pope, whose wealth today is greater than the wealth of the richest Crassus, build the basilica of St. Peter with the money of poor believers rather than with his own money?\"", "questions": ["When did Martin Luther protest the sale of indulgences to his bishop?", "In 1517 who was Luther's bishop?", "What was Luther's Disputation of Martin Luther on the Power and Efficacy of Indulgences later called?", "Who contends that Luther did not intend to oppose the church?", "Which Thesis questions the Pope's actions in building the basilica of St. Peter with the money of the poor?"]}, {"id": "7_13", "context": "Luther objected to a saying attributed to Johann Tetzel that \"As soon as the coin in the coffer rings, the soul from purgatory (also attested as 'into heaven') springs.\"", "questions": ["Whose saying about purgatory did Martin Luther object to?", "How did Tetzel state that the soul could leave purgatory?", "Who objected to Tetzel's collections of money to free souls from purgatory?", "What church money collector said that the sould would spring from purgatory through monetary donations?"]}, {"id": "7_14", "context": "He insisted that, since forgiveness was God's alone to grant, those who claimed that indulgences absolved buyers from all punishments and granted them salvation were in error. Christians, he said, must not slacken in following Christ on account of such false assurances.", "questions": ["Who did Martin Luther say was the lone granter of forgiveness?", "What were these indulgences supposed to grant the giver?", "What did giving money to the church absolve the giver from?", "What did Luther call these donations?", "Who did Luther say that Christians must not slacken in following?"]}, {"id": "7_15", "context": "However, this oft-quoted saying of Tetzel was by no means representative of contemporary Catholic teaching on indulgences, but rather a reflection of his capacity to exaggerate. Yet if Tetzel overstated the matter in regard to indulgences for the dead, his teaching on indulgences for the living was in line with Catholic dogma of the time.", "questions": ["Whose saying about freeing souls from purgatory was often quoted?", "What did this statement of Tetzel's show about him?", "Where did Tetzel overstate his teachings?", "Where were Tetzel's teachings in line with Church dogma?"]}, {"id": "7_16", "context": "According to scholars Walter Krämer, Götz Trenkler, Gerhard Ritter, and Gerhard Prause, the story of the posting on the door, even though it has settled as one of the pillars of history, has little foundation in truth. The story is based on comments made by Philipp Melanchthon, though it is thought that he was not in Wittenberg at the time.", "questions": ["What story has little foundation in truth?", "What story of little truth is a pillar of history?", "On whose comments is the posting on the door based?", "Where was Melanchthon at the time?", "What do scholars agree on about the posting on the door story?"]}, {"id": "7_17", "context": "It was not until January 1518 that friends of Luther translated the 95 Theses from Latin into German and printed and widely copied them, making the controversy one of the first in history to be aided by the printing press. Within two weeks, copies of the theses had spread throughout Germany; within two months, they had spread throughout Europe.", "questions": ["When was Luther's 95 Theses translated into German?", "What device was one of the first to aid a controversy?", "Who translated and printed Luther's 95 These?", "How long did it take for the Theses printing to spread thought Germany?", "How long did it take for the Theses to spread through Europe?"]}, {"id": "7_18", "context": "Luther's writings circulated widely, reaching France, England, and Italy as early as 1519. Students thronged to Wittenberg to hear Luther speak. He published a short commentary on Galatians and his Work on the Psalms. This early part of Luther's career was one of his most creative and productive. Three of his best-known works were published in 1520: To the Christian Nobility of the German Nation, On the Babylonian Captivity of the Church, and On the Freedom of a Christian.", "questions": ["When did Luther's writings to spread to France, England and Italy?", "Who went to Wittenberg to hear Luther speak?", "What part of Luther's career was one of his most productive?", "When were some of Luther's best-known works published?", "Besides publishing To the Christian Nobility of the German Nation and On the Babylonian Captivity of the Church, what other work did Luther produce in 1520?"]}, {"id": "7_19", "context": "From 1510 to 1520, Luther lectured on the Psalms, the books of Hebrews, Romans, and Galatians. As he studied these portions of the Bible, he came to view the use of terms such as penance and righteousness by the Catholic Church in new ways. He became convinced that the church was corrupt in its ways and had lost sight of what he saw as several of the central truths of Christianity. The most important for Luther was the doctrine of justification – God's act of declaring a sinner righteous – by faith alone through God's grace. He began to teach that salvation or redemption is a gift of God's grace, attainable only through faith in Jesus as the Messiah. \"This one and firm rock, which we call the doctrine of justification,\" he wrote, \"is the chief article of the whole Christian doctrine, which comprehends the understanding of all godliness.\"", "questions": ["What did Martin Luther do during 1510 to 1520?", "What sections of Church dogma did Luther come to view in another way?", "What did Luther decide about the Catholic Church?", "What, to Luther had the Church lost sight of?", "What is the central article of the Christian doctrine?"]}, {"id": "7_20", "context": "Luther came to understand justification as entirely the work of God. This teaching by Luther was clearly expressed in his 1525 publication On the Bondage of the Will, which was written in response to On Free Will by Desiderius Erasmus (1524). Luther based his position on predestination on St. Paul's epistle to the Ephesians 2:8–10. Against the teaching of his day that the righteous acts of believers are performed in cooperation with God, Luther wrote that Christians receive such righteousness entirely from outside themselves; that righteousness not only comes from Christ but actually is the righteousness of Christ, imputed to Christians (rather than infused into them) through faith. \"That is why faith alone makes someone just and fulfills the law,\" he wrote. \"Faith is that which brings the Holy Spirit through the merits of Christ.\" Faith, for Luther, was a gift from God; the experience of being justified by faith was \"as though I had been born again.\" His entry into Paradise, no less, was a discovery about \"the righteousness of God\" – a discovery that \"the just person\" of whom the Bible speaks (as in Romans 1:17) lives by faith. He explained his concept of \"justification\" in the Smalcald Articles:", "questions": ["Of whom, to Luther, was justification entirely the work ?", "When did Luther publish On the Bondage of the Will?", "What did Luther consider faith to be?", "Where did Luther explain his idea of justification?", "By what did Luther believe the just person lives?"]}, {"id": "7_21", "context": "Luther's rediscovery of \"Christ and His salvation\" was the first of two points that became the foundation for the Reformation. His railing against the sale of indulgences was based on it.", "questions": ["What was the first point of the Reformation?", "What became the foundation of the Reformation?", "What fueled Luther's  concept of Christ and His Salvation?", "How many points are there in the foundation of the Reformation?"]}, {"id": "7_22", "context": "Archbishop Albrecht of Mainz and Magdeburg did not reply to Luther's letter containing the 95 Theses. He had the theses checked for heresy and in December 1517 forwarded them to Rome. He needed the revenue from the indulgences to pay off a papal dispensation for his tenure of more than one bishopric. As Luther later noted, \"the pope had a finger in the pie as well, because one half was to go to the building of St Peter's Church in Rome\".", "questions": ["To whom did Luther send a letter containing his 95 Theses?", "After Archbishop Albrecht reviewed the Theses, where did he send them?", "What did Albrecht need the indulgences to pay for?", "How much of the indulgences went to Rome?", "When did Archbishop Albrecht send Luther's letter containing the 95 Theses to Rome?"]}, {"id": "7_23", "context": "Pope Leo X was used to reformers and heretics, and he responded slowly, \"with great care as is proper.\" Over the next three years he deployed a series of papal theologians and envoys against Luther, which served only to harden the reformer's anti-papal theology. First, the Dominican theologian Sylvester Mazzolini drafted a heresy case against Luther, whom Leo then summoned to Rome. The Elector Frederick persuaded the pope to have Luther examined at Augsburg, where the Imperial Diet was held. There, in October 1518, under questioning by papal legate Cardinal Cajetan Luther stated that he did not consider the papacy part of the biblical Church because historistical interpretation of Bible prophecy concluded that the papacy was the Antichrist. The prophecies concerning the Antichrist soon became the center of controversy. The hearings degenerated into a shouting match. More than his writing the 95 Theses, Luther's confrontation with the church cast him as an enemy of the pope. Cajetan's original instructions had been to arrest Luther if he failed to recant, but the legate desisted from doing so. Luther slipped out of the city at night, unbeknownst to Cajetan.", "questions": ["Which Pope sought to undermine Luther's theories?", "What did Pope Leo X launch against Luther?", "When was Luther examined at Augsburg by the papal legate?", "What did Luther tell the legate about the papacy?", "What were the papal legate's orders from the Pope?"]}, {"id": "7_24", "context": "In January 1519, at Altenburg in Saxony, the papal nuncio Karl von Miltitz adopted a more conciliatory approach. Luther made certain concessions to the Saxon, who was a relative of the Elector, and promised to remain silent if his opponents did. The theologian Johann Eck, however, was determined to expose Luther's doctrine in a public forum. In June and July 1519, he staged a disputation with Luther's colleague Andreas Karlstadt at Leipzig and invited Luther to speak. Luther's boldest assertion in the debate was that Matthew 16:18 does not confer on popes the exclusive right to interpret scripture, and that therefore neither popes nor church councils were infallible. For this, Eck branded Luther a new Jan Hus, referring to the Czech reformer and heretic burned at the stake in 1415. From that moment, he devoted himself to Luther's defeat.", "questions": ["When did papal nuncio Karl von Miltitz get Luther to make concessions ?", "What did Luther promise to do as a concession?", "Who was determined to expose Luther at this time?", "What scripture did Luther use to back up his opinion that churchmen were not infallible?", "What did Johann Eck call Luther?"]}, {"id": "7_25", "context": "On 15 June 1520, the Pope warned Luther with the papal bull (edict) Exsurge Domine that he risked excommunication unless he recanted 41 sentences drawn from his writings, including the 95 Theses, within 60 days. That autumn, Johann Eck proclaimed the bull in Meissen and other towns. Karl von Miltitz, a papal nuncio, attempted to broker a solution, but Luther, who had sent the Pope a copy of On the Freedom of a Christian in October, publicly set fire to the bull and decretals at Wittenberg on 10 December 1520, an act he defended in Why the Pope and his Recent Book are Burned and Assertions Concerning All Articles. As a consequence, Luther was excommunicated by Pope Leo X on 3 January 1521, in the bull Decet Romanum Pontificem.", "questions": ["When did the Pope warned Luther of excommunication? ", "What did Luther need to do to avoid excommunication? ", "What was the time limit on Luther's recantation of sentences?", "Who attempted to arrange a compromise?", "When did Pope Leo X  excommunicate Luther? "]}, {"id": "7_26", "context": "The enforcement of the ban on the 95 Theses fell to the secular authorities. On 18 April 1521, Luther appeared as ordered before the Diet of Worms. This was a general assembly of the estates of the Holy Roman Empire that took place in Worms, a town on the Rhine. It was conducted from 28 January to 25 May 1521, with Emperor Charles V presiding. Prince Frederick III, Elector of Saxony, obtained a safe conduct for Luther to and from the meeting.", "questions": ["What authority enforced the ban on the 95 Theses?", "When did Luther appeared before the Diet of Worms?", "Of what was the Diet of Worms an assembly? ", "Who presided over the assembly?", "Who got a safe conduct pass for Luther to come and leave the event?"]}, {"id": "7_27", "context": "Johann Eck, speaking on behalf of the Empire as assistant of the Archbishop of Trier, presented Luther with copies of his writings laid out on a table and asked him if the books were his, and whether he stood by their contents. Luther confirmed he was their author, but requested time to think about the answer to the second question. He prayed, consulted friends, and gave his response the next day:", "questions": ["Who spoke to Luther about his books on behalf of the Empire?", "To whom was Johann Eck the assistant?", "After asking if the books were his, what else did Eck ask Luther?", "When did Luther give his response to Eck?", "How did Luther respond after being asked if the books were his?"]}, {"id": "7_28", "context": "At the end of this speech, Luther raised his arm \"in the traditional salute of a knight winning a bout.\" Michael Mullett considers this speech as a \"world classic of epoch-making oratory.\"", "questions": ["What did Luther do at the end of his speech?", "What was the style of Luther's salute at the end of his speech?", "Who considers Luther's speech a world classic?", "What did Michael Mullet call Luther's speech?"]}, {"id": "7_29", "context": "Luther refused to recant his writings. He is sometimes also quoted as saying: \"Here I stand. I can do no other\". Recent scholars consider the evidence for these words to be unreliable, since they were inserted before \"May God help me\" only in later versions of the speech and not recorded in witness accounts of the proceedings. However, Mullett suggests that given his nature, \"we are free to believe that Luther would tend to select the more dramatic form of words.\"", "questions": ["What did Luther refuse to do?", "Who said, \"Here I stand. I can do no other\"?", "Why is the statement doubtful in the eyes of scholars?", "What manner of words does Mullet think Luther would choose?"]}, {"id": "7_30", "context": "Over the next five days, private conferences were held to determine Luther's fate. The Emperor presented the final draft of the Edict of Worms on 25 May 1521, declaring Luther an outlaw, banning his literature, and requiring his arrest: \"We want him to be apprehended and punished as a notorious heretic.\" It also made it a crime for anyone in Germany to give Luther food or shelter. It permitted anyone to kill Luther without legal consequence.", "questions": ["How was the fate of Luther decided?", "When was the Edict of Worms presented?", "Who presented the Edict of Worms declaring Luther to be an outlaw?", "Besides declaring Luther to be an outlaw and banning his works, what else was decided?", "What could anyone do to Martin Luther without legal consequence?"]}, {"id": "7_31", "context": "Luther's disappearance during his return trip back to Wittenberg was planned. Frederick III had him intercepted on his way home in the forest near Wittenberg by masked horsemen who were made to appear as armed highwaymen. They escorted Luther to the security of the Wartburg Castle at Eisenach. During his stay at Wartburg, which he referred to as \"my Patmos\", Luther translated the New Testament from Greek into German and poured out doctrinal and polemical writings. These included a renewed attack on Archbishop Albrecht of Mainz, whom he shamed into halting the sale of indulgences in his episcopates, and a \"Refutation of the Argument of Latomus,\" in which he expounded the principle of justification to Jacobus Latomus, an orthodox theologian from Louvain.", "questions": ["What was planned for Luther by Frederick III after the meeting?", "Where did the highwaymen take Luther?", "What did Luther call his stay a Wartburg Castle?", "What book did Luther translate into German at this time?", "How did Luther persuade Archbishop Albrecht to stop the sale of indulgences?"]}, {"id": "7_32", "context": "In this work, one of his most emphatic statements on faith, he argued that every good work designed to attract God's favor is a sin. All humans are sinners by nature, he explained, and God's grace (which cannot be earned) alone can make them just. On 1 August 1521, Luther wrote to Melanchthon on the same theme: \"Be a sinner, and let your sins be strong, but let your trust in Christ be stronger, and rejoice in Christ who is the victor over sin, death, and the world. We will commit sins while we are here, for this life is not a place where justice resides.\"", "questions": ["What did Luther call good works that existed solely to attract God's favor?", "What did Luther explain about acquiring God's grace?", "When did Luther write to Melanchhon about God's grace?", "What did Luther expound to be greater than sin?", "What does Luther write that this life doesn't have?"]}, {"id": "7_33", "context": "In the summer of 1521, Luther widened his target from individual pieties like indulgences and pilgrimages to doctrines at the heart of Church practices. In On the Abrogation of the Private Mass, he condemned as idolatry the idea that the mass is a sacrifice, asserting instead that it is a gift, to be received with thanksgiving by the whole congregation. His essay On Confession, Whether the Pope has the Power to Require It rejected compulsory confession and encouraged private confession and absolution, since \"every Christian is a confessor.\" In November, Luther wrote The Judgement of Martin Luther on Monastic Vows. He assured monks and nuns that they could break their vows without sin, because vows were an illegitimate and vain attempt to win salvation.", "questions": ["When did Luther broaden his attacks to include core Church doctrines?", "How did Luther describe the mass that was viewed as sacrifice?", "What did Luther call the mass instead of sacrifice?", "After rejecting compulsory confession, what did Luther call for?", "What did Luther tell monks and nuns about their vows?"]}, {"id": "7_34", "context": "In 1521 Luther dealt largely with prophecy, in which he broadened the foundations of the Reformation placing them on prophetic faith. His main interest was centered on the prophecy of the Little Horn in Daniel 8:9–12, 23–25. The antichrist of 2 Thessalonians 2 was identified as the power of the Papacy. So too was the Little Horn of Daniel 7, coming up among the divisions of Rome, explicitly applied.", "questions": ["How did Luther broaden the Reformation in terms of prophecy?", "When did Luther start preaching Prophetic faith?", "At this time where was Luther's focus centered?", "What is the prophecy in Daniel that interested Luther?", "What did Luther identify the Papacy as?"]}, {"id": "7_35", "context": "Luther made his pronouncements from Wartburg in the context of rapid developments at Wittenberg, of which he was kept fully informed. Andreas Karlstadt, supported by the ex-Augustinian Gabriel Zwilling, embarked on a radical programme of reform there in June 1521, exceeding anything envisaged by Luther. The reforms provoked disturbances, including a revolt by the Augustinian friars against their prior, the smashing of statues and images in churches, and denunciations of the magistracy. After secretly visiting Wittenberg in early December 1521, Luther wrote A Sincere Admonition by Martin Luther to All Christians to Guard Against Insurrection and Rebellion. Wittenberg became even more volatile after Christmas when a band of visionary zealots, the so-called Zwickau prophets, arrived, preaching revolutionary doctrines such as the equality of man, adult baptism, and Christ's imminent return. When the town council asked Luther to return, he decided it was his duty to act.", "questions": ["Who supported Andreas Karistadt in reform at Wittenberg?", "When did Zwilling and Karistadt become active at Wittenberg?", "What did the reforms cause?", "What group was responsible for causing more violence in Wittenberg?", "Who asked Luther to return to the city?"]}, {"id": "7_36", "context": "Luther secretly returned to Wittenberg on 6 March 1522. He wrote to the Elector: \"During my absence, Satan has entered my sheepfold, and committed ravages which I cannot repair by writing, but only by my personal presence and living word.\" For eight days in Lent, beginning on Invocavit Sunday, 9 March, Luther preached eight sermons, which became known as the \"Invocavit Sermons\". In these sermons, he hammered home the primacy of core Christian values such as love, patience, charity, and freedom, and reminded the citizens to trust God's word rather than violence to bring about necessary change.", "questions": ["When did Luther return to Wittenberg?", "What did Luther think was required to stop the violence?", "What did Luther do during Lent at this time?", "What are the eight sermons called that Luther preached in March 1522?", "How did Luther want people to bring about change?"]}, {"id": "7_37", "context": "The effect of Luther's intervention was immediate. After the sixth sermon, the Wittenberg jurist Jerome Schurf wrote to the elector: \"Oh, what joy has Dr. Martin's return spread among us! His words, through divine mercy, are bringing back every day misguided people into the way of the truth.\"", "questions": ["How quick was the effect of Luther's preaching?", "Who wrote a resounding letter to the elector praising Luther?", "At what point in Luther's sermons did Schurf write to the elector?", "What did Schurf's letter say  Luther's return caused?", "What type of people were being brought back to the way of truth?"]}, {"id": "7_38", "context": "Luther next set about reversing or modifying the new church practices. By working alongside the authorities to restore public order, he signalled his reinvention as a conservative force within the Reformation. After banishing the Zwickau prophets, he now faced a battle against not only the established Church but also the radical reformers who threatened the new order by fomenting social unrest and violence.", "questions": ["What did Luther seek to restore?", "What was Luther's force within the Reformation?", "Who did Luther banish?", "What did the radical reformers cause in the new order?", "Besides the radicals who else did Luther have to deal with?"]}, {"id": "7_39", "context": "Despite his victory in Wittenberg, Luther was unable to stifle radicalism further afield. Preachers such as Zwickau prophet Nicholas Storch and Thomas Müntzer helped instigate the German Peasants' War of 1524–25, during which many atrocities were committed, often in Luther's name. There had been revolts by the peasantry on a smaller scale since the 15th century. Luther's pamphlets against the Church and the hierarchy, often worded with \"liberal\" phraseology, now led many peasants to believe he would support an attack on the upper classes in general. Revolts broke out in Franconia, Swabia, and Thuringia in 1524, even drawing support from disaffected nobles, many of whom were in debt. Gaining momentum under the leadership of radicals such as Müntzer in Thuringia and Michael Gaismair in Tyrol, the revolts turned into war.", "questions": ["What was Nicholas Storch ?", "What event did Storch and Muntzer help instigate?", "When did The German Peasants War happen?", "What did the peasants believe Luther would do for them?", "Who did the peasants think Luther would support an attack on?"]}, {"id": "7_40", "context": "Luther sympathised with some of the peasants' grievances, as he showed in his response to the Twelve Articles in May 1525, but he reminded the aggrieved to obey the temporal authorities. During a tour of Thuringia, he became enraged at the widespread burning of convents, monasteries, bishops' palaces, and libraries. In Against the Murderous, Thieving Hordes of Peasants, written on his return to Wittenberg, he gave his interpretation of the Gospel teaching on wealth, condemned the violence as the devil's work, and called for the nobles to put down the rebels like mad dogs:", "questions": ["Who did Luther remind the peasants to obey?", "Where did Luther become angry at the widespread destruction of church property?", "What did Luther call the revolting peasants?", "How did Luther express the destruction?", "Who did Luther call on to stop the revolt?"]}, {"id": "7_41", "context": "Luther justified his opposition to the rebels on three grounds. First, in choosing violence over lawful submission to the secular government, they were ignoring Christ's counsel to \"Render unto Caesar the things that are Caesar's\"; St. Paul had written in his epistle to the Romans 13:1–7 that all authorities are appointed by God and therefore should not be resisted. This reference from the Bible forms the foundation for the doctrine known as the Divine Right of Kings, or, in the German case, the divine right of the princes. Second, the violent actions of rebelling, robbing, and plundering placed the peasants \"outside the law of God and Empire\", so they deserved \"death in body and soul, if only as highwaymen and murderers.\" Lastly, Luther charged the rebels with blasphemy for calling themselves \"Christian brethren\" and committing their sinful acts under the banner of the Gospel.", "questions": ["How many ways did Luther justify his opposition to revolt?", "What were the protesters doing with Christ's counsel?", "By whom did St Paul say all authorities were appointed?", "What is this doctrine of God appointing authorities called?", "What kind of death did Luther say the revolting peasants deserve?"]}, {"id": "7_42", "context": "Without Luther's backing for the uprising, many rebels laid down their weapons; others felt betrayed. Their defeat by the Swabian League at the Battle of Frankenhausen on 15 May 1525, followed by Müntzer's execution, brought the revolutionary stage of the Reformation to a close. Thereafter, radicalism found a refuge in the anabaptist movement and other religious movements, while Luther's Reformation flourished under the wing of the secular powers.", "questions": ["What did Luther deny the rebels?", "Who defeated the rebels at the Battle of Frankenhausen?", "When was the Battle of Frankenhausen?", "What event followed the battle?", "What protection caused Luther's Reformation to flourish?"]}, {"id": "7_43", "context": "Martin Luther married Katharina von Bora, one of 12 nuns he had helped escape from the Nimbschen Cistercian convent in April 1523, when he arranged for them to be smuggled out in herring barrels. \"Suddenly, and while I was occupied with far different thoughts,\" he wrote to Wenceslaus Link, \"the Lord has plunged me into marriage.\" At the time of their marriage, Katharina was 26 years old and Luther was 41 years old.", "questions": ["Who did Martin Luther marry?", "How did Luther smuggle 12 nuns out of a convent during the rebellion?", "How old was Katharina when she married Luther?", "How old was Martin Luther when he married?", "When did Luther save the group of nuns from the convent?"]}, {"id": "7_44", "context": "On 13 June 1525, the couple was engaged with Johannes Bugenhagen, Justus Jonas, Johannes Apel, Philipp Melanchthon and Lucas Cranach the Elder and his wife as witnesses. On the evening of the same day, the couple was married by Bugenhagen. The ceremonial walk to the church and the wedding banquet were left out, and were made up two weeks later on 27 June.", "questions": ["When were Luther and his prospective bride engaged?", "At what point in the day was the couple married?", "Besides the walk to the church, what else was left out of the day's celebration?", "When was the wedding banquet celebrated?", "Who married the wedding couple?"]}, {"id": "7_45", "context": "Some priests and former religious had already married, including Andreas Karlstadt and Justus Jonas, but Luther's wedding set the seal of approval on clerical marriage. He had long condemned vows of celibacy on Biblical grounds, but his decision to marry surprised many, not least Melanchthon, who called it reckless. Luther had written to George Spalatin on 30 November 1524, \"I shall never take a wife, as I feel at present. Not that I am insensible to my flesh or sex (for I am neither wood nor stone); but my mind is averse to wedlock because I daily expect the death of a heretic.\" Before marrying, Luther had been living on the plainest food, and, as he admitted himself, his mildewed bed was not properly made for months at a time.", "questions": ["What was Luther's marriage seen as by others?", "What kind of marriage was this ?", "Why did Luther condemn vows of celibacy?", "What did Luther fear to cause him to avoid marriage?", "What did Melanchthon call the marriage?"]}, {"id": "7_46", "context": "Luther and his wife moved into a former monastery, \"The Black Cloister,\" a wedding present from the new elector John the Steadfast (1525–32). They embarked on what appeared to have been a happy and successful marriage, though money was often short. Between bearing six children, Hans – June 1526; Elizabeth – 10 December 1527, who died within a few months; Magdalene – 1529, who died in Luther's arms in 1542; Martin – 1531; Paul – January 1533; and Margaret – 1534; Katharina helped the couple earn a living by farming the land and taking in boarders. Luther confided to Michael Stiefel on 11 August 1526: \"My Katie is in all things so obliging and pleasing to me that I would not exchange my poverty for the riches of Croesus.\"", "questions": ["When did Luther and his wife live?", "What was the Black Cloister?", "How many children did Luther and his wife have?", "What did Luther state he would not exchange for his life with his wife?", "Besides taking in boarders, how did Katharina help support the family?"]}, {"id": "7_47", "context": "By 1526, Luther found himself increasingly occupied in organising a new church. His Biblical ideal of congregations' choosing their own ministers had proved unworkable. According to Bainton: \"Luther's dilemma was that he wanted both a confessional church based on personal faith and experience and a territorial church including all in a given locality. If he were forced to choose, he would take his stand with the masses, and this was the direction in which he moved.\" From 1525 to 1529, he established a supervisory church body, laid down a new form of worship service, and wrote a clear summary of the new faith in the form of two catechisms. Luther's thought is revolutionary to the extent that it is a theology of the cross, the negation of every affirmation: as long as the cross is at the center, the system building tendency of reason is held in check, and system building does not degenerate into System.", "questions": ["In organizing a new church, what did Luther find to be unworkable for congregations?", "What did Luther form in 1525 to 1529?", "What did Luther establish as a worship service in his church?", "What did Luther write as an outline of the new faith?", "What is Luther's thought about the extent of his church?"]}, {"id": "7_48", "context": "To avoid confusing or upsetting the people, Luther avoided extreme change. He also did not wish to replace one controlling system with another. He concentrated on the church in the Electorate of Saxony, acting only as an adviser to churches in new territories, many of which followed his Saxon model. He worked closely with the new elector, John the Steadfast, to whom he turned for secular leadership and funds on behalf of a church largely shorn of its assets and income after the break with Rome. For Luther's biographer Martin Brecht, this partnership \"was the beginning of a questionable and originally unintended development towards a church government under the temporal sovereign\". The elector authorised a visitation of the church, a power formerly exercised by bishops. At times, Luther's practical reforms fell short of his earlier radical pronouncements. For example, the Instructions for the Visitors of Parish Pastors in Electoral Saxony (1528), drafted by Melanchthon with Luther's approval, stressed the role of repentance in the forgiveness of sins, despite Luther's position that faith alone ensures justification. The Eisleben reformer Johannes Agricola challenged this compromise, and Luther condemned him for teaching that faith is separate from works. The Instruction is a problematic document for those seeking a consistent evolution in Luther's thought and practice.", "questions": ["What did Luther try to avoid in setting up his church?", "Where was Luther mostly concentrating his efforts on reform?", "What role did Luther play in other areas' churches?", "Who was the new elector of Saxony?", "What unintended development did the relationship with the elector have on church government?"]}, {"id": "7_49", "context": "In response to demands for a German liturgy, Luther wrote a German Mass, which he published in early 1526. He did not intend it as a replacement for his 1523 adaptation of the Latin Mass but as an alternative for the \"simple people\", a \"public stimulation for people to believe and become Christians.\" Luther based his order on the Catholic service but omitted \"everything that smacks of sacrifice\"; and the Mass became a celebration where everyone received the wine as well as the bread. He retained the elevation of the host and chalice, while trappings such as the Mass vestments, altar, and candles were made optional, allowing freedom of ceremony. Some reformers, including followers of Huldrych Zwingli, considered Luther's service too papistic; and modern scholars note the conservatism of his alternative to the Catholic mass. Luther's service, however, included congregational singing of hymns and psalms in German, as well as of parts of the liturgy, including Luther's unison setting of the Creed. To reach the simple people and the young, Luther incorporated religious instruction into the weekday services in the form of the catechism. He also provided simplified versions of the baptism and marriage services.", "questions": ["When did Luther write  a German mass?", "What did Luther not mean for the new mass to replace?", "For whom was this new mass intended?", "What parts of the original Catholic mass did Luther leave out of  his new mass?", "What did the new mass allow as regards ceremony?"]}, {"id": "7_50", "context": "Luther and his colleagues introduced the new order of worship during their visitation of the Electorate of Saxony, which began in 1527. They also assessed the standard of pastoral care and Christian education in the territory. \"Merciful God, what misery I have seen,\" Luther wrote, \"the common people knowing nothing at all of Christian doctrine ... and unfortunately many pastors are well-nigh unskilled and incapable of teaching.\"", "questions": ["When did Luther introduce the new worship?", "What began in 1527 when Luther introdued the new order of worship?", "What type of education was assessed during this time?", "What did Luther say the common people knew nothing about?", "What were many pastors unable to do?"]}, {"id": "7_51", "context": "Luther devised the catechism as a method of imparting the basics of Christianity to the congregations. In 1529, he wrote the Large Catechism, a manual for pastors and teachers, as well as a synopsis, the Small Catechism, to be memorised by the people themselves. The catechisms provided easy-to-understand instructional and devotional material on the Ten Commandments, the Apostles' Creed, the Lord's Prayer, baptism, and the Lord's Supper. Luther incorporated questions and answers in the catechism so that the basics of Christian faith would not just be learned by rote, \"the way monkeys do it\", but understood.", "questions": ["What did Luther devise to teach  Christianity to the congregation?", "When did Luther write the Large Catechism?", "To whom was the Large Catechism directed?", "For whom was the Small Catechism meant?", "What did Luther add to his catechisms?"]}, {"id": "7_52", "context": "The catechism is one of Luther's most personal works. \"Regarding the plan to collect my writings in volumes,\" he wrote, \"I am quite cool and not at all eager about it because, roused by a Saturnian hunger, I would rather see them all devoured. For I acknowledge none of them to be really a book of mine, except perhaps the Bondage of the Will and the Catechism.\" The Small Catechism has earned a reputation as a model of clear religious teaching. It remains in use today, along with Luther's hymns and his translation of the Bible.", "questions": ["What was one of Luther's most personal writings?", "What effort was Luther not particularly in favor of?", "Besides the Bondage of the Will, what other work did Luther view as a book of his?", "What work of Luther's is seen as a clear religious teaching?", "What translation of Luther's is still used today?"]}, {"id": "7_53", "context": "Luther's Small Catechism proved especially effective in helping parents teach their children; likewise the Larger Catechism was effective for pastors. Using the German vernacular, they expressed the Apostles' Creed in simpler, more personal, Trinitarian language. He rewrote each article of the Creed to express the character of the Father, the Son, or the Holy Spirit. Luther's goal was to enable the catechumens to see themselves as a personal object of the work of the three persons of the Trinity, each of which works in the catechumen's life. That is, Luther depicted the Trinity not as a doctrine to be learned, but as persons to be known. The Father creates, the Son redeems, and the Spirit sanctifies, a divine unity with separate personalities. Salvation originates with the Father and draws the believer to the Father. Luther's treatment of the Apostles' Creed must be understood in the context of the Decalogue (the Ten Commandments) and the Lord's Prayer, which are also part of the Lutheran catechical teaching.", "questions": ["Which work of Luther's is effective in teaching children?", "What work is useful for pastors?", "What are the Catechisms of Martin Luther written in?", "How did Luther show the Trinity in his catechisms?", "Where does Luther place Salvation?"]}, {"id": "7_54", "context": "Luther had published his German translation of the New Testament in 1522, and he and his collaborators completed the translation of the Old Testament in 1534, when the whole Bible was published. He continued to work on refining the translation until the end of his life. Others had translated the Bible into German, but Luther tailored his translation to his own doctrine. When he was criticised for inserting the word \"alone\" after \"faith\" in Romans 3:28, he replied in part: \"[T]he text itself and the meaning of St. Paul urgently require and demand it. For in that very passage he is dealing with the main point of Christian doctrine, namely, that we are justified by faith in Christ without any works of the Law. ... But when works are so completely cut away – and that must mean that faith alone justifies – whoever would speak plainly and clearly about this cutting away of works will have to say, 'Faith alone justifies us, and not works'.\"", "questions": ["When did Martin Luther publish his translation of the New Testament?", "When was the Old Testament translation finished?", "What did he work on refining until the end of his life?", "What word was Luther criticized for adding in Romans3:28?", "According to Luther what justifies us?"]}, {"id": "7_55", "context": "Luther's translation used the variant of German spoken at the Saxon chancellery, intelligible to both northern and southern Germans. He intended his vigorous, direct language to make the Bible accessible to everyday Germans, \"for we are removing impediments and difficulties so that other people may read it without hindrance.\"", "questions": ["Where was the language Luther used in his translations spoken?", "Which Germans could understand the language Luther used?", "What group did Luther want to understand his works?", "Why did he want to make the language accessible to people?", "To promote accessibility of the works, what did Luther remove?"]}, {"id": "7_56", "context": "Published at a time of rising demand for German-language publications, Luther's version quickly became a popular and influential Bible translation. As such, it made a significant contribution to the evolution of the German language and literature. Furnished with notes and prefaces by Luther, and with woodcuts by Lucas Cranach that contained anti-papal imagery, it played a major role in the spread of Luther's doctrine throughout Germany. The Luther Bible influenced other vernacular translations, such as William Tyndale's English Bible (1525 forward), a precursor of the King James Bible.", "questions": ["At the time of Martin Luther what was in demand?", "What work of Luther's became popular?", "What did the popularity of Luther's translation contribute to?", "What artist provided the woodcuts for Luther's Bible?", "Whose English translation of the Bible did the Luther Bible influence?"]}, {"id": "7_57", "context": "Luther was a prolific hymn-writer, authoring hymns such as \"Ein feste Burg ist unser Gott\" (\"A Mighty Fortress Is Our God\"), based on Psalm 46, and \"Vom Himmel hoch, da komm ich her\" (\"From Heaven Above to Earth I Come\"), based on Luke 2:11–12. Luther connected high art and folk music, also all classes, clergy and laity, men, women and children. His tool of choice for this connection was the singing of German hymns in connection with worship, school, home, and the public arena. He often accompanied the sung hymns with a lute, later recreated as the waldzither that became a national instrument of Germany in the 20th century.", "questions": ["In what type of work was Luther prolific?", "What art forms did Luther use to connect his hymns?", "What did Luther use to celebrate worship?", "What did Luther use as accompaniment to his hymns?", "What instrument became a national instrument in Germany?"]}, {"id": "7_58", "context": "Luther's hymns were frequently evoked by particular events in his life and the unfolding Reformation. This behavior started with his learning of the execution of Johann Esch and Heinrich Voes, the first individuals to be martyred by the Roman Catholic Church for Lutheran views, prompting Luther to write the hymn \"Ein neues Lied wir heben an\" (\"A new song we raise\"), which is generally known in English by John C. Messenger's translation by the title and first line \"Flung to the Heedless Winds\" and sung to the tune Ibstone composed in 1875 by Maria C. Tiddeman.", "questions": ["What caused Luther to write hymns?", "Why were Johann Esch and Heinrich Voes executed by the Catholic Church?", "What hymn did Luther write after the martyrdom of Esch and Voes?", "Who is the English translator of this hymn?", "What is the hymn known as in English?"]}, {"id": "7_59", "context": "Luther's 1524 creedal hymn \"Wir glauben all an einen Gott\" (\"We All Believe in One True God\") is a three-stanza confession of faith prefiguring Luther's 1529 three-part explanation of the Apostles' Creed in the Small Catechism. Luther's hymn, adapted and expanded from an earlier German creedal hymn, gained widespread use in vernacular Lutheran liturgies as early as 1525. Sixteenth-century Lutheran hymnals also included \"Wir glauben all\" among the catechetical hymns, although 18th-century hymnals tended to label the hymn as Trinitarian rather than catechetical, and 20th-century Lutherans rarely use the hymn because of the perceived difficulty of its tune.", "questions": ["When did Luther write Wir glauben all an einen Gott?", "What did this hymn presage?", "Where is the Apostles located?", "What earlier hymn was Luther's  adapted from?", "Why have modern Lutherans stopped using the hymn?"]}, {"id": "7_60", "context": "Luther's 1538 hymnic version of the Lord's Prayer, \"Vater unser im Himmelreich\", corresponds exactly to Luther's explanation of the prayer in the Small Catechism, with one stanza for each of the seven prayer petitions, plus opening and closing stanzas. The hymn functioned both as a liturgical setting of the Lord's Prayer and as a means of examining candidates on specific catechism questions. The extant manuscript shows multiple revisions, demonstrating Luther's concern to clarify and strengthen the text and to provide an appropriately prayerful tune. Other 16th- and 20th-century versifications of the Lord's Prayer have adopted Luther's tune, although modern texts are considerably shorter.", "questions": ["When did Luther produce a hymnic version of the Lord's Prayer?", "Where is the comparison found of this Lord's Prayer hymn?", "What was the hymn meant to examine students on?", "What does the original manuscript show?", "What do later versions of the Lord's Prayer hymn still use?"]}, {"id": "7_61", "context": "Luther wrote \"Aus tiefer Not schrei ich zu dir\" (\"From depths of woe I cry to you\") in 1523 as a hymnic version of Psalm 130 and sent it as a sample to encourage evangelical colleagues to write psalm-hymns for use in German worship. In a collaboration with Paul Speratus, this and seven other hymns were published in the Achtliederbuch, the first Lutheran hymnal. In 1524 Luther developed his original four-stanza psalm paraphrase into a five-stanza Reformation hymn that developed the theme of \"grace alone\" more fully. Because it expressed essential Reformation doctrine, this expanded version of \"Aus tiefer Not\" was designated as a regular component of several regional Lutheran liturgies and was widely used at funerals, including Luther's own. Along with Erhart Hegenwalt's hymnic version of Psalm 51, Luther's expanded hymn was also adopted for use with the fifth part of Luther's catechism, concerning confession.", "questions": ["When did Luther write the hymn From Depths of Woe I cry to You?", "What is the basis of the hymn?", "What did Luther use the hymn to encourage colleagues to do?", "What was the first Lutheran hymnal?", "What did the hymn, Aus tiefer Not express?"]}, {"id": "7_62", "context": "Luther wrote \"Ach Gott, vom Himmel sieh darein\" (\"Oh God, look down from heaven\"). \"Nun komm, der Heiden Heiland\" (Now come, Savior of the gentiles), based on Veni redemptor gentium, became the main hymn (Hauptlied) for Advent. He transformed A solus ortus cardine to \"Christum wir sollen loben schon\" (\"We should now praise Christ\") and Veni Creator Spiritus to \"Komm, Gott Schöpfer, Heiliger Geist\" (\"Come, Holy Spirit, Lord God\"). He wrote two hymns on the Ten Commandments, \"Dies sind die heilgen Zehn Gebot\" and \"Mensch, willst du leben seliglich\". His \"Gelobet seist du, Jesu Christ\" (\"Praise be to You, Jesus Christ\") became the main hymn for Christmas. He wrote for Pentecost \"Nun bitten wir den Heiligen Geist\", and adopted for Easter \"Christ ist erstanden\" (Christ is risen), based on Victimae paschali laudes. \"Mit Fried und Freud ich fahr dahin\", a paraphrase of Nunc dimittis, was intended for Purification, but became also a funeral hymn. He paraphrased the Te Deum as \"Herr Gott, dich loben wir\" with a simplified form of the melody. It became known as the German Te Deum.", "questions": ["Which of Luther's hymn was the main one for Advent?", "What was the hymn based on?", "What is a Hauptlied?", "How many hymns did Luther write based on the Ten Commandments?", "What did Herr Gott, dich loben wir become known as ?"]}, {"id": "7_63", "context": "Luther's 1541 hymn \"Christ unser Herr zum Jordan kam\" (\"To Jordan came the Christ our Lord\") reflects the structure and substance of his questions and answers concerning baptism in the Small Catechism. Luther adopted a preexisting Johann Walter tune associated with a hymnic setting of Psalm 67's prayer for grace; Wolf Heintz's four-part setting of the hymn was used to introduce the Lutheran Reformation in Halle in 1541. Preachers and composers of the 18th century, including J. S. Bach, used this rich hymn as a subject for their own work, although its objective baptismal theology was displaced by more subjective hymns under the influence of late-19th-century Lutheran pietism.", "questions": ["What does Luther's hymn Christ unser Herr zum jordan kam concern?", "Whose tune did Luther adapt for the hymn of Psalm 67?", "What is Psalm 67 about?", "What famous composer used a Lutheran hymn in his work?", "Where was the baptismal hymn used to introduce the Reformation?"]}, {"id": "7_64", "context": "Luther's hymns were included in early Lutheran hymnals and spread the ideas of the Reformation. He supplied four of eight songs of the First Lutheran hymnal Achtliederbuch, 18 of 26 songs of the Erfurt Enchiridion, and 24 of the 32 songs in the first choral hymnal with settings by Johann Walter, Eyn geystlich Gesangk Buchleyn, all published in 1524.", "questions": ["Where were Luther's hymns included?", "How many hymns of Luther were included in the Achtliederbuch?", "How many hymns did Luther contribute to the Erfurt Enchiridion?", "How many hymns did Luther write for the first choral hymnal?", "What was the title of the first choral hymnal?"]}, {"id": "7_65", "context": "Luther's hymns inspired composers to write music. Johann Sebastian Bach included several verses as chorales in his cantatas and based chorale cantatas entirely on them, namely Christ lag in Todes Banden, BWV 4, as early as possibly 1707, in his second annual cycle (1724 to 1725) Ach Gott, vom Himmel sieh darein, BWV 2, Christ unser Herr zum Jordan kam, BWV 7, Nun komm, der Heiden Heiland, BWV 62, Gelobet seist du, Jesu Christ, BWV 91, and Aus tiefer Not schrei ich zu dir, BWV 38, later Ein feste Burg ist unser Gott, BWV 80, and in 1735 Wär Gott nicht mit uns diese Zeit, BWV 14.", "questions": ["What composer used Luther's hymns in his works?", "What did Bach base entirely on Luther chorales?", "What is the earliest that Bach began using Luther hymns?", "In what years did Bach use more of Luther's hymns in his compositions?", "When was the last use by Bach of Luther's work?"]}, {"id": "7_66", "context": "In contrast to the views of John Calvin and Philipp Melanchthon, throughout his life Luther maintained that it was not false doctrine to believe that a Christian's soul sleeps after it is separated from the body in death; and, accordingly, he disputed traditional interpretations of some Bible passages, such as the parable of the rich man and Lazarus. This also led Luther to reject the idea of torments for the saints: \"It is enough for us to know that souls do not leave their bodies to be threatened by the torments and punishments of hell, but enter a prepared bedchamber in which they sleep in peace.\" He also rejected the existence of Purgatory, which involved Christian souls undergoing penitential suffering after death. He affirmed the continuity of one's personal identity beyond death. In his Smalcald Articles, he described the saints as currently residing \"in their graves and in heaven.\"", "questions": ["What did Luther believe that the soul does after death?", "What other doctrines did Luther disavow about saints?", "What did Luther expound happened to souls after death?", "What did Luther think of Purgatory?", "Where did Luther describe the resting place of the saints?"]}, {"id": "7_67", "context": "The Lutheran theologian Franz Pieper observed that Luther's teaching about the state of the Christian's soul after death differed from the later Lutheran theologians such as Johann Gerhard. Lessing (1755) had earlier reached the same conclusion in his analysis of Lutheran orthodoxy on this issue.", "questions": ["Who noticed that Luther's view of the soul after death differed from later theologians?", "What theologian differed in views about the soul from Luther?", "Who else observed that Luther view of souls was different form later views?", "When did Gerhard Lessing reach his conclusions about Luther?"]}, {"id": "7_68", "context": "Luther's Commentary on Genesis contains a passage which concludes that \"the soul does not sleep (anima non sic dormit), but wakes (sed vigilat) and experiences visions\". Francis Blackburne in 1765 argued that John Jortin misread this and other passages from Luther, while Gottfried Fritschel pointed out in 1867 that it actually refers to the soul of a man \"in this life\" (homo enim in hac vita) tired from his daily labour (defatigus diurno labore) who at night enters his bedchamber (sub noctem intrat in cubiculum suum) and whose sleep is interrupted by dreams.", "questions": ["Where did Luther say that the soul doesn't sleep, but rather has visions?", "Who stated that John Jortin misunderstood Luther?", "When did Blackburne make his argument about Luther and souls?", "Who pointed out that the passage under dispute actually refers to a living man?", "What did Fritschel say the man's sleep was disturbed by?"]}, {"id": "7_69", "context": "In October 1529, Philip I, Landgrave of Hesse, convoked an assembly of German and Swiss theologians at the Marburg Colloquy, to establish doctrinal unity in the emerging Protestant states. Agreement was achieved on fourteen points out of fifteen, the exception being the nature of the Eucharist – the sacrament of the Lord's Supper—an issue crucial to Luther.", "questions": ["When did Philip I convene an assembly to set doctrine in the Protestant states?", "Who was Philip I?", "What was the Marburg Colloquy meant to establish? ", "How many of the fifteen points of discussion were agreed on?", "What one point was not agreed on that was dear to Luther?"]}, {"id": "7_70", "context": "The theologians, including Zwingli, Melanchthon, Martin Bucer, and Johannes Oecolampadius, differed on the significance of the words spoken by Jesus at the Last Supper: \"This is my body which is for you\" and \"This cup is the new covenant in my blood\" (1 Corinthians 11:23–26). Luther insisted on the Real Presence of the body and blood of Christ in the consecrated bread and wine, which he called the sacramental union, while his opponents believed God to be only spiritually or symbolically present. Zwingli, for example, denied Jesus' ability to be in more than one place at a time but Luther stressed the omnipresence of his human nature. According to transcripts, the debate sometimes became confrontational. Citing Jesus' words \"The flesh profiteth nothing\" (John 6.63), Zwingli said, \"This passage breaks your neck\". \"Don't be too proud,\" Luther retorted, \"German necks don't break that easily. This is Hesse, not Switzerland.\" On his table Luther wrote the words \"Hoc est corpus meum\" (\"This is my body\") in chalk, to continually indicate his firm stance.", "questions": ["What point did the theologians differ on concerning the Last Supper?", "What did Luther insist was present in the bread and wine?", "What did Luther call  the consecrated bread and wine?", "What did Luther's opponents think that it meant about God's presence?", "What did the meeting often become in argument?"]}, {"id": "7_71", "context": "Despite the disagreements on the Eucharist, the Marburg Colloquy paved the way for the signing in 1530 of the Augsburg Confession, and for the formation of the Schmalkaldic League the following year by leading Protestant nobles such as John of Saxony, Philip of Hesse, and George, Margrave of Brandenburg-Ansbach. The Swiss cities, however, did not sign these agreements.", "questions": ["When was the Augsburg Confession signed?", "What paved the way for the Augsburg Confession?", "What did Protestant nobles form the following year after the signing of the Augsburg Confession?", "Which group did not agree to sign these agreements?", "What ruler, besides John of Saxony and Philip of Hesse, formed the Schmalkaldic League?"]}, {"id": "7_72", "context": "Some scholars have asserted that Luther taught that faith and reason were antithetical in the sense that questions of faith could not be illuminated by reason. He wrote, \"All the articles of our Christian faith, which God has revealed to us in His Word, are in presence of reason sheerly impossible, absurd, and false.\" and \"[That] Reason in no way contributes to faith. [...] For reason is the greatest enemy that faith has; it never comes to the aid of spiritual things.\" However, though seemingly contradictorily, he also wrote in the latter work that human reason \"strives not against faith, when enlightened, but rather furthers and advances it\", bringing claims he was a fideist into dispute. Contemporary Lutheran scholarship, however, has found a different reality in Luther. Luther rather seeks to separate faith and reason in order to honor the separate spheres of knowledge that each applies to. Bernhard Lohse, for example, has demonstrated in his classic work \"Fides und Ratio\" that Luther ultimately sought to put the two together. More recently, Hans-Peter Grosshans has demonstrated that Luther's work on Biblical Criticism stresses the need for external coherence in the right exegetical method. This means that for Luther it is more important that the Bible is reasonable according to the reality outside of the scriptures than that the Bible makes sense to itself, that it has internal coherence. The right tool for understanding the world outside of the Bible for Luther is none other than reason, which for him is the field of science, philosophy, history and empirical observation. Here a different picture is presented of a Luther who deeply valued both faith and reason, and held them in dialectical partnership. Luther's concern thus in separating them is honoring their different epistemological spheres.", "questions": ["What do scholars sometimes assert that Luther believed about what faith and reason were to each other?", "What did Luther think that faith could not be understood by?", "How did Luther say that reason contributes to faith?", "What was faith's greatest enemy according to Luther?", "By separating faith and reason, what does Luther honor?"]}, {"id": "7_73", "context": "In 1523, Luther wrote that Jesus Christ was born a Jew which discouraged mistreatment of the Jews and advocated their conversion by proving that the Old Testament could be shown to speak of Jesus Christ. However, as the Reformation continued, Luther began to lose hope in large-scale Jewish conversion to Christianity. In his later years, Luther grew more hostile toward the Jews, writing against them with the kind of venom he had already unleashed on the Anabaptists, Zwinglianism, and the papacy. His 1543 treatise Von den Juden und ihren Lügen (On the Jews and Their Lies) took its place among other anti-Jewish literature of the times, although historians acknowledge that this treatise was particularly extreme, even by the standards of sixteenth century Europe. In it, he takes a hardline against Judaism, writing that synagogues and Jewish homes should be destroyed, their money confiscated, and liberty curtailed. These statements and their influence on antisemitism have contributed to his controversial status.", "questions": ["What did Luther state as a means of discouraging mistreatment of Jews?", "What did Luther gradually see as hopeless in the Reformation?", "Who did Luther strike out against in later years?", "Luther treated Jews in a like way as he treated what group?", "When did Luther write an extreme treatise against the Jews?"]}, {"id": "7_74", "context": "At the time of the Marburg Colloquy, Suleiman the Magnificent was besieging Vienna with a vast Ottoman army. Luther had argued against resisting the Turks in his 1518 Explanation of the Ninety-five Theses, provoking accusations of defeatism. He saw the Turks as a scourge sent to punish Christians by God, as agents of the Biblical apocalypse that would destroy the antichrist, whom Luther believed to be the papacy, and the Roman Church. He consistently rejected the idea of a Holy War, \"as though our people were an army of Christians against the Turks, who were enemies of Christ. This is absolutely contrary to Christ's doctrine and name\". On the other hand, in keeping with his doctrine of the two kingdoms, Luther did support non-religious war against the Turks. In 1526, he argued in Whether Soldiers can be in a State of Grace that national defence is reason for a just war. By 1529, in On War against the Turk, he was actively urging Emperor Charles V and the German people to fight a secular war against the Turks. He made clear, however, that the spiritual war against an alien faith was separate, to be waged through prayer and repentance. Around the time of the Siege of Vienna, Luther wrote a prayer for national deliverance from the Turks, asking God to \"give to our emperor perpetual victory over our enemies\".", "questions": ["How did Luther view the Ottoman Turks?", "What was the purpose of the Turks in Luther's mind?", "Since Luther believed that the Turks were sent by God, what was their purpose?", "Who did Luther view to be the Antichrist?", "What kind of war did Luther support against the Turks, even if he did not oppose a religious war?"]}, {"id": "7_75", "context": "In 1542, Luther read a Latin translation of the Qur'an. He went on to produce several critical pamphlets on Islam, which he called \"Mohammedanism\" or \"the Turk\". Though Luther saw the Muslim faith as a tool of the devil, he was indifferent to its practice: \"Let the Turk believe and live as he will, just as one lets the papacy and other false Christians live.\" He opposed banning the publication of the Qur'an, wanting it exposed to scrutiny.", "questions": ["What book did Luther read in 1542?", "What type of writings did the reading of the Qur'an bring out in Luther?", "What were Mohammedanism and the Turk?", "How did Luther view Islam?", "What purpose would Luther have in not wanting to ban the Qur'an?"]}, {"id": "7_76", "context": "Early in 1537, Johannes Agricola (1494–1566) – serving at the time as pastor in Luther's birthplace, Eisleben – preached a sermon in which he claimed that God's gospel, not God's moral law (the Ten Commandments), revealed God's wrath to Christians. Based on this sermon and others by Agricola, Luther suspected that Agricola was behind certain anonymous antinomian theses circulating in Wittenberg. These theses asserted that the law is no longer to be taught to Christians but belonged only to city hall. Luther responded to these theses with six series of theses against Agricola and the antinomians, four of which became the basis for disputations between 1538 and 1540. He also responded to these assertions in other writings, such as his 1539 open letter to C. Güttel Against the Antinomians, and his book On the Councils and the Church from the same year.", "questions": ["What did Johannes Agricola preach that God's gospel revealed?", "Who did Luther think was behind the antinomian theses circulating in Wittenberg?", "What did Agricola apparently believe about who should be in control  law?", "How did Luther respond to Agricola?", "What book did Luther write in response to Agricola and the antinomians?"]}, {"id": "7_77", "context": "In his theses and disputations against the antinomians, Luther reviews and reaffirms, on the one hand, what has been called the \"second use of the law,\" that is, the law as the Holy Spirit's tool to work sorrow over sin in man's heart, thus preparing him for Christ's fulfillment of the law offered in the gospel. Luther states that everything that is used to work sorrow over sin is called the law, even if it is Christ's life, Christ's death for sin, or God's goodness experienced in creation. Simply refusing to preach the Ten Commandments among Christians – thereby, as it were, removing the three letters l-a-w from the church – does not eliminate the accusing law. Claiming that the law – in any form – should not be preached to Christians anymore would be tantamount to asserting that Christians are no longer sinners in themselves and that the church consists only of essentially holy people.", "questions": ["What did Luther's answer to the antinomians reaffirms?", "What is the use of the law by the Holy Spirit?", "What is Luther's opinion of what the law covers??", "What does refusing to preach the Ten Commandments not do?", "What did Luther claim the church would have to comprise if the law were not taught?"]}, {"id": "7_78", "context": "On the other hand, Luther also points out that the Ten Commandments – when considered not as God's condemning judgment but as an expression of his eternal will, that is, of the natural law – also positively teach how the Christian ought to live. This has traditionally been called the \"third use of the law.\" For Luther, also Christ's life, when understood as an example, is nothing more than an illustration of the Ten Commandments, which a Christian should follow in his or her vocations on a daily basis.", "questions": ["What do the Ten Commandments teach Christians how to do?", "What is God's expression of eternal will, according to Luther?", "Teaching Christians how they should live is what use of the law?", "What did Luther consider Christ's life?", "What should a Christian follow in his life?"]}, {"id": "7_79", "context": "The Ten Commandments, and the beginnings of the renewed life of Christians accorded to them by the sacrament of baptism, are a present foreshadowing of the believers' future angel-like life in heaven in the midst of this life. Luther's teaching of the Ten Commandments, therefore, has clear eschatological overtones, which, characteristically for Luther, do not encourage world-flight but direct the Christian to service to the neighbor in the common, daily vocations of this perishing world.", "questions": ["What sacrament accords Christians renewed life?", "Besides baptism, what shows the future of heaven to Christians?", "What does the Ten Commandments ask of the Christians?"]}, {"id": "7_80", "context": "From December 1539, Luther became implicated in the bigamy of Philip I, Landgrave of Hesse, who wanted to marry one of his wife's ladies-in-waiting. Philip solicited the approval of Luther, Melanchthon, and Bucer, citing as a precedent the polygamy of the patriarchs. The theologians were not prepared to make a general ruling, and they reluctantly advised the landgrave that if he was determined, he should marry secretly and keep quiet about the matter. As a result, on 4 March 1540, Philip married a second wife, Margarethe von der Saale, with Melanchthon and Bucer among the witnesses. However, Philip was unable to keep the marriage secret, and he threatened to make Luther's advice public. Luther told him to \"tell a good, strong lie\" and deny the marriage completely, which Philip did during the subsequent public controversy. In the view of Luther's biographer Martin Brecht, \"giving confessional advice for Philip of Hesse was one of the worst mistakes Luther made, and, next to the landgrave himself, who was directly responsible for it, history chiefly holds Luther accountable\". Brecht argues that Luther's mistake was not that he gave private pastoral advice, but that he miscalculated the political implications. The affair caused lasting damage to Luther's reputation.", "questions": ["What did Philip I wish to do around 1539?", "What did Luther get implicated in concerning Philip I?", "Who did Philip I want to marry?", "Who does history view as accountable for the error Philip I made and Luther's advice in the matter?", "What did this affair cause to Luther's reputation?"]}, {"id": "7_81", "context": "Luther wrote about the Jews throughout his career, though only a few of his works dealt with them directly. Luther rarely encountered Jews during his life, but his attitudes reflected a theological and cultural tradition which saw Jews as a rejected people guilty of the murder of Christ, and he lived within a local community that had expelled Jews some ninety years earlier. He considered the Jews blasphemers and liars because they rejected the divinity of Jesus, whereas Christians believed Jesus was the Messiah. But Luther believed that all human beings who set themselves against God were equally guilty. As early as 1516, he wrote that many people \"are proud with marvelous stupidity when they call the Jews dogs, evildoers, or whatever they like, while they too, and equally, do not realize who or what they are in the sight of God\". In 1523, Luther advised kindness toward the Jews in That Jesus Christ was Born a Jew and also aimed to convert them to Christianity. When his efforts at conversion failed, he grew increasingly bitter toward them. In his 2010 book Bonhoeffer: Pastor, Martyr, Prophet, Spy, Christian author Eric Metaxas claimed that Luther's attitude towards Jews \"unraveled along with his health.\"", "questions": ["What had Luther's community done to Jews years earlier?", "Who did Luther write about, but seldom met?", "What did Luther's area and tradition believe Jews to be guilty of?", "What did Jews refuse to accept that caused Luther to call them blasphemers and liars?", "What did Luther try to do for the Jews?"]}, {"id": "7_82", "context": "Luther's other major works on the Jews were his 60,000-word treatise Von den Juden und Ihren Lügen (On the Jews and Their Lies), and Vom Schem Hamphoras und vom Geschlecht Christi (On the Holy Name and the Lineage of Christ), both published in 1543, three years before his death. Luther argued that the Jews were no longer the chosen people but \"the devil's people\", and referred to them with violent, vile language. Citing Deuteronomy 13, wherein Moses commands the killing of idolaters and the burning of their cities and property as an offering to God, Luther called for a \"scharfe Barmherzigkeit\" (\"sharp mercy\") against the Jews \"to see whether we might save at least a few from the glowing flames.\" Luther advocated setting synagogues on fire, destroying Jewish prayerbooks, forbidding rabbis from preaching, seizing Jews' property and money, and smashing up their homes, so that these \"envenomed worms\" would be forced into labour or expelled \"for all time\". In Robert Michael's view, Luther's words \"We are at fault in not slaying them\" amounted to a sanction for murder. \"God's anger with them is so intense,\" Luther concluded, \"that gentle mercy will only tend to make them worse, while sharp mercy will reform them but little. Therefore, in any case, away with them!\"", "questions": ["What was Luther's major work of 60,000 words on the Jews?", "When was the large work published?", "How near to his death was the work published?", "What did Luther contend the Jews to be?", "As what did Robert Michael view Luther's violent language towards the Jews?"]}, {"id": "7_83", "context": "Luther spoke out against the Jews in Saxony, Brandenburg, and Silesia. Josel of Rosheim, the Jewish spokesman who tried to help the Jews of Saxony in 1537, later blamed their plight on \"that priest whose name was Martin Luther—may his body and soul be bound up in hell!—who wrote and issued many heretical books in which he said that whoever would help the Jews was doomed to perdition.\" Josel asked the city of Strasbourg to forbid the sale of Luther's anti-Jewish works: they refused initially, but did so when a Lutheran pastor in Hochfelden used a sermon to urge his parishioners to murder Jews. Luther's influence persisted after his death. Throughout the 1580s, riots led to the expulsion of Jews from several German Lutheran states.", "questions": ["What did Luther speak out about in Saxony?", "Who did Josel of Rosheim blame for the condition of Jews in Saxony?", "What did Josel of Rosheim claimed that Luther said of those who might aid the Jews?", "What did Josel ask the city of Strasbourg to forbid the sale of?", "When did riots cause the expulsion of Jews from several German states?"]}, {"id": "7_84", "context": "Luther was the most widely read author of his generation, and within Germany he acquired the status of a prophet. According to the prevailing view among historians, his anti-Jewish rhetoric contributed significantly to the development of antisemitism in Germany, and in the 1930s and 1940s provided an \"ideal underpinning\" for the Nazis' attacks on Jews. Reinhold Lewin writes that anybody who \"wrote against the Jews for whatever reason believed he had the right to justify himself by triumphantly referring to Luther.\" According to Michael, just about every anti-Jewish book printed in the Third Reich contained references to and quotations from Luther. Heinrich Himmler wrote admiringly of his writings and sermons on the Jews in 1940. The city of Nuremberg presented a first edition of On the Jews and their Lies to Julius Streicher, editor of the Nazi newspaper Der Stürmer, on his birthday in 1937; the newspaper described it as the most radically anti-Semitic tract ever published. It was publicly exhibited in a glass case at the Nuremberg rallies and quoted in a 54-page explanation of the Aryan Law by Dr. E.H. Schulz and Dr. R. Frercks.", "questions": ["Who was the most widely read writer of his generation?", "What action by Luther added to antisemitism in Germany?", "What later actions by the Nazis could be traced back to Luther's rhetoric?", "Whose writings were widely quoted by the Third Reich?", "How did Der Sturmer describe Luther's On the Jews and their Lies"]}, {"id": "7_85", "context": "On 17 December 1941, seven Protestant regional church confederations issued a statement agreeing with the policy of forcing Jews to wear the yellow badge, \"since after his bitter experience Luther had already suggested preventive measures against the Jews and their expulsion from German territory.\" According to Daniel Goldhagen, Bishop Martin Sasse, a leading Protestant churchman, published a compendium of Luther's writings shortly after Kristallnacht, for which Diarmaid MacCulloch, Professor of the History of the Church in the University of Oxford argued that Luther's writing was a \"blueprint.\" Sasse applauded the burning of the synagogues and the coincidence of the day, writing in the introduction, \"On 10 November 1938, on Luther's birthday, the synagogues are burning in Germany.\" The German people, he urged, ought to heed these words \"of the greatest antisemite of his time, the warner of his people against the Jews.\"", "questions": ["When did seven Protestant churches agree with the Nazi policy of forcing Jews to wear yellow arm bands?", "Who did the churches claim had suggested expulsion of Jews from Germany?", "Who claimed Luther's writings were a blueprint of actions against Jews?", "Who agreed with the burning of synagogues?", "What did Sasse proclaim Luther to be?"]}, {"id": "7_86", "context": "At the heart of scholars' debate about Luther's influence is whether it is anachronistic to view his work as a precursor of the racial antisemitism of the Nazis. Some scholars see Luther's influence as limited, and the Nazis' use of his work as opportunistic. Biographer Martin Brecht points out that \"There is a world of difference between his belief in salvation and a racial ideology. Nevertheless, his misguided agitation had the evil result that Luther fatefully became one of the 'church fathers' of anti-Semitism and thus provided material for the modern hatred of the Jews, cloaking it with the authority of the Reformer.\" Johannes Wallmann argues that Luther's writings against the Jews were largely ignored in the 18th and 19th centuries, and that there was no continuity between Luther's thought and Nazi ideology. Uwe Siemon-Netto agreed, arguing that it was because the Nazis were already anti-Semites that they revived Luther's work. Hans J. Hillerbrand agreed that to focus on Luther was to adopt an essentially ahistorical perspective of Nazi antisemitism that ignored other contributory factors in German history. Similarly, Roland Bainton, noted church historian and Luther biographer, wrote \"One could wish that Luther had died before ever [On the Jews and Their Lies] was written. His position was entirely religious and in no respect racial.\"", "questions": ["How do some scholars view the Nazi use of Luther's work?", "What did Martin Brecht call Luther's stand on the Jews?", "What did this agitation provide later generations material for?", "When was Luther's writings about the Jews ignored, according to Johannes Wallmann?", "What did Roland Bainton say about Luther's position on Jews?"]}, {"id": "7_87", "context": "Other scholars argue that, even if his views were merely anti-Judaic—that is, opposed to Judaism and its adherence rather than the Jews as an ethnic group—their violence lent a new element to the standard Christian suspicion of Judaism. Ronald Berger writes that Luther is credited with \"Germanizing the Christian critique of Judaism and establishing anti-Semitism as a key element of German culture and national identity.\" Paul Rose argues that he caused a \"hysterical and demonizing mentality\" about Jews to enter German thought and discourse, a mentality that might otherwise have been absent. Christopher J. Probst in his book Demonizing the Jews: Luther and the Protestant Church in Nazi Germany (2012), shows that a large number of German Lutheran clergy and theologians during the Nazi Third Reich used Luther's hostile publications towards the Jews and their Jewish religion to justify at least in part the anti-Semitic policies of the National Socialists.", "questions": ["Other scholars contend that Luther's words lent what element to Christian suspicion of Jews?", "Who thinks that Luther added antisemitism as a cultural element to Germany?", "What did Paul Rose say Luther added to German thought?", "Who aide the Reich in Germany in antisemitism?", "What did these Lutheran clerics use as fuel to bolster the Policies of the Nazis?"]}, {"id": "7_88", "context": "Some scholars, such as Mark U. Edwards in his book Luther's Last Battles: Politics and Polemics 1531–46 (1983), suggest that since Luther's increasingly antisemitic views developed during the years his health deteriorated, it is possible they were at least partly the product of a declining state of mind. Edwards also comments that Luther often deliberately used \"vulgarity and violence\" for effect, both in his writings condemning the Jews and in diatribes against \"Turks\" (Muslims) and Catholics.", "questions": ["What does Mark U. Edwards claim as a possible cause of Luther's antisemitism?", "What about Luther declined as his antisemitism increased?", "What kind of affect did Luther often use in his discourses?", "Who else did Luther use violent rhetoric towards?", "What is the title of Edwards book about Luther?"]}, {"id": "7_89", "context": "Since the 1980s, Lutheran Church denominations have repudiated Martin Luther's statements against the Jews and have rejected the use of them to incite hatred against Lutherans. Strommen et al.'s 1970 survey of 4,745 North American Lutherans aged 15–65 found that, compared to the other minority groups under consideration, Lutherans were the least prejudiced toward Jews. Nevertheless, Professor Richard (Dick) Geary, former Professor of Modern History at the University of Nottingham, England, and the author of Hitler and Nazism (Routledge 1993), wrote in the journal History Today an article on who voted for the Nazis in elections held from 1928-1933, where he claimed that from his research he found that the Nazis gained disproportionately more votes from Protestant than Catholic areas of Germany.", "questions": ["When have Lutheran Churches repudiated Luther's statements about the Jews?", "What did a survey of North American Lutherans find that Lutherans felt about Jews compared to other minority groups?", "Who found that Protestants voted for Nazis more than Catholics?", "When were the elections that produced a higher vote by Protestant Nazi sympathizers than by Catholics?"]}, {"id": "7_90", "context": "Luther had been suffering from ill health for years, including Ménière's disease, vertigo, fainting, tinnitus, and a cataract in one eye. From 1531 to 1546, his health deteriorated further. The years of struggle with Rome, the antagonisms with and among his fellow reformers, and the scandal which ensued from the bigamy of the Philip of Hesse incident, in which Luther had played a leading role, all may have contributed. In 1536, he began to suffer from kidney and bladder stones, and arthritis, and an ear infection ruptured an ear drum. In December 1544, he began to feel the effects of angina.", "questions": ["How was Luther's health for the years of 1531 to 1546?", "Besides the arguments with Rome and his own fellow reformers, what scandal  contributed to Luther's failing health?", "What did Luther begin to experience in 1536?", "What other health issues did Luther have?", "By 1544 what did Luther have to deal with in his health?"]}, {"id": "7_91", "context": "His poor physical health made him short-tempered and even harsher in his writings and comments. His wife Katharina was overheard saying, \"Dear husband, you are too rude,\" and he responded, \"They are teaching me to be rude.\" In 1545 and 1546 Luther preached three times in the Market Church in Halle, staying with his friend Justus Jonas during Christmas.", "questions": ["What made Luther even more short tempered than usual?", "What other aspect of Luther's life was affected by his health?", "How did Luther's writings sound as he became less healthy?", "Who scolded Luther about his rudeness?", "How many times did Luther preach in Halle in 1545 and 1546?"]}, {"id": "7_92", "context": "His last sermon was delivered at Eisleben, his place of birth, on 15 February 1546, three days before his death. It was \"entirely devoted to the obdurate Jews, whom it was a matter of great urgency to expel from all German territory,\" according to Léon Poliakov. James Mackinnon writes that it concluded with a \"fiery summons to drive the Jews bag and baggage from their midst, unless they desisted from their calumny and their usury and became Christians.\" Luther said, \"we want to practice Christian love toward them and pray that they convert,\" but also that they are \"our public enemies ... and if they could kill us all, they would gladly do so. And so often they do.\"", "questions": ["Where was Luther's last sermon preached?", "When was Luther's last sermon?", "What was the focus of Luther's last sermon?", "From whence did Luther want to expel the Jews?", "What did Luther say would allow the Jews to stay?"]}, {"id": "7_93", "context": "Luther's final journey, to Mansfeld, was taken because of his concern for his siblings' families continuing in their father Hans Luther's copper mining trade. Their livelihood was threatened by Count Albrecht of Mansfeld bringing the industry under his own control. The controversy that ensued involved all four Mansfeld counts: Albrecht, Philip, John George, and Gerhard. Luther journeyed to Mansfeld twice in late 1545 to participate in the negotiations for a settlement, and a third visit was needed in early 1546 for their completion.", "questions": ["To where was Luther's final journey?", "What was Luther involved in dealing with the minds in Mansfeld?", "When did Luther travel to Mansfeld twice?", "When was a third visit to Mnafeld scheduled? ", "For whom was Luther concerned about in Mansfeld?"]}, {"id": "7_94", "context": "The negotiations were successfully concluded on 17 February 1546. After 8 a.m., he experienced chest pains. When he went to his bed, he prayed, \"Into your hand I commit my spirit; you have redeemed me, O Lord, faithful God\" (Ps. 31:5), the common prayer of the dying. At 1 a.m. he awoke with more chest pain and was warmed with hot towels. He thanked God for revealing his Son to him in whom he had believed. His companions, Justus Jonas and Michael Coelius, shouted loudly, \"Reverend father, are you ready to die trusting in your Lord Jesus Christ and to confess the doctrine which you have taught in his name?\" A distinct \"Yes\" was Luther's reply.", "questions": ["When were the negotiations finished in Mansfeld?", "After the negotiations were done what did Luther experience?", "Luther went to bed quoting what scripture?", "What is Psalm 31:5?", "When did Luther waken with more chest pains?"]}, {"id": "7_95", "context": "An apoplectic stroke deprived him of his speech, and he died shortly afterwards at 2:45 a.m. on 18 February 1546, aged 62, in Eisleben, the city of his birth. He was buried in the Castle Church in Wittenberg, beneath the pulpit. The funeral was held by his friends Johannes Bugenhagen and Philipp Melanchthon. A year later, troops of Luther's adversary Charles V, Holy Roman Emperor entered the town, but were ordered by Charles not to disturb the grave.", "questions": ["What event took away his ability of speech?", "At what time did Martin Luther die?", "On what date did Luther die?", "Where was Luther buried?", "Who performed the funeral for Martin Luther?"]}, {"id": "7_96", "context": "A piece of paper was later found on which Luther had written his last statement. The statement was in Latin, apart from \"We are beggars,\" which was in German.", "questions": ["What was later discovered written by Luther?", "In what language was most of the statement written? ", "What portion of Luther's last statement was in German?"]}, {"id": "7_97", "context": "In the 1530s and 1540s, printed images of Luther that emphasized his monumental size were crucial to the spread of Protestantism. In contrast to images of frail Catholic saints, Luther was presented as a stout man with a \"double chin, strong mouth, piercing deep-set eyes, fleshy face, and squat neck.\" He was shown to be physically imposing, an equal in stature to the secular German princes with whom he would join forces to spread Lutheranism. His large body also let the viewer know that he did not shun earthly pleasures like drinking—behavior that was a stark contrast to the ascetic life of the medieval religious orders. Famous images from this period include the woodcuts by Hans Brosamer (1530) and Lucas Cranach the Elder and Lucas Cranach the Younger (1546).", "questions": ["What kind of images of Luther were used to advertise Protestantism? ", "In contrast how were Catholic saints portrayed?", "How was Luther presented as an image to spread Protestantism?", "What was the image of Luther a contrast to the life of?", "When were images being used to promote the spread of Lutheranism?"]}, {"id": "7_98", "context": "Luther is honoured on 18 February with a commemoration in the Lutheran Calendar of Saints and in the Episcopal (United States) Calendar of Saints. In the Church of England's Calendar of Saints he is commemorated on 31 October.", "questions": ["When is Luther commemorated in the Lutheran Calendar of Saints ?", "On what other calendar is Luther commemorated?", "When is Luther commemorated by the Church of England?", "On what English calendar is Luther commemorated?", "How is Luther commemorated on the Lutheran, Episcopal, and  Church of England  calendars?"]}]}
