{"data": [{"id": "7_1", "context": "Steam engines are external combustion engines, where the working fluid is separate from the combustion products. Non-combustion heat sources such as solar power, nuclear power or geothermal energy may be used. The ideal thermodynamic cycle used to analyze this process is called the Rankine cycle. In the cycle, water is heated and transforms into steam within a boiler operating at a high pressure. When expanded through pistons or turbines, mechanical work is done. The reduced-pressure steam is then condensed and pumped back into the boiler.", "questions": [{"question": "Along with geothermal and nuclear, what is a notable non-combustion heat source?", "is_impossible": false}, {"question": "What ideal thermodynamic cycle analyzes the process by which steam engines work?", "is_impossible": false}, {"question": "In the Rankine cycle, what does water turn into when heated?", "is_impossible": false}, {"question": "At what pressure is water heated in the Rankine cycle?", "is_impossible": false}, {"question": "What types of engines are steam engines?", "is_impossible": false}, {"question": "Along with geothermal and nuclear, what is a notable combustion heat source?", "is_impossible": true}, {"question": "What ideal thermodynamic cycle analyzes the process by which solar engines work?", "is_impossible": true}, {"question": "In the Rankine cycle, what does nuclear power turn into when heated?", "is_impossible": true}, {"question": "At what pressure is nuclear power heated in the Rankine cycle?", "is_impossible": true}, {"question": "What types of engines are solar engines?", "is_impossible": true}]}, {"id": "7_2", "context": "The first commercially successful true engine, in that it could generate power and transmit it to a machine, was the atmospheric engine, invented by Thomas Newcomen around 1712. It was an improvement over Savery's steam pump, using a piston as proposed by Papin. Newcomen's engine was relatively inefficient, and in most cases was used for pumping water. It worked by creating a partial vacuum by condensing steam under a piston within a cylinder. It was employed for draining mine workings at depths hitherto impossible, and also for providing a reusable water supply for driving waterwheels at factories sited away from a suitable \"head\". Water that had passed over the wheel was pumped back up into a storage reservoir above the wheel.", "questions": [{"question": "What was the first true engine that was commercially successful?", "is_impossible": false}, {"question": "Who was the inventor of the atmospheric engine?", "is_impossible": false}, {"question": "About what year was the atmospheric engine invented?", "is_impossible": false}, {"question": "What was invented by Savery?", "is_impossible": false}, {"question": "Who conceptualized the piston?", "is_impossible": false}, {"question": "What was the first true vacuum that was commercially successful?", "is_impossible": true}, {"question": "Who was the inventor of the vacuum?", "is_impossible": true}, {"question": "About what year was the vacuum engine developed?", "is_impossible": true}, {"question": "What was invented in a storage reservoir?", "is_impossible": true}, {"question": "Who conceptualized the vacuum?", "is_impossible": true}]}, {"id": "7_3", "context": "The first full-scale working railway steam locomotive was built by Richard Trevithick in the United Kingdom and, on 21 February 1804, the world's first railway journey took place as Trevithick's unnamed steam locomotive hauled a train along the tramway from the Pen-y-darren ironworks, near Merthyr Tydfil to Abercynon in south Wales. The design incorporated a number of important innovations that included using high-pressure steam which reduced the weight of the engine and increased its efficiency. Trevithick visited the Newcastle area later in 1804 and the colliery railways in north-east England became the leading centre for experimentation and development of steam locomotives.", "questions": [{"question": "In what country was a full-scale working railway steam locomotive first invented?", "is_impossible": false}, {"question": "On what date did the first railway trip in the world occur?", "is_impossible": false}, {"question": "Where did the world's first railway journey terminate?", "is_impossible": false}, {"question": "In what constituent country of the United Kingdom is Merthyr Tydfil located?", "is_impossible": false}, {"question": "In what geographical portion of Wales is Abercynon located?", "is_impossible": false}, {"question": "In what country was a full-scale working railway steam centre first invented?", "is_impossible": true}, {"question": "On what date did the first railway trip in England occur?", "is_impossible": true}, {"question": "Where did the England's first railway journey terminate?", "is_impossible": true}, {"question": "In what constituent country of the United Kingdom is Trevithick located? ", "is_impossible": true}, {"question": "In what geographical portion of England is Abercynon located?", "is_impossible": true}]}, {"id": "7_4", "context": "The Rankine cycle and most practical steam engines have a water pump to recycle or top up the boiler water, so that they may be run continuously. Utility and industrial boilers commonly use multi-stage centrifugal pumps; however, other types are used. Another means of supplying lower-pressure boiler feed water is an injector, which uses a steam jet usually supplied from the boiler. Injectors became popular in the 1850s but are no longer widely used, except in applications such as steam locomotives.", "questions": [{"question": "What device is used to recycle the boiler water in most steam engines?", "is_impossible": false}, {"question": "What types of pumps are typically used in industrial boilers?", "is_impossible": false}, {"question": "In what decade were injectors widely used in steam engines?", "is_impossible": false}, {"question": "What is a notable application of injectors today?", "is_impossible": false}, {"question": "What are injectors used to supply?", "is_impossible": false}, {"question": "What device is used to recycle the boiler water in most jet engines?", "is_impossible": true}, {"question": "What types of pumps are typically used in jet engines?", "is_impossible": true}, {"question": "In what decade were injectors widely used in jet engines?", "is_impossible": true}, {"question": "What is a notable application of jet engines today?", "is_impossible": true}, {"question": "What are jet engines used to supply?", "is_impossible": true}]}, {"id": "7_5", "context": "It is a logical extension of the compound engine (described above) to split the expansion into yet more stages to increase efficiency. The result is the multiple expansion engine. Such engines use either three or four expansion stages and are known as triple and quadruple expansion engines respectively. These engines use a series of cylinders of progressively increasing diameter. These cylinders are designed to divide the work into equal shares for each expansion stage. As with the double expansion engine, if space is at a premium, then two smaller cylinders may be used for the low-pressure stage. Multiple expansion engines typically had the cylinders arranged inline, but various other formations were used. In the late 19th century, the Yarrow-Schlick-Tweedy balancing 'system' was used on some marine triple expansion engines. Y-S-T engines divided the low-pressure expansion stages between two cylinders, one at each end of the engine. This allowed the crankshaft to be better balanced, resulting in a smoother, faster-responding engine which ran with less vibration. This made the 4-cylinder triple-expansion engine popular with large passenger liners (such as the Olympic class), but this was ultimately replaced by the virtually vibration-free turbine engine.[citation needed]", "questions": [{"question": "How many expansion stages are used by the triple expansion engine?", "is_impossible": false}, {"question": "What are engines using four expansion stages known as?", "is_impossible": false}, {"question": "In what century was the Yarrow-Schlick-Tweedy balancing system used?", "is_impossible": false}, {"question": "What sort of engines utilized the Yarrow-Schlick-Tweedy balancing system?", "is_impossible": false}, {"question": "What class of ships is an example of large passenger liners?", "is_impossible": false}, {"question": "How many expansion stages are used by the crankshaft engine?", "is_impossible": true}, {"question": "What are engines using four expansion cylinders known as?", "is_impossible": true}, {"question": "In what century was the Olympic balancing system used?", "is_impossible": true}, {"question": "What sort of engines utilized the Olympic balancing system?", "is_impossible": true}, {"question": "What class of ships is an example of small passenger liners?", "is_impossible": true}]}, {"id": "7_6", "context": "In the 1840s and 50s, there were attempts to overcome this problem by means of various patent valve gears with a separate, variable cutoff expansion valve riding on the back of the main slide valve; the latter usually had fixed or limited cutoff. The combined setup gave a fair approximation of the ideal events, at the expense of increased friction and wear, and the mechanism tended to be complicated. The usual compromise solution has been to provide lap by lengthening rubbing surfaces of the valve in such a way as to overlap the port on the admission side, with the effect that the exhaust side remains open for a longer period after cut-off on the admission side has occurred. This expedient has since been generally considered satisfactory for most purposes and makes possible the use of the simpler Stephenson, Joy and Walschaerts motions. Corliss, and later, poppet valve gears had separate admission and exhaust valves driven by trip mechanisms or cams profiled so as to give ideal events; most of these gears never succeeded outside of the stationary marketplace due to various other issues including leakage and more delicate mechanisms.", "questions": [{"question": "Along with poppet valve gears, what type of gears utilized separate admission and exhaust valves to give ideal events?", "is_impossible": false}, {"question": "Along with Stephenson and Walschaerts, what is an example of a simple motion?", "is_impossible": false}, {"question": "How is lap provided by overlapping the admission side port?", "is_impossible": false}, {"question": "What type of gears, along with poppet valve gears, utilized separate admission and leakage cutoffs to give ideal events? ", "is_impossible": true}, {"question": "What is an example of complicated exhaust, along with Stephenson and Walschaerts?", "is_impossible": true}, {"question": "How is lap provided by overlapping the stationary marketplace port?", "is_impossible": true}, {"question": "When were attempts made to overcome stationary marketplaces?", "is_impossible": true}]}, {"id": "7_7", "context": "Lead fusible plugs may be present in the crown of the boiler's firebox. If the water level drops, such that the temperature of the firebox crown increases significantly, the lead melts and the steam escapes, warning the operators, who may then manually suppress the fire. Except in the smallest of boilers the steam escape has little effect on dampening the fire. The plugs are also too small in area to lower steam pressure significantly, depressurizing the boiler. If they were any larger, the volume of escaping steam would itself endanger the crew.[citation needed]", "questions": [{"question": "What are sometimes present in the boiler's firebox crown?", "is_impossible": false}, {"question": "What happens to the lead fusible plugs if the water level of the boiler drops?", "is_impossible": false}, {"question": "What happens after the lead melts?", "is_impossible": false}, {"question": "After the operators are warned by the escape of the steam, what may they then do?", "is_impossible": false}, {"question": "What is the escape of the steam unlikely to accomplish in all but the smallest boilers?", "is_impossible": false}, {"question": "What are sometimes present in the plug's firebox crown?", "is_impossible": true}, {"question": "What happens to the lead fusible plugs if the water level of the fire drops?", "is_impossible": true}, {"question": "What happens after the firebox melts?", "is_impossible": true}, {"question": "After the operators are warned by the escape of the firebox, what may they then do?", "is_impossible": true}, {"question": "What is the escape of the firebox unlikely to accomplish in all but the smallest boilers?", "is_impossible": true}]}, {"id": "7_8", "context": "In 1781 James Watt patented a steam engine that produced continuous rotary motion. Watt's ten-horsepower engines enabled a wide range of manufacturing machinery to be powered. The engines could be sited anywhere that water and coal or wood fuel could be obtained. By 1883, engines that could provide 10,000 hp had become feasible. The stationary steam engine was a key component of the Industrial Revolution, allowing factories to locate where water power was unavailable. The atmospheric engines of Newcomen and Watt were large compared to the amount of power they produced, but high pressure steam engines were light enough to be applied to vehicles such as traction engines and the railway locomotives.", "questions": [{"question": "Who patented a steam engine in 1781?", "is_impossible": false}, {"question": "What sort of motion did Watt's steam engine continuously produce?", "is_impossible": false}, {"question": "How many horsepower was Watt's engine?", "is_impossible": false}, {"question": "As of what year were 10000 horsepower engines available?", "is_impossible": false}, {"question": "What was the steam engine an important component of?", "is_impossible": false}, {"question": "Who patented a steam engine in 1883?", "is_impossible": true}, {"question": "What sort of motion did Newcomen's steam engine continuously produce?", "is_impossible": true}, {"question": "How many horsepower was Newcomen's engine?", "is_impossible": true}, {"question": "As of what year were 1700 horsepower engines available?", "is_impossible": true}, {"question": "What was the high pressure engine an important component of?", "is_impossible": true}]}, {"id": "7_9", "context": "The history of the steam engine stretches back as far as the first century AD; the first recorded rudimentary steam engine being the aeolipile described by Greek mathematician Hero of Alexandria. In the following centuries, the few steam-powered \"engines\" known were, like the aeolipile, essentially experimental devices used by inventors to demonstrate the properties of steam. A rudimentary steam turbine device was described by Taqi al-Din in 1551 and by Giovanni Branca in 1629. Jerónimo de Ayanz y Beaumont received patents in 1606 for fifty steam powered inventions, including a water pump for draining inundated mines. Denis Papin, a Huguenot refugee, did some useful work on the steam digester in 1679, and first used a piston to raise weights in 1690.", "questions": [{"question": "In what century did the history of the steam engine begin?", "is_impossible": false}, {"question": "Who conceptualized the aeolipile?", "is_impossible": false}, {"question": "What was Hero of Alexandria's nationality?", "is_impossible": false}, {"question": "Who described a steam turbine in 1629?", "is_impossible": false}, {"question": "In what year did Jerónimo de Ayanz y Beaumont patent a water pump for draining mines?", "is_impossible": false}, {"question": "In what century did the history of the steam digester begin?", "is_impossible": true}, {"question": "Who conceptualized the piston?", "is_impossible": true}, {"question": "What was Hero of Ayanz's nationality?", "is_impossible": true}, {"question": "Who described a steam turbine in 1690?", "is_impossible": true}, {"question": "In what year did Jeronimo de Ayanz y Beaumont patent a water pump for draining patients?", "is_impossible": true}]}, {"id": "7_10", "context": "Near the end of the 19th century compound engines came into widespread use. Compound engines exhausted steam in to successively larger cylinders to accommodate the higher volumes at reduced pressures, giving improved efficiency. These stages were called expansions, with double and triple expansion engines being common, especially in shipping where efficiency was important to reduce the weight of coal carried. Steam engines remained the dominant source of power until the early 20th century, when advances in the design of electric motors and internal combustion engines gradually resulted in the replacement of reciprocating (piston) steam engines, with shipping in the 20th-century relying upon the steam turbine.", "questions": [{"question": "What type of engines became widespread around the end of the 19th century?", "is_impossible": false}, {"question": "What are the stages in a compound engine called?", "is_impossible": false}, {"question": "In what field were double and triple expansion engines common?", "is_impossible": false}, {"question": "What product was notably shipped in vessels equipped with double and triple expansion engines?", "is_impossible": false}, {"question": "Along with electric motors, what power sources overtook steam engines in the 20th century?", "is_impossible": false}, {"question": "What type of engines became widespread around the end of the 20th century?", "is_impossible": true}, {"question": "What are the stages in an efficiency engine called?", "is_impossible": true}, {"question": "In what field were double and triple expansion replacements common?", "is_impossible": true}, {"question": "What product was notably shipped in vessels equipped with double and triple replacement engines?", "is_impossible": true}, {"question": "Along with electric motors, what power sources overtook expansion engines in the 20th century?", "is_impossible": true}]}, {"id": "7_11", "context": "The final major evolution of the steam engine design was the use of steam turbines starting in the late part of the 19th century. Steam turbines are generally more efficient than reciprocating piston type steam engines (for outputs above several hundred horsepower), have fewer moving parts, and provide rotary power directly instead of through a connecting rod system or similar means. Steam turbines virtually replaced reciprocating engines in electricity generating stations early in the 20th century, where their efficiency, higher speed appropriate to generator service, and smooth rotation were advantages. Today most electric power is provided by steam turbines. In the United States 90% of the electric power is produced in this way using a variety of heat sources. Steam turbines were extensively applied for propulsion of large ships throughout most of the 20th century.", "questions": [{"question": "The use of what device represented the last major evolution of the steam engine?", "is_impossible": false}, {"question": "In what part of the 19th century were steam turbines introduced?", "is_impossible": false}, {"question": "Above what horsepower are steam turbines usually more efficient than steam engines that use reciprocating pistons?", "is_impossible": false}, {"question": "What percentage of electrical power in the United States is made by steam turbines?", "is_impossible": false}, {"question": "Most power of what sort is generated by steam turbines today?", "is_impossible": false}, {"question": "What device's use represented the last major evolution of the generator?", "is_impossible": true}, {"question": "In what part of the 19th century where generators introduced? ", "is_impossible": true}, {"question": "Above what horsepower are steam turbines usually more efficient than generators that use reciprocating pistons?", "is_impossible": true}, {"question": "What percentage of electrical power in the United States is made by generators?", "is_impossible": true}, {"question": "What sort of power is generated by heat sources today?", "is_impossible": true}]}, {"id": "7_12", "context": "The heat required for boiling the water and supplying the steam can be derived from various sources, most commonly from burning combustible materials with an appropriate supply of air in a closed space (called variously combustion chamber, firebox). In some cases the heat source is a nuclear reactor, geothermal energy, solar energy or waste heat from an internal combustion engine or industrial process. In the case of model or toy steam engines, the heat source can be an electric heating element.", "questions": [{"question": "What is the usual source of heat for boiling water in the steam engine?", "is_impossible": false}, {"question": "Aside from firebox, what is another name for the space in which combustible material is burned in the engine?", "is_impossible": false}, {"question": "Along with nuclear, geothermal and internal combustion engine waste heat, what sort of energy might supply the heat for a steam engine?", "is_impossible": false}, {"question": "What type of heating element is often used in toy steam engines?", "is_impossible": false}, {"question": "What is the usual source of heat for boiling water in the industrial process?", "is_impossible": true}, {"question": "What, aside from firebox, is another name for the space in which combustible material is burned in the electric heating element?", "is_impossible": true}, {"question": "What type of heating element is often used in toy chamber engines?", "is_impossible": true}, {"question": "What sort of energy, along with nuclear, geothermal, and internal combustion waste heat, might supply the heat for a firebox?", "is_impossible": true}, {"question": "What type of heating element is often used in closed space engines?", "is_impossible": true}]}, {"id": "7_13", "context": "The most useful instrument for analyzing the performance of steam engines is the steam engine indicator. Early versions were in use by 1851, but the most successful indicator was developed for the high speed engine inventor and manufacturer Charles Porter by Charles Richard and exhibited at London Exhibition in 1862. The steam engine indicator traces on paper the pressure in the cylinder throughout the cycle, which can be used to spot various problems and calculate developed horsepower. It was routinely used by engineers, mechanics and insurance inspectors. The engine indicator can also be used on internal combustion engines. See image of indicator diagram below (in Types of motor units section).", "questions": [{"question": "What instrument is used to examine steam engine performance?", "is_impossible": false}, {"question": "What year saw the earliest recorded use of the steam engine indicator?", "is_impossible": false}, {"question": "What company developed the most successful steam engine indicator?", "is_impossible": false}, {"question": "Who developed a successful steam engine indicator for Charles Porter?", "is_impossible": false}, {"question": "Where was the Charles Porter steam engine indicator shown?", "is_impossible": false}, {"question": "What instrument is used to examine diagram performance?", "is_impossible": true}, {"question": "What year saw the earliest recorded use of steam engines?", "is_impossible": true}, {"question": "What company developed the most successful steam engine?", "is_impossible": true}, {"question": "Who developed a successful steam engine for Charles Porter?", "is_impossible": true}, {"question": "Where was the Charles Porter steam engine shown?", "is_impossible": true}]}, {"id": "7_14", "context": "With two-cylinder compounds used in railway work, the pistons are connected to the cranks as with a two-cylinder simple at 90° out of phase with each other (quartered). When the double expansion group is duplicated, producing a 4-cylinder compound, the individual pistons within the group are usually balanced at 180°, the groups being set at 90° to each other. In one case (the first type of Vauclain compound), the pistons worked in the same phase driving a common crosshead and crank, again set at 90° as for a two-cylinder engine. With the 3-cylinder compound arrangement, the LP cranks were either set at 90° with the HP one at 135° to the other two, or in some cases all three cranks were set at 120°.[citation needed]", "questions": [{"question": "At what degree are the pistons of a two-cylinder compound connected to the cranks?", "is_impossible": false}, {"question": "In a 4-cylinder compound engine, what degree were the individual pistons balanced at?", "is_impossible": false}, {"question": "At what angle were the groups of pistons set in relation to one another in a 4-cylinder compound?", "is_impossible": false}, {"question": "At what degree are the pistons of a two-cylinder compound connected to the pistons?", "is_impossible": true}, {"question": "In a 4-cylinder compound engine, what degree were the individual cranks balanced at", "is_impossible": true}, {"question": "At what angle were the groups of pistons set in relation to one another in a 4-cylinder crank?", "is_impossible": true}, {"question": "What happens when the double expansion crank is duplicated?", "is_impossible": true}, {"question": "What happens to railways in the first type of Vauclain compound?", "is_impossible": true}]}, {"id": "7_15", "context": "In most reciprocating piston engines, the steam reverses its direction of flow at each stroke (counterflow), entering and exhausting from the cylinder by the same port. The complete engine cycle occupies one rotation of the crank and two piston strokes; the cycle also comprises four events – admission, expansion, exhaust, compression. These events are controlled by valves often working inside a steam chest adjacent to the cylinder; the valves distribute the steam by opening and closing steam ports communicating with the cylinder end(s) and are driven by valve gear, of which there are many types.[citation needed]", "questions": [{"question": "What is a term for the reversing of steam flow in a piston engine after each stroke?", "is_impossible": false}, {"question": "How many piston strokes occur in an engine cycle?", "is_impossible": false}, {"question": "How many crank rotations are there in an engine cycle?", "is_impossible": false}, {"question": "How many events occur in an engine cycle?", "is_impossible": false}, {"question": "Along with admission, exhaust and compression, what is an event in the engine cycle?", "is_impossible": false}, {"question": "What is a term for the reversing of steam flow in a compression engine after each stroke?", "is_impossible": true}, {"question": "How many piston strokes occur in an exhaust cycle?", "is_impossible": true}, {"question": "How many crank rotations are there in a cylinder cycle?", "is_impossible": true}, {"question": "How many events occur in a steam cycle?", "is_impossible": true}, {"question": "What, along with admission, exhaust, and compression, is an event in the steam cycle?", "is_impossible": true}]}, {"id": "7_16", "context": "Uniflow engines attempt to remedy the difficulties arising from the usual counterflow cycle where, during each stroke, the port and the cylinder walls will be cooled by the passing exhaust steam, whilst the hotter incoming admission steam will waste some of its energy in restoring working temperature. The aim of the uniflow is to remedy this defect and improve efficiency by providing an additional port uncovered by the piston at the end of each stroke making the steam flow only in one direction. By this means, the simple-expansion uniflow engine gives efficiency equivalent to that of classic compound systems with the added advantage of superior part-load performance, and comparable efficiency to turbines for smaller engines below one thousand horsepower. However, the thermal expansion gradient uniflow engines produce along the cylinder wall gives practical difficulties.[citation needed]. The Quasiturbine is a uniflow rotary steam engine where steam intakes in hot areas, while exhausting in cold areas.", "questions": [{"question": "What is the name of a uniflow engine that takes in steam in hot areas and exhausts it in cold?", "is_impossible": false}, {"question": "The uniflow engine is an attempt to fix an issue that arises in what cycle?", "is_impossible": false}, {"question": "What part is added to the uniflow engine to resolve the issue in the counterflow cycle?", "is_impossible": false}, {"question": "What is the name of a uniflow engine that takes in steam in hot areas and exhausts it in passing?", "is_impossible": true}, {"question": "What cycle has an issue for which an expansion gradient attempts to fix?", "is_impossible": true}, {"question": "What part is added to the expansion gradient to resolve the issue in the counterflow cycle?", "is_impossible": true}, {"question": "What attempt to remedy the difficulties arising from gradient performance?", "is_impossible": true}, {"question": "What is the aim of the additional stroke?", "is_impossible": true}]}, {"id": "7_17", "context": "An oscillating cylinder steam engine is a variant of the simple expansion steam engine which does not require valves to direct steam into and out of the cylinder. Instead of valves, the entire cylinder rocks, or oscillates, such that one or more holes in the cylinder line up with holes in a fixed port face or in the pivot mounting (trunnion). These engines are mainly used in toys and models, because of their simplicity, but have also been used in full size working engines, mainly on ships where their compactness is valued.[citation needed]", "questions": [{"question": "What type of steam engine doesn't need valves to direct steam?", "is_impossible": false}, {"question": "What is another term for the pivot mounting?", "is_impossible": false}, {"question": "Along with toys, where are oscillating cylinder steam engines typically used?", "is_impossible": false}, {"question": "Full size working engines on what vehicles sometimes use oscillating cylinder steam engines?", "is_impossible": false}, {"question": "What type of steam engine doesn't need valves to direct engines?", "is_impossible": true}, {"question": "What is another term for the port face?", "is_impossible": true}, {"question": "Where, along with toys, are oscillating cylinder port faces typically used?", "is_impossible": true}, {"question": "On what vehicles do full size working engines sometimes use oscillating cylinder rocks?", "is_impossible": true}, {"question": "What is a variant of the simple expansion pivot mounting?", "is_impossible": true}]}, {"id": "7_18", "context": "The working fluid in a Rankine cycle can operate as a closed loop system, where the working fluid is recycled continuously, or may be an \"open loop\" system, where the exhaust steam is directly released to the atmosphere, and a separate source of water feeding the boiler is supplied. Normally water is the fluid of choice due to its favourable properties, such as non-toxic and unreactive chemistry, abundance, low cost, and its thermodynamic properties. Mercury is the working fluid in the mercury vapor turbine. Low boiling hydrocarbons can be used in a binary cycle.", "questions": [{"question": "What happens to the working fluid in a closed loop system?", "is_impossible": false}, {"question": "What sort of system releases the exhaust steam into the atmosphere?", "is_impossible": false}, {"question": "What working fluid is used in a mercury vapor turbine?", "is_impossible": false}, {"question": "What is the typical working fluid in a steam engine?", "is_impossible": false}, {"question": "What happens to the working fluid in a chemistry system?", "is_impossible": true}, {"question": "What sort of system releases the exhaust steam into the boiler?", "is_impossible": true}, {"question": "What working fluid is used in a mercury cycle?", "is_impossible": true}, {"question": "What is the typical working fluid in a vapor turbine?", "is_impossible": true}, {"question": "What can the working fluid in a boiler cycle operate as?", "is_impossible": true}]}, {"id": "7_19", "context": "The efficiency of a Rankine cycle is usually limited by the working fluid. Without the pressure reaching supercritical levels for the working fluid, the temperature range the cycle can operate over is quite small; in steam turbines, turbine entry temperatures are typically 565 °C (the creep limit of stainless steel) and condenser temperatures are around 30 °C. This gives a theoretical Carnot efficiency of about 63% compared with an actual efficiency of 42% for a modern coal-fired power station. This low turbine entry temperature (compared with a gas turbine) is why the Rankine cycle is often used as a bottoming cycle in combined-cycle gas turbine power stations.[citation needed]", "questions": [{"question": "What limits the Rankine cycle's efficiency?", "is_impossible": false}, {"question": "What is the turbine entry temperature of a steam turbine, in degrees Celsius?", "is_impossible": false}, {"question": "What is  565 °C the creep limit of?", "is_impossible": false}, {"question": "What is the approximate condenser temperature in a turbine?", "is_impossible": false}, {"question": "What is a turbine's theoretical Carnot efficiency?", "is_impossible": false}, {"question": "What limits the Rankine cycle's temperatures?", "is_impossible": true}, {"question": "What is the turbine entry temperature of a Rankine turbine, in degrees Celsius?", "is_impossible": true}, {"question": "What is 63 degrees celsius the creep limit of?", "is_impossible": true}, {"question": "What is the approximate condenser temperature in stainless steel?", "is_impossible": true}, {"question": "What is stainless steel's theoretical Carnot efficiency?", "is_impossible": true}]}, {"id": "7_20", "context": "Steam engines can be said to have been the moving force behind the Industrial Revolution and saw widespread commercial use driving machinery in factories, mills and mines; powering pumping stations; and propelling transport appliances such as railway locomotives, ships, steamboats and road vehicles. Their use in agriculture led to an increase in the land available for cultivation. There have at one time or another been steam-powered farm tractors, motorcycles (without much success) and even automobiles as the Stanley Steamer.", "questions": [{"question": "What devices have been credited as the moving force of the Industrial Revolution?", "is_impossible": false}, {"question": "Along with road vehicles, locomotives and ships, on what vehicles were steam engines used during the Industrial Revolution?", "is_impossible": false}, {"question": "What is an example of a steam-powered automobile?", "is_impossible": false}, {"question": "Along with mills and mines, in what industrial locations did steam drive machines?", "is_impossible": false}, {"question": "What did the use of steam engines in farming lead to?", "is_impossible": false}, {"question": "What devices have been credited as the moving force of cultivation?", "is_impossible": true}, {"question": "Along with road vehicles, locomotives and ships, on what vehicles were steam engines used during cultivation?", "is_impossible": true}, {"question": "What is an example of a road vehicle?", "is_impossible": true}, {"question": "Along with mills and mines, in what industrial locations did steam drive cultivation?", "is_impossible": true}, {"question": "What did the use of motorcycles in farming lead to?", "is_impossible": true}]}, {"id": "7_21", "context": "Trevithick continued his own experiments using a trio of locomotives, concluding with the Catch Me Who Can in 1808. Only four years later, the successful twin-cylinder locomotive Salamanca by Matthew Murray was used by the edge railed rack and pinion Middleton Railway. In 1825 George Stephenson built the Locomotion for the Stockton and Darlington Railway. This was the first public steam railway in the world and then in 1829, he built The Rocket which was entered in and won the Rainhill Trials. The Liverpool and Manchester Railway opened in 1830 making exclusive use of steam power for both passenger and freight trains.", "questions": [{"question": "What was the name of the locomotive that debuted in 1808?", "is_impossible": false}, {"question": "Who designed Salamanca?", "is_impossible": false}, {"question": "What type of locomotive was Salamanca?", "is_impossible": false}, {"question": "On what railroad was Salamanca used?", "is_impossible": false}, {"question": "For what railroad did Stephenson build a locomotive in 1825?", "is_impossible": false}, {"question": "What was the name of the locomotive that debuted in 1825?", "is_impossible": true}, {"question": "Who designed Salamanca?", "is_impossible": true}, {"question": "What type of locomotive was Darlington?", "is_impossible": true}, {"question": "On what railroad was Darlington used?", "is_impossible": true}, {"question": "For what railroad did Murray build a locomotive in 1825?", "is_impossible": true}]}, {"id": "7_22", "context": "A method to lessen the magnitude of this heating and cooling was invented in 1804 by British engineer Arthur Woolf, who patented his Woolf high-pressure compound engine in 1805. In the compound engine, high-pressure steam from the boiler expands in a high-pressure (HP) cylinder and then enters one or more subsequent lower-pressure (LP) cylinders. The complete expansion of the steam now occurs across multiple cylinders and as less expansion now occurs in each cylinder less heat is lost by the steam in each. This reduces the magnitude of cylinder heating and cooling, increasing the efficiency of the engine. By staging the expansion in multiple cylinders, torque variability can be reduced. To derive equal work from lower-pressure steam requires a larger cylinder volume as this steam occupies a greater volume. Therefore, the bore, and often the stroke, are increased in low-pressure cylinders resulting in larger cylinders.", "questions": [{"question": "Who patented a high-pressure compound engine in 1805?", "is_impossible": false}, {"question": "What nationality was Arthur Woolf?", "is_impossible": false}, {"question": "What is decreased by staging expansion across multiple cylinders?", "is_impossible": false}, {"question": "What needs to be larger to get the same work out of lower pressure steam?", "is_impossible": false}, {"question": "Who patented a high-pressure compound engine in 1804?", "is_impossible": true}, {"question": "What nationality was Arthur Smith?", "is_impossible": true}, {"question": "What is decreased by staging expansion across one cylinder?", "is_impossible": true}, {"question": "What needs to be larger to get the same work out of lower pressure cooling?", "is_impossible": true}, {"question": "Who patented the Woolf cooling cylinder?", "is_impossible": true}]}, {"id": "7_23", "context": "The main use for steam turbines is in electricity generation (in the 1990s about 90% of the world's electric production was by use of steam turbines) however the recent widespread application of large gas turbine units and typical combined cycle power plants has resulted in reduction of this percentage to the 80% regime for steam turbines. In electricity production, the high speed of turbine rotation matches well with the speed of modern electric generators, which are typically direct connected to their driving turbines. In marine service, (pioneered on the Turbinia), steam turbines with reduction gearing (although the Turbinia has direct turbines to propellers with no reduction gearbox) dominated large ship propulsion throughout the late 20th century, being more efficient (and requiring far less maintenance) than reciprocating steam engines. In recent decades, reciprocating Diesel engines, and gas turbines, have almost entirely supplanted steam propulsion for marine applications.", "questions": [{"question": "What percentage of electricity was made by steam turbine in the 1990s?", "is_impossible": false}, {"question": "What marine engines were less efficient than steam turbines?", "is_impossible": false}, {"question": "Along with diesel engines, what engines have overtaken steam engines for marine propulsion?", "is_impossible": false}, {"question": "What engines were used throughout most of the 20th century to propel ships?", "is_impossible": false}, {"question": "What gearing was used on steam turbine marine engines in the 20th century?", "is_impossible": false}, {"question": "What percentage of electricity was made by power plants in the 1990s?", "is_impossible": true}, {"question": "What marine engines were less efficient than gas turbines?", "is_impossible": true}, {"question": "What engines, along with diesel engines, have overtaken steam engines for gas propulsion?", "is_impossible": true}, {"question": "What engines were used throughout most of the 20th century to propel power plants?", "is_impossible": true}, {"question": "What gearing was used on steam turbine engines until the 1990s?", "is_impossible": true}]}, {"id": "7_24", "context": "The Rankine cycle is the fundamental thermodynamic underpinning of the steam engine. The cycle is an arrangement of components as is typically used for simple power production, and utilizes the phase change of water (boiling water producing steam, condensing exhaust steam, producing liquid water)) to provide a practical heat/power conversion system. The heat is supplied externally to a closed loop with some of the heat added being converted to work and the waste heat being removed in a condenser. The Rankine cycle is used in virtually all steam power production applications. In the 1990s, Rankine steam cycles generated about 90% of all electric power used throughout the world, including virtually all solar, biomass, coal and nuclear power plants. It is named after William John Macquorn Rankine, a Scottish polymath.", "questions": [{"question": "What is the steam engine's thermodynamic basis?", "is_impossible": false}, {"question": "What happens to waste heat in the Rankine cycle?", "is_impossible": false}, {"question": "In what decade did the Rankine cycle create 90% of electric power?", "is_impossible": false}, {"question": "Along with solar, coal and nuclear, what sort of plants notable use the Rankine process?", "is_impossible": false}, {"question": "What is William Rankine's nationality?", "is_impossible": false}, {"question": "What is the exhaust's thermodynamic basis?", "is_impossible": true}, {"question": "What happens to waste heat in the water?", "is_impossible": true}, {"question": "In what decade did the Rankine cycle create 90% of engine components?", "is_impossible": true}, {"question": "What, along with solar, coal, and nuclear, uses the heat process?", "is_impossible": true}, {"question": "What is William Jones's nationality?", "is_impossible": true}]}, {"id": "7_25", "context": "The historical measure of a steam engine's energy efficiency was its \"duty\". The concept of duty was first introduced by Watt in order to illustrate how much more efficient his engines were over the earlier Newcomen designs. Duty is the number of foot-pounds of work delivered by burning one bushel (94 pounds) of coal. The best examples of Newcomen designs had a duty of about 7 million, but most were closer to 5 million. Watt's original low-pressure designs were able to deliver duty as high as 25 million, but averaged about 17. This was a three-fold improvement over the average Newcomen design. Early Watt engines equipped with high-pressure steam improved this to 65 million.", "questions": [{"question": "How was the efficiency of a steam engine typically evaluated?", "is_impossible": false}, {"question": "Who invented the notion of a steam engine's duty?", "is_impossible": false}, {"question": "What is the weight of a bushel of coal in pounds?", "is_impossible": false}, {"question": "What was the ideal duty of a Newcomen engine?", "is_impossible": false}, {"question": "What was the average duty of a low-pressure Watt engine?", "is_impossible": false}, {"question": "How was the efficiency of a concept engine typically evaluated?", "is_impossible": true}, {"question": "Who invented the notion of a concept engine's duty?", "is_impossible": true}, {"question": "What is the weight of a bushel of engines in pounds?", "is_impossible": true}, {"question": "What was the ideal duty of a concept engine?", "is_impossible": true}, {"question": "What was the average duty of a concept engine?", "is_impossible": true}]}, {"id": "7_26", "context": "Reciprocating piston type steam engines remained the dominant source of power until the early 20th century, when advances in the design of electric motors and internal combustion engines gradually resulted in the replacement of reciprocating (piston) steam engines in commercial usage, and the ascendancy of steam turbines in power generation. Considering that the great majority of worldwide electric generation is produced by turbine type steam engines, the \"steam age\" is continuing with energy levels far beyond those of the turn of the 19th century.", "questions": [{"question": "What type of engines became popular for power generation after piston steam engines?", "is_impossible": false}, {"question": "What type of steam engines produced most power up to the early 20th century?", "is_impossible": false}, {"question": "What type of steam engine produces most electricity in the world today?", "is_impossible": false}, {"question": "Along with electric motors, what type of engines superseded piston steam engines?", "is_impossible": false}, {"question": "What type of engines became popular for power generation after electric engines?", "is_impossible": true}, {"question": "What type of electric engines produced most power up to the early 20th century?", "is_impossible": true}, {"question": "What type of electric engine produces most electricity in the world today?", "is_impossible": true}, {"question": "Along with electric motors, what type of engines superseded turbines?", "is_impossible": true}, {"question": "What is continuing with energy levels far beyond the turn of the 20th century?", "is_impossible": true}]}, {"id": "7_27", "context": "The first commercial steam-powered device was a water pump, developed in 1698 by Thomas Savery. It used condensing steam to create a vacuum which was used to raise water from below, then it used steam pressure to raise it higher. Small engines were effective though larger models were problematic. They proved only to have a limited lift height and were prone to boiler explosions. It received some use in mines, pumping stations and for supplying water wheels used to power textile machinery. An attractive feature of the Savery engine was its low cost. Bento de Moura Portugal introduced an ingenious improvement of Savery's construction \"to render it capable of working itself\", as described by John Smeaton in the Philosophical Transactions published in 1751. It continued to be manufactured until the late 18th century. One engine was still known to be operating in 1820.", "questions": [{"question": "Who developed the first commercial steam powered device?", "is_impossible": false}, {"question": "What was the first steam powered device used commercially?", "is_impossible": false}, {"question": "In what year was the first commercial steam powered device invented?", "is_impossible": false}, {"question": "Who notably improved the Savery water pump?", "is_impossible": false}, {"question": "Who wrote of the Savery water pump in 1751's Philosophical Transactions?", "is_impossible": false}, {"question": "Who developed the first commercial engine powered device?", "is_impossible": true}, {"question": "What was the first textile device used commercially?", "is_impossible": true}, {"question": "In what year was the first commercial textile device invented?", "is_impossible": true}, {"question": "Who notably improved the Smeaton water pump?", "is_impossible": true}, {"question": "Who wrote of the Smeaton water pump in 1751's Philosophical Transactions?", "is_impossible": true}]}, {"id": "7_28", "context": "Around 1800 Richard Trevithick and, separately, Oliver Evans in 1801 introduced engines using high-pressure steam; Trevithick obtained his high-pressure engine patent in 1802. These were much more powerful for a given cylinder size than previous engines and could be made small enough for transport applications. Thereafter, technological developments and improvements in manufacturing techniques (partly brought about by the adoption of the steam engine as a power source) resulted in the design of more efficient engines that could be smaller, faster, or more powerful, depending on the intended application.", "questions": [{"question": "Who invented a high-pressure steam engine around 1800?", "is_impossible": false}, {"question": "Who created an engine using high pressure steam in 1801?", "is_impossible": false}, {"question": "In what year did Richard Trevithick patent his device?", "is_impossible": false}, {"question": "High pressure steam engines were small enough that they could be used in what application?", "is_impossible": false}, {"question": "What were steam engines used as a source of?", "is_impossible": false}, {"question": "Who invented a high-pressure power source around 1800?", "is_impossible": true}, {"question": "Who created an engine using transport applications in 1801?", "is_impossible": true}, {"question": "In what year did Oliver Evans patent his device?", "is_impossible": true}, {"question": "High pressure power sources were small enough that they could be used in what application?", "is_impossible": true}, {"question": "What were manufacturing techniques used as a source of?", "is_impossible": true}]}, {"id": "7_29", "context": "Although the reciprocating steam engine is no longer in widespread commercial use, various companies are exploring or exploiting the potential of the engine as an alternative to internal combustion engines. The company Energiprojekt AB in Sweden has made progress in using modern materials for harnessing the power of steam. The efficiency of Energiprojekt's steam engine reaches some 27-30% on high-pressure engines. It is a single-step, 5-cylinder engine (no compound) with superheated steam and consumes approx. 4 kg (8.8 lb) of steam per kWh.[not in citation given]", "questions": [{"question": "What modern company has been notably working on a steam engine using modern materials?", "is_impossible": false}, {"question": "Where is Energiprojekt AB based?", "is_impossible": false}, {"question": "How many cylinders does the Energiprojekt AB engine have?", "is_impossible": false}, {"question": "How many pounds of steam per kilowatt hour does the Energiprojekt AB engine use?", "is_impossible": false}, {"question": "What percentage of a high pressure engine's efficiency has the Energiprojekt AB engine achieved?", "is_impossible": false}, {"question": "What modern company has been notably working on a combustion engine using modern materials?", "is_impossible": true}, {"question": "Where are high-pressure engines based?", "is_impossible": true}, {"question": "How many cylinders does the compound engine have?", "is_impossible": true}, {"question": "How many pounds of steam per kilowatt hour does the internal combustion engine use?", "is_impossible": true}, {"question": "What percentage of a high pressure engine's efficiency has the compound engine achieved?", "is_impossible": true}]}, {"id": "7_30", "context": "Where CHP is not used, steam turbines in power stations use surface condensers as a cold sink. The condensers are cooled by water flow from oceans, rivers, lakes, and often by cooling towers which evaporate water to provide cooling energy removal. The resulting condensed hot water output from the condenser is then put back into the boiler via a pump. A dry type cooling tower is similar to an automobile radiator and is used in locations where water is costly. Evaporative (wet) cooling towers use the rejected heat to evaporate water; this water is kept separate from the condensate, which circulates in a closed system and returns to the boiler. Such towers often have visible plumes due to the evaporated water condensing into droplets carried up by the warm air. Evaporative cooling towers need less water flow than \"once-through\" cooling by river or lake water; a 700 megawatt coal-fired power plant may use about 3600 cubic metres of make-up water every hour for evaporative cooling, but would need about twenty times as much if cooled by river water.[citation needed]", "questions": [{"question": "What do power station steam turbines use as a cold sink in the absence of CHP?", "is_impossible": false}, {"question": "What device is a dry cooling tower similar to?", "is_impossible": false}, {"question": "In what sort of places are dry cooling towers used?", "is_impossible": false}, {"question": "An evaporative cooling tower is also referred to as what kind of cooling tower?", "is_impossible": false}, {"question": "About how many cubic meters of make-up water is used by a 700-megawatt coal-fired power plant for evaporative cooling hourly?", "is_impossible": false}, {"question": "What do power station steam turbines use as a cold sink in the absence of water?", "is_impossible": true}, {"question": "What device is energy removal similar to?", "is_impossible": true}, {"question": "In what sort of places are rivers used?", "is_impossible": true}, {"question": "A water cooling tower is also referred to as what kind of cooling tower?", "is_impossible": true}, {"question": "About how many cubic meters of make-up water is used by a 700-megawatt water-fired power plant for evaporative cooling hourly?", "is_impossible": true}]}, {"id": "7_31", "context": "The centrifugal governor was adopted by James Watt for use on a steam engine in 1788 after Watt’s partner Boulton saw one at a flour mill Boulton & Watt were building. The governor could not actually hold a set speed, because it would assume a new constant speed in response to load changes. The governor was able to handle smaller variations such as those caused by fluctuating heat load to the boiler. Also, there was a tendency for oscillation whenever there was a speed change. As a consequence, engines equipped only with this governor were not suitable for operations requiring constant speed, such as cotton spinning. The governor was improved over time and coupled with variable steam cut off, good speed control in response to changes in load was attainable near the end of the 19th century.", "questions": [{"question": "What did Watt add to the steam engine in 1788?", "is_impossible": false}, {"question": "What was the name of Watt's partner?", "is_impossible": false}, {"question": "Where was the centrifugal governor first observed by Boulton?", "is_impossible": false}, {"question": "What is an examine of work that a centrifugal governor-equipped steam engine wasn't suitable for?", "is_impossible": false}, {"question": "What was the centrifugal governor incapable of doing?", "is_impossible": false}, {"question": "What did Watt add to the steam engine in 19th century?", "is_impossible": true}, {"question": "What was the name of Watt's boss?", "is_impossible": true}, {"question": "Where was the centrifugal governor first observed by Watt?", "is_impossible": true}, {"question": "What is an example of work that a centrifugal governor-equipped steam engine was suitable for?", "is_impossible": true}, {"question": "What were the centrifugal changes in load incapable of doing?", "is_impossible": true}]}, {"id": "7_32", "context": "The adoption of compounding was common for industrial units, for road engines and almost universal for marine engines after 1880; it was not universally popular in railway locomotives where it was often perceived as complicated. This is partly due to the harsh railway operating environment and limited space afforded by the loading gauge (particularly in Britain, where compounding was never common and not employed after 1930). However, although never in the majority, it was popular in many other countries.", "questions": [{"question": "After what year was compounding frequently used in marine engines?", "is_impossible": false}, {"question": "Compounding was not popular in the construction of what machines?", "is_impossible": false}, {"question": "What was compounding seen as being in the locomotive construction industry?", "is_impossible": false}, {"question": "After what year did compounding cease to be used in Britain?", "is_impossible": false}, {"question": "Along with marine engines and industrial units, in what machines was compounding popular?", "is_impossible": false}, {"question": "After what year was compounding frequently used in railway engines?", "is_impossible": true}, {"question": "Compounding was not popular in the loading of what machines?", "is_impossible": true}, {"question": "What was compounding seen as being in the marine industry?", "is_impossible": true}, {"question": "After what year did marine locomotives cease to be used in Britain?", "is_impossible": true}, {"question": "Along with marine engines and industrial units, in what machines were marine locomotives popular?", "is_impossible": true}]}, {"id": "7_33", "context": "The simplest valve gears give events of fixed length during the engine cycle and often make the engine rotate in only one direction. Most however have a reversing mechanism which additionally can provide means for saving steam as speed and momentum are gained by gradually \"shortening the cutoff\" or rather, shortening the admission event; this in turn proportionately lengthens the expansion period. However, as one and the same valve usually controls both steam flows, a short cutoff at admission adversely affects the exhaust and compression periods which should ideally always be kept fairly constant; if the exhaust event is too brief, the totality of the exhaust steam cannot evacuate the cylinder, choking it and giving excessive compression (\"kick back\").[citation needed]", "questions": [{"question": "What is another term for shortening the admission event?", "is_impossible": false}, {"question": "What is another term for excessive compression?", "is_impossible": false}, {"question": "What can the exhaust steam not fully do when the exhaust event is insufficiently long?", "is_impossible": false}, {"question": "Of what length are engine cycle events when the simplest valve gears are used?", "is_impossible": false}, {"question": "What is another term for shortening the expansion event?", "is_impossible": true}, {"question": "What is another term for excessive shortening?", "is_impossible": true}, {"question": "What can the exhaust steam not fully do when the steam event is insufficiently long?", "is_impossible": true}, {"question": "Of what length are engine cycle events when the simplest exhaust compression is used?", "is_impossible": true}, {"question": "What do the simplest compression cylinders give during the engine cycle?", "is_impossible": true}]}, {"id": "7_34", "context": "Using boiling water to produce mechanical motion goes back over 2000 years, but early devices were not practical. The Spanish inventor Jerónimo de Ayanz y Beaumont obtained the first patent for a steam engine in 1606. In 1698 Thomas Savery patented a steam pump that used steam in direct contact with the water being pumped. Savery's steam pump used condensing steam to create a vacuum and draw water into a chamber, and then applied pressurized steam to further pump the water. Thomas Newcomen's atmospheric engine was the first commercial true steam engine using a piston, and was used in 1712 for pumping in a mine.", "questions": [{"question": "Who received the first steam engine patent?", "is_impossible": false}, {"question": "What was the nationality of Jerónimo de Ayanz y Beaumont?", "is_impossible": false}, {"question": "In what year did Jerónimo de Ayanz y Beaumont receive a steam engine patent?", "is_impossible": false}, {"question": "In what year did Savery patent his steam pump?", "is_impossible": false}, {"question": "In what year did Newcomen's engine pump in a mine?", "is_impossible": false}, {"question": "Who received the first chamber engine patent?", "is_impossible": true}, {"question": "What was the nationality of Thomas Newcomen?", "is_impossible": true}, {"question": "In what year did Thomas Newcomen receive a steam engine patent?", "is_impossible": true}, {"question": "In what year did Newcomen patent his steam pump?", "is_impossible": true}, {"question": "In what year did Savery's engine pump in a mine?", "is_impossible": true}]}, {"id": "7_35", "context": "A steam turbine consists of one or more rotors (rotating discs) mounted on a drive shaft, alternating with a series of stators (static discs) fixed to the turbine casing. The rotors have a propeller-like arrangement of blades at the outer edge. Steam acts upon these blades, producing rotary motion. The stator consists of a similar, but fixed, series of blades that serve to redirect the steam flow onto the next rotor stage. A steam turbine often exhausts into a surface condenser that provides a vacuum. The stages of a steam turbine are typically arranged to extract the maximum potential work from a specific velocity and pressure of steam, giving rise to a series of variably sized high- and low-pressure stages. Turbines are only efficient if they rotate at relatively high speed, therefore they are usually connected to reduction gearing to drive lower speed applications, such as a ship's propeller. In the vast majority of large electric generating stations, turbines are directly connected to generators with no reduction gearing. Typical speeds are 3600 revolutions per minute (RPM) in the USA with 60 Hertz power, 3000 RPM in Europe and other countries with 50 Hertz electric power systems. In nuclear power applications the turbines typically run at half these speeds, 1800 RPM and 1500 RPM. A turbine rotor is also only capable of providing power when rotating in one direction. Therefore, a reversing stage or gearbox is usually required where power is required in the opposite direction.[citation needed]", "questions": [{"question": "What is another term for rotors?", "is_impossible": false}, {"question": "In a steam turbine, what are rotors mounted on?", "is_impossible": false}, {"question": "What is another way of referring to stators?", "is_impossible": false}, {"question": "What are stators attached to?", "is_impossible": false}, {"question": "In the United States, what is a usual turbine speed with 60 Hertz of power?", "is_impossible": false}, {"question": "What is another term for turbines?", "is_impossible": true}, {"question": "In a steam turbine, what are discs mounted on?", "is_impossible": true}, {"question": "What is another way of referring to power systems?", "is_impossible": true}, {"question": "What are rotors attaches to?", "is_impossible": true}, {"question": "IN the United States, what is a maximum potential with 60 Hertz of power?", "is_impossible": true}]}, {"id": "7_36", "context": "The weight of boilers and condensers generally makes the power-to-weight ratio of a steam plant lower than for internal combustion engines. For mobile applications steam has been largely superseded by internal combustion engines or electric motors. However, most electric power is generated using steam turbine plant, so that indirectly the world's industry is still dependent on steam power. Recent concerns about fuel sources and pollution have incited a renewed interest in steam both as a component of cogeneration processes and as a prime mover. This is becoming known as the Advanced Steam movement.[citation needed]", "questions": [{"question": "What is the power-to-weight ratio of a steam plant compared to that of an internal combustion engine?", "is_impossible": false}, {"question": "Along with internal combustion engines, what machines have superseded steam in some areas?", "is_impossible": false}, {"question": "What plants create most electric power?", "is_impossible": false}, {"question": "What is the name of the movement that seeks renewed use of steam power in the modern era?", "is_impossible": false}, {"question": "Along with fuel sources, what concern has contributed to the development of the Advanced Steam movement?", "is_impossible": false}, {"question": "What is the power-to-weight ratio of a steam plant compared to that of a steam engine?", "is_impossible": true}, {"question": "Along with internal combustion engines, what machines have superseded power in some areas?", "is_impossible": true}, {"question": "What plants create most combustion power?", "is_impossible": true}, {"question": "What is the name of the movement that seeks renewed use of combustion power in the modern era?", "is_impossible": true}, {"question": "Along with fuel sources, what concern has contributed to the development of the combustion movement?", "is_impossible": true}]}, {"id": "7_37", "context": "It is possible to use a mechanism based on a pistonless rotary engine such as the Wankel engine in place of the cylinders and valve gear of a conventional reciprocating steam engine. Many such engines have been designed, from the time of James Watt to the present day, but relatively few were actually built and even fewer went into quantity production; see link at bottom of article for more details. The major problem is the difficulty of sealing the rotors to make them steam-tight in the face of wear and thermal expansion; the resulting leakage made them very inefficient. Lack of expansive working, or any means of control of the cutoff is also a serious problem with many such designs.[citation needed]", "questions": [{"question": "What is an example of a rotary engine without pistons?", "is_impossible": false}, {"question": "What parts of a conventional reciprocating steam engine could be replaced by a pistonless rotary engine?", "is_impossible": false}, {"question": "Along with wear, what development makes it difficult to seal the rotors in an engine that lacks pistons?", "is_impossible": false}, {"question": "What is an example of a rotary engine without leakage?", "is_impossible": true}, {"question": "What parts of a conventional reciprocating steam engine could be replaced by a pistonless valve gear?", "is_impossible": true}, {"question": "What development, along with wear, makes it difficult to seal the rotors in an engine that lacks steam? ", "is_impossible": true}, {"question": "What is not a problem?", "is_impossible": true}, {"question": "What is not based on a pistonless rotary engine?", "is_impossible": true}]}, {"id": "7_38", "context": "The next major step occurred when James Watt developed (1763–1775) an improved version of Newcomen's engine, with a separate condenser. Boulton and Watt's early engines used half as much coal as John Smeaton's improved version of Newcomen's. Newcomen's and Watt's early engines were \"atmospheric\". They were powered by air pressure pushing a piston into the partial vacuum generated by condensing steam, instead of the pressure of expanding steam. The engine cylinders had to be large because the only usable force acting on them was due to atmospheric pressure.", "questions": [{"question": "When did Watt finish the development of his improvements to Newcomen's engine?", "is_impossible": false}, {"question": "What did Watt add to Newcomen's engine between 1763 and 1775?", "is_impossible": false}, {"question": "Compared to Smeaton's improvement on Newcomen's engine, how much coal did Watt's engine use?", "is_impossible": false}, {"question": "In addition to Watt, Boulton and Smeaton, whose engine was an atmosphere design?", "is_impossible": false}, {"question": "In an atmospheric engine, what does air pressure push against?", "is_impossible": false}, {"question": "When did Watt finish the development of his improvements to engine cylinders?", "is_impossible": true}, {"question": "What did Newcomen add to Wat's engine between 1763 and 1775?", "is_impossible": true}, {"question": "Compared to Smeaton's improvements on Newcomen's engine, how much steam did Watt's engine use?", "is_impossible": true}, {"question": "In addition to Watt, Boulton, and Smeaton, whose engine was a partial condenser design?", "is_impossible": true}, {"question": "In a condenser engine, what does air pressure push against?", "is_impossible": true}]}, {"id": "7_39", "context": "Steam engines frequently possess two independent mechanisms for ensuring that the pressure in the boiler does not go too high; one may be adjusted by the user, the second is typically designed as an ultimate fail-safe. Such safety valves traditionally used a simple lever to restrain a plug valve in the top of a boiler. One end of the lever carried a weight or spring that restrained the valve against steam pressure. Early valves could be adjusted by engine drivers, leading to many accidents when a driver fastened the valve down to allow greater steam pressure and more power from the engine. The more recent type of safety valve uses an adjustable spring-loaded valve, which is locked such that operators may not tamper with its adjustment unless a seal illegally is broken. This arrangement is considerably safer.[citation needed]", "questions": [{"question": "How many mechanisms does a typical steam engine have to keep boiler pressure from getting too high?", "is_impossible": false}, {"question": "What is restrained with a lever in the top of a boiler?", "is_impossible": false}, {"question": "What type of valve is used by recent safety valves?", "is_impossible": false}, {"question": "In an adjustable spring-loaded valve, what needs to be broken to allow an operator to tamper with it?", "is_impossible": false}, {"question": "Along with a desire for more steam pressure, what were early drivers looking to generate when they fastened safety valves down?", "is_impossible": false}, {"question": "How many mechanisms does a typical steam engine have to keep spring weight from getting too high?", "is_impossible": true}, {"question": "What is restrained with a lever in the top of a driver?", "is_impossible": true}, {"question": "What type of valve is used by recent springs?", "is_impossible": true}, {"question": "In an adjustable power engine, what needs to be broken to allow an operator to tamper with it?", "is_impossible": true}, {"question": "What, along with a desire for more steam pressure, were early drivers looking to generate when they fastened engines down?", "is_impossible": true}]}, {"id": "7_40", "context": "The acme of the horizontal engine was the Corliss steam engine, patented in 1849, which was a four-valve counter flow engine with separate steam admission and exhaust valves and automatic variable steam cutoff. When Corliss was given the Rumford medal the committee said that \"no one invention since Watt's time has so enhanced the efficiency of the steam engine\". In addition to using 30% less steam, it provided more uniform speed due to variable steam cut off, making it well suited to manufacturing, especially cotton spinning.", "questions": [{"question": "What was the ultimate development of the horizontal engine?", "is_impossible": false}, {"question": "In what year was the Corliss engine patented?", "is_impossible": false}, {"question": "How many valves did the Corliss engine use?", "is_impossible": false}, {"question": "What award was given to Corliss?", "is_impossible": false}, {"question": "How much less steam did the Corliss engine use compared to the Watt engine?", "is_impossible": false}, {"question": "What was the ultimate development of the vertical engine?", "is_impossible": true}, {"question": "In what year was the Rumford engine patented?", "is_impossible": true}, {"question": "How many valves did the Rumford engine use?", "is_impossible": true}, {"question": "What award was inspired by Corliss?", "is_impossible": true}, {"question": "How much less steam did the Rumford engine use compared to the Watt engine?", "is_impossible": true}]}, {"id": "7_41", "context": "The steam engine contributed much to the development of thermodynamic theory; however, the only applications of scientific theory that influenced the steam engine were the original concepts of harnessing the power of steam and atmospheric pressure and knowledge of properties of heat and steam. The experimental measurements made by Watt on a model steam engine led to the development of the separate condenser. Watt independently discovered latent heat, which was confirmed by the original discoverer Joseph Black, who also advised Watt on experimental procedures. Watt was also aware of the change in the boiling point of water with pressure. Otherwise, the improvements to the engine itself were more mechanical in nature. The thermodynamic concepts of the Rankine cycle did give engineers the understanding needed to calculate efficiency which aided the development of modern high-pressure and -temperature boilers and the steam turbine.", "questions": [{"question": "What scientific field's theory has received contributions from the steam engine?", "is_impossible": false}, {"question": "Who made experimental measurements on a model steam engine?", "is_impossible": false}, {"question": "What was developed from Watt's measurements on a model steam engine?", "is_impossible": false}, {"question": "Who confirmed Watt's discovery of latent heat?", "is_impossible": false}, {"question": "What concept, originally discovered by Black, was later discovered independently by Watt?", "is_impossible": false}, {"question": "What scientific field's theory has received contributions from the Rankine engine?", "is_impossible": true}, {"question": "Who made experimental measurements on a model Rankine cycle?", "is_impossible": true}, {"question": "What was developed from Watt's measurements on an atmospheric concept?", "is_impossible": true}, {"question": "Who confirmed Watt's discovery of mechanical heat?", "is_impossible": true}, {"question": "What concept, originally discovered by Watt, was later discovered independently by Black?", "is_impossible": true}]}, {"id": "7_42", "context": "One of the principal advantages the Rankine cycle holds over others is that during the compression stage relatively little work is required to drive the pump, the working fluid being in its liquid phase at this point. By condensing the fluid, the work required by the pump consumes only 1% to 3% of the turbine power and contributes to a much higher efficiency for a real cycle. The benefit of this is lost somewhat due to the lower heat addition temperature. Gas turbines, for instance, have turbine entry temperatures approaching 1500 °C. Nonetheless, the efficiencies of actual large steam cycles and large modern gas turbines are fairly well matched.[citation needed]", "questions": [{"question": "What is a main advantage of the Rankine cycle?", "is_impossible": false}, {"question": "During the compression stage of the Rankine cycle, what state is the working fluid in?", "is_impossible": false}, {"question": "How much turbine power is consumed by the pump while the work fluid is condensed?", "is_impossible": false}, {"question": "What is the approximate turbine entry temperature of a gas turbine?", "is_impossible": false}, {"question": "What is a main advantage of the efficiency cycle?", "is_impossible": true}, {"question": "During the compression stage of the efficiency cycle, what state is the working fluid in?", "is_impossible": true}, {"question": "How much temperature is consumed by the pump while the work fluid is condensed?", "is_impossible": true}, {"question": "What is the approximate turbine entry temperature of a pump turbine?", "is_impossible": true}, {"question": "What results in the work required by the pump to consume only 0.5% of the turbine power?", "is_impossible": true}]}, {"id": "7_43", "context": "Other components are often present; pumps (such as an injector) to supply water to the boiler during operation, condensers to recirculate the water and recover the latent heat of vaporisation, and superheaters to raise the temperature of the steam above its saturated vapour point, and various mechanisms to increase the draft for fireboxes. When coal is used, a chain or screw stoking mechanism and its drive engine or motor may be included to move the fuel from a supply bin (bunker) to the firebox. See: Mechanical stoker", "questions": [{"question": "What is an example of a pump component?", "is_impossible": false}, {"question": "In addition to recirculating water, what do condensers do?", "is_impossible": false}, {"question": "What components raise steam temperature above its saturated vapor point?", "is_impossible": false}, {"question": "What is another name for a coal supply bin?", "is_impossible": false}, {"question": "What mechanism moves coal from a bunker to the firebox?", "is_impossible": false}, {"question": "What is an example of a firebox?", "is_impossible": true}, {"question": "IN addition to recirculating water, what do bunkers do?", "is_impossible": true}, {"question": "What components raise steam temperature above its saturated firebox point?", "is_impossible": true}, {"question": "What is another name for a firebox?", "is_impossible": true}, {"question": "What mechanism moves coal from a firebox to a bunker?", "is_impossible": true}]}, {"id": "7_44", "context": "Land-based steam engines could exhaust much of their steam, as feed water was usually readily available. Prior to and during World War I, the expansion engine dominated marine applications where high vessel speed was not essential. It was however superseded by the British invention steam turbine where speed was required, for instance in warships, such as the dreadnought battleships, and ocean liners. HMS Dreadnought of 1905 was the first major warship to replace the proven technology of the reciprocating engine with the then-novel steam turbine.[citation needed]", "questions": [{"question": "The frequent availability of what substance allowed land-based steam engines to exhaust a great deal of steam?", "is_impossible": false}, {"question": "People of what nationality invented the steam turbine?", "is_impossible": false}, {"question": "What was an example of a type of warship that required high speed?", "is_impossible": false}, {"question": "Other than warships, what ships typically required high speeds?", "is_impossible": false}, {"question": "In what year was HMS Dreadnought launched?", "is_impossible": false}, {"question": "The frequent availability of what substance allowed land-based steam engines to exhaust a great deal of battleships?", "is_impossible": true}, {"question": "People of what nationality invented the HMS Dreadnought?", "is_impossible": true}, {"question": "What was an example of a type of warship that required expansion engines?", "is_impossible": true}, {"question": "What ships, other than warships, typically required expansion engines?", "is_impossible": true}, {"question": "In what year was World War I launched?", "is_impossible": true}]}, {"id": "7_45", "context": "Virtually all nuclear power plants generate electricity by heating water to provide steam that drives a turbine connected to an electrical generator. Nuclear-powered ships and submarines either use a steam turbine directly for main propulsion, with generators providing auxiliary power, or else employ turbo-electric transmission, where the steam drives a turbo generator set with propulsion provided by electric motors. A limited number of steam turbine railroad locomotives were manufactured. Some non-condensing direct-drive locomotives did meet with some success for long haul freight operations in Sweden and for express passenger work in Britain, but were not repeated. Elsewhere, notably in the U.S.A., more advanced designs with electric transmission were built experimentally, but not reproduced. It was found that steam turbines were not ideally suited to the railroad environment and these locomotives failed to oust the classic reciprocating steam unit in the way that modern diesel and electric traction has done.[citation needed]", "questions": [{"question": "What do nuclear power plants heat to create electricity?", "is_impossible": false}, {"question": "What does the steam generated by a nuclear power plant drive?", "is_impossible": false}, {"question": "In a nuclear power plant, what is the steam turbine connected to?", "is_impossible": false}, {"question": "What is it called when steam propels a turbo generator with electric motor propulsion?", "is_impossible": false}, {"question": "Where were non-condensing direct-drive locomotives notably used for fast passenger trains?", "is_impossible": false}, {"question": "What do nuclear power plants heat to create steam turbines?", "is_impossible": true}, {"question": "What does the steam generated by a auxiliary power drive?", "is_impossible": true}, {"question": "What in a nuclear power plant is the diesel turbine connected to?", "is_impossible": true}, {"question": "What is it called when steam propels a turbo generator with diesel motor propulsion?", "is_impossible": true}, {"question": "Where were non-condensing direct-drive locomotives notably used for fast passenger ships?", "is_impossible": true}]}, {"id": "7_46", "context": "The Rankine cycle is sometimes referred to as a practical Carnot cycle because, when an efficient turbine is used, the TS diagram begins to resemble the Carnot cycle. The main difference is that heat addition (in the boiler) and rejection (in the condenser) are isobaric (constant pressure) processes in the Rankine cycle and isothermal (constant temperature) processes in the theoretical Carnot cycle. In this cycle a pump is used to pressurize the working fluid which is received from the condenser as a liquid not as a gas. Pumping the working fluid in liquid form during the cycle requires a small fraction of the energy to transport it compared to the energy needed to compress the working fluid in gaseous form in a compressor (as in the Carnot cycle). The cycle of a reciprocating steam engine differs from that of turbines because of condensation and re-evaporation occurring in the cylinder or in the steam inlet passages.", "questions": [{"question": "What is the Rankine cycle sometimes called?", "is_impossible": false}, {"question": "Where does heat rejection occur in the Rankine cycle?", "is_impossible": false}, {"question": "What does isobaric mean?", "is_impossible": false}, {"question": "What is a term that means constant temperature?", "is_impossible": false}, {"question": "In the Rankine cycle, in what state is the working fluid received in the condenser?", "is_impossible": false}, {"question": "What is the cycle condenser sometimes called?", "is_impossible": true}, {"question": "Where does heat rejection occur in the Rankine cycle?", "is_impossible": true}, {"question": "What does Carnot mean?", "is_impossible": true}, {"question": "What is a term that means constant energy?", "is_impossible": true}, {"question": "In the Rankine cycle, in what state is the working fluid received in the steam?", "is_impossible": true}]}]}
